#Область ОбработчикиОсновныхСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Отказ = Истина;

	МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();

	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочееМесто, "КладовщикВиртуальнойПолки", Ложь) Тогда

		ОткрытьФорму("Обработка.ПанельНеавторизованногоОператора.Форма.ВнутреннееПеремещение",,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	Иначе

		ОткрытьФорму("Обработка.ПанельНеавторизованногоОператора.Форма.ВиртуальнаяПолка",,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти