#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Проведение

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка                                КАК Ссылка,
	|	ДанныеДокумента.Магазин                               КАК Магазин,
	|	ДанныеДокумента.Контрагент                            КАК Контрагент,
	|	ДанныеДокумента.ХозяйственнаяОперация                 КАК ХозяйственнаяОперация,
	|	(НЕ ДанныеДокумента.Магазин.СкладУправляющейСистемы)  КАК ФормироватьДвижения,
	|	ДанныеДокумента.Дата                                  КАК Период,
	|	ДанныеДокумента.ДокументОснование                     КАК ДокументОснование
	|ИЗ
	|	Документ.РегистрацияБезналичнойОплаты                 КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|;";
	РезультатЗапроса = Запрос.Выполнить();
	Реквизиты = РезультатЗапроса.Выбрать();
	Реквизиты.Следующий();
	
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВПараметрыЗапроса(РезультатЗапроса, Реквизиты, Запрос);
	
	ПоРаспоряжению = Ложь;
	Если ЗначениеЗаполнено(Реквизиты.ДокументОснование) 
		И ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		
		ПоРаспоряжению = Истина;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПоРаспоряжению", ПоРаспоряжению);
	
	Запрос.Текст = 
	//[0] ТаблицаРасчетыСПоставщиками
	"ВЫБРАТЬ
	|	ТаблицаОплата.НомерСтроки                         КАК НомерСтроки,
	|	&Период                                           КАК Период,
	|	ВЫБОР
	|		КОГДА &ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                             КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА ТаблицаОплата.ДокументРасчетовСКонтрагентом ССЫЛКА Документ.ПоступлениеТоваров
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОплата.ДокументРасчетовСКонтрагентом.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|						ТОГДА ТаблицаОплата.ДокументРасчетовСКонтрагентом
	|					ИНАЧЕ ТаблицаОплата.ДокументРасчетовСКонтрагентом.ЗаказПоставщику
	|				КОНЕЦ
	|		ИНАЧЕ ТаблицаОплата.ДокументРасчетовСКонтрагентом
	|	КОНЕЦ КАК ДокументРасчета,
	|	&Контрагент                                       КАК Поставщик,
	|	&Магазин                                          КАК Магазин,
	|	ТаблицаОплата.Сумма                               КАК Сумма,
	|	ТаблицаОплата.Сумма                               КАК КОплате,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)    КАК ФормаОплаты
	|ИЗ
	|	Документ.РегистрацияБезналичнойОплаты.РасшифровкаПлатежа КАК ТаблицаОплата
	|ГДЕ
	|	ТаблицаОплата.Ссылка = &Ссылка
	|	И &ФормироватьДвижения И &ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПрочиеРасходы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаОплата.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//[1] ТаблицаДенежныеСредстваКВыплате
	|ВЫБРАТЬ
	|	&Период                                          КАК Период,
	|	&ХозяйственнаяОперация                           КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)           КАК ВидДвижения,
	|	&ДокументОснование                               КАК РаспоряжениеНаРасходованиеДенежныхСредств,
	|	&Магазин                                         КАК Магазин,
	|	Оплата.СтатьяДвиженияДенежныхСредств             КАК СтатьяДвиженияДенежныхСредств,
	|	Оплата.ДокументРасчетовСКонтрагентом             КАК ДокументРасчета,
	|	Оплата.Сумма                                     КАК Сумма
	|ИЗ
	|	Документ.РегистрацияБезналичнойОплаты.РасшифровкаПлатежа КАК Оплата
	|ГДЕ
	|	Оплата.Ссылка = &Ссылка И &ПоРаспоряжению
	|";
	
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваКВыплате", Результат[1].Выгрузить());

	
КонецПроцедуры

#КонецЕсли
