#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Проведение

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст ="ВЫБРАТЬ
	|	ДанныеДокумента.Дата            КАК Период,
	|	ДанныеДокумента.Ссылка          КАК Ссылка,
	|	ДанныеДокумента.Магазин         КАК Магазин,
	|   ЕСТЬNULL((НЕ ДанныеДокумента.Магазин.СкладУправляющейСистемы), ИСТИНА) КАК ФормироватьДвижения
	|ИЗ
	|	Документ.УстановкаСебестоимости КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",                        Реквизиты.Период);
	Запрос.УстановитьПараметр("Магазин",                       Реквизиты.Магазин);
	Запрос.УстановитьПараметр("Ссылка",                        Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ИспользоватьУчетСебестоимости", Константы.ИспользоватьУчетСебестоимости.Получить());
	Запрос.УстановитьПараметр("ФормироватьДвижения",           Реквизиты.ФормироватьДвижения);
	
	Запрос.Текст = 
	"//0 ВтТаблицаТовары
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки    КАК НомерСтроки,
	|	ТаблицаТовары.Ссылка         КАК Ссылка,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Цена           КАК Цена,
	|   &Магазин КАК Магазин	
	|ПОМЕСТИТЬ ВтТаблицаТовары
	|ИЗ
	|	Документ.УстановкаСебестоимости.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|   И НЕ ТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|   И &ФормироватьДвижения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//1 ТаблицаСебестоимостьНоменклатуры
	|ВЫБРАТЬ
	|   &Период                      КАК Период,
	|	ТаблицаТовары.НомерСтроки    КАК НомерСтроки,
	|	ТаблицаТовары.Номенклатура   КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Цена           КАК Цена,
	|   ТаблицаТовары.Магазин        КАК Магазин
	|ИЗ
	|	ВтТаблицаТовары              КАК ТаблицаТовары
	|
	|ГДЕ 
	|   &ИспользоватьУчетСебестоимости
	|   И &ФормироватьДвижения
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки	
	|;
	|////////////////////////////////////////////////////////////////////////////////";
		
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСебестоимостьНоменклатуры",   Результат[1].Выгрузить());
		
КонецПроцедуры

#КонецЕсли
