
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПотокаОбмена.ПолученныеДанные
		|ИЗ
		|	РегистрСведений.ДанныеПотокаОбмена КАК ДанныеПотокаОбмена
		|ГДЕ
		|	ДанныеПотокаОбмена.ВремяПолучения = &ВремяПолучения";
	
	Запрос.УстановитьПараметр("ВремяПолучения", Запись.ВремяПолучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПолученныеДанныеОбмена = Выборка.ПолученныеДанные.Получить();
	КонецЕсли;
	
КонецПроцедуры
