
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Статусы.Параметры.УстановитьЗначениеПараметра("Регистратор", Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПосылкаПолучена(Команда)
	ПосылкаПолученаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПосылкаПолученаНаСервере()
	
	ТекДата = ТекущаяДатаСеанса();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыСтатусовТТН.Ссылка
		|ИЗ
		|	Справочник.КодыСтатусовТТН КАК КодыСтатусовТТН
		|ГДЕ
		|	КодыСтатусовТТН.ОператорДоставки = &ОператорДоставки
		|	И КодыСтатусовТТН.ЗавершающийСтатус";
	
	Запрос.УстановитьПараметр("ОператорДоставки", Объект.ОператорДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтатусТТН = Выборка.Ссылка;
		
		НаборЗаписей = РегистрыСведений.СтатусыТТН.СоздатьНаборЗаписей(); 

		НаборЗаписей.Отбор.Регистратор.Установить(Объект.Ссылка); 

		НоваяЗапись 					= НаборЗаписей.Добавить();
		НоваяЗапись.Регистратор			= Объект.Ссылка; 
		НоваяЗапись.Период 				= ТекДата;
		НоваяЗапись.СтатусЭН   			= СтатусТТН; 
		НаборЗаписей.Записать(Ложь);  
	КонецЕсли;		

КонецПроцедуры

