////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СуммаБезСкидок                   = Параметры.СуммаБезСкидок;
	СуммаАвтоматическойСкидкиНаценки = Параметры.СуммаАвтоматическойСкидкиНаценки;
	СуммаРучнойСкидкиНаценки         = Параметры.СуммаРучнойСкидкиНаценки;
	Валюта                           = Параметры.Валюта;
	
	СуммаДокумента = СуммаБезСкидок;
	СуммаДокументаСУчетомСкидкиАвтоматичскойСкидки = СуммаБезСкидок - СуммаАвтоматическойСкидкиНаценки;
	Если СуммаДокументаСУчетомСкидкиАвтоматичскойСкидки >= СуммаРучнойСкидкиНаценки Тогда
		СуммаДокументаСУчетомСкидки = СуммаДокументаСУчетомСкидкиАвтоматичскойСкидки - СуммаРучнойСкидкиНаценки;
	Иначе
		СуммаРучнойСкидкиНаценки = СуммаДокументаСУчетомСкидкиАвтоматичскойСкидки;
		СуммаДокументаСУчетомСкидки = 0;
	КонецЕсли;
	
	Если СуммаРучнойСкидкиНаценки < 0 Тогда
		СуммаРучнойСкидкиНаценки = -СуммаРучнойСкидкиНаценки;
		ВариантПредоставления = 2;
		Элементы.ВариантыПредоставления.ТекущаяСтраница = Элементы.ВариантыПредоставления.ПодчиненныеЭлементы.Наценка;
	Иначе
		СуммаРучнойСкидкиНаценки = СуммаРучнойСкидкиНаценки;
		ВариантПредоставления = 1;
		Элементы.ВариантыПредоставления.ТекущаяСтраница = Элементы.ВариантыПредоставления.ПодчиненныеЭлементы.Скидка;
	КонецЕсли;
	
	Если СуммаДокумента > 0 Тогда
		ПроцентРучнойСкидкиНаценки = СуммаРучнойСкидкиНаценки * 100 / СуммаДокумента;
	КонецЕсли;
	
	МаксимальнаяСуммаСкидки  = МаксимальныйПроцентСкидки * СуммаДокумента / 100;
	Если МаксимальнаяСуммаСкидки = 0 ИЛИ МаксимальнаяСуммаСкидки > (СуммаБезСкидок - СуммаАвтоматическойСкидкиНаценки) Тогда
		МаксимальнаяСуммаСкидки            = (СуммаБезСкидок - СуммаАвтоматическойСкидкиНаценки);
	КонецЕсли;
	МаксимальнаяСуммаСкидкиДляКонтроля = (СуммаБезСкидок - СуммаАвтоматическойСкидкиНаценки);
	МаксимальнаяСуммаСкидки = Мин(МаксимальнаяСуммаСкидки, МаксимальнаяСуммаСкидкиДляКонтроля);
	
	Если СуммаБезСкидок <> 0 Тогда
		Если МаксимальныйПроцентСкидки = 0 ИЛИ МаксимальныйПроцентСкидки > (МаксимальнаяСуммаСкидки/СуммаБезСкидок)*100 Тогда
			МаксимальныйПроцентСкидки = (МаксимальнаяСуммаСкидки/СуммаБезСкидок)*100;
		КонецЕсли;
	КонецЕсли;
	
	Если МаксимальнаяСуммаСкидки > 0 Тогда
		Элементы.СуммаСкидки.КнопкаВыпадающегоСписка = Истина;
		Элементы.СуммаСкидки.СписокВыбора.Добавить(МаксимальнаяСуммаСкидки, Формат(МаксимальнаяСуммаСкидки, "ЧЦ=15; ЧДЦ=2"));
	КонецЕсли;
	
	Если МаксимальныйПроцентСкидки > 0 Тогда
		Элементы.ПроцентСкидки.КнопкаВыпадающегоСписка = Истина;
		Элементы.ПроцентСкидки.СписокВыбора.Добавить(МаксимальныйПроцентСкидки, Формат(МаксимальныйПроцентСкидки, "ЧЦ=15; ЧДЦ=2"));
	КонецЕсли;
	
	Если МаксимальнаяСуммаНаценки > 0 Тогда
		Элементы.СуммаНаценки.КнопкаВыпадающегоСписка = Истина;
		Элементы.СуммаНаценки.СписокВыбора.Добавить(МаксимальнаяСуммаНаценки, Формат(МаксимальнаяСуммаНаценки, "ЧЦ=15; ЧДЦ=2"));
	КонецЕсли;
	
	Если МаксимальныйПроцентНаценки > 0 Тогда
		Элементы.ПроцентНаценки.КнопкаВыпадающегоСписка = Истина;
		Элементы.ПроцентНаценки.СписокВыбора.Добавить(МаксимальныйПроцентНаценки, Формат(МаксимальныйПроцентНаценки, "ЧЦ=15; ЧДЦ=2"));
	КонецЕсли;
	
	Элементы.ВариантПредоставления.СписокВыбора.Добавить(1, НСтр("ru = 'Скидка'"));
	Элементы.ВариантПредоставления.СписокВыбора.Добавить(2, НСтр("ru = 'Наценка'"));
	
	Элементы.СуммаСкидки.МаксимальноеЗначение = Параметры.СуммаДокумента;
	
КонецПроцедуры // ПриСозданииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД

// Процедура - обработчик команды "ОК".
//
&НаКлиенте
Процедура ОК(Команда)
	
	Если ВариантПредоставления = 1 Тогда
		ОчиститьСообщения();
		Если ПроверитьЗаполнение() Тогда
			Закрыть(СуммаРучнойСкидкиНаценки);
		КонецЕсли;
	Иначе
		Закрыть(-СуммаРучнойСкидкиНаценки);
	КонецЕсли;
	
КонецПроцедуры // ОК()

// Процедура - обработчик команды "Отмена".
//
&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры // Отмена()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ШАПКИ

// Процедура - обработчик события "ПриИзменении" поля "ВариантПредоставления".
//
&НаКлиенте
Процедура ВариантПредоставленияПриИзменении(Элемент)
	
	Если ВариантПредоставления = 1 Тогда
		Элементы.ВариантыПредоставления.ТекущаяСтраница = Элементы.ВариантыПредоставления.ПодчиненныеЭлементы.Скидка;
		СуммаДокументаСУчетомСкидки = СуммаДокумента - СуммаАвтоматическойСкидкиНаценки - СуммаРучнойСкидкиНаценки;
	Иначе
		Элементы.ВариантыПредоставления.ТекущаяСтраница = Элементы.ВариантыПредоставления.ПодчиненныеЭлементы.Наценка;
		СуммаДокументаСУчетомСкидки = СуммаДокумента - СуммаАвтоматическойСкидкиНаценки + СуммаРучнойСкидкиНаценки;
	КонецЕсли;
	
КонецПроцедуры // ВариантПредоставленияПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля "СуммаСкидки".
//
&НаКлиенте
Процедура СуммаСкидкиПриИзменении(Элемент)
	
	Если СуммаДокумента > 0 Тогда
		ПроцентРучнойСкидкиНаценки = СуммаРучнойСкидкиНаценки * 100 / СуммаДокумента;
	КонецЕсли;
	СуммаДокументаСУчетомСкидки = СуммаДокумента - СуммаАвтоматическойСкидкиНаценки - СуммаРучнойСкидкиНаценки;
	
КонецПроцедуры // СуммаСкидкиПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля "ПроцентСкидки".
//
&НаКлиенте
Процедура ПроцентСкидкиПриИзменении(Элемент)
	
	СуммаРучнойСкидкиНаценки          = ПроцентРучнойСкидкиНаценки * СуммаДокумента / 100;
	СуммаДокументаСУчетомСкидки = СуммаДокумента - СуммаАвтоматическойСкидкиНаценки - СуммаРучнойСкидкиНаценки;
	
КонецПроцедуры // ПроцентСкидкиПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля "СуммаДокументаСУчетомСкидки".
//
&НаКлиенте
Процедура СуммаДокументаСУчетомСкидкиПриИзменении(Элемент)
	
	Если СуммаДокументаСУчетомСкидки  > СуммаДокумента Тогда
		СуммаДокументаСУчетомСкидки = СуммаДокумента - СуммаАвтоматическойСкидкиНаценки;
		СуммаРучнойСкидкиНаценки = 0;
		ПроцентРучнойСкидкиНаценки = 0;
	Иначе
		СуммаРучнойСкидкиНаценки   = СуммаДокумента - СуммаАвтоматическойСкидкиНаценки - СуммаДокументаСУчетомСкидки;
		Если СуммаДокумента > 0 Тогда
			ПроцентРучнойСкидкиНаценки = СуммаРучнойСкидкиНаценки * 100 / СуммаДокумента;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры // СуммаДокументаСУчетомСкидкиПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля "СуммаНаценки".
//
&НаКлиенте
Процедура СуммаНаценкиПриИзменении(Элемент)

	Если СуммаДокумента > 0 Тогда
		ПроцентРучнойСкидкиНаценки = СуммаРучнойСкидкиНаценки * 100 / СуммаДокумента;
	КонецЕсли;
	СуммаДокументаСУчетомСкидки = СуммаДокумента - СуммаАвтоматическойСкидкиНаценки + СуммаРучнойСкидкиНаценки;
	
КонецПроцедуры // СуммаНаценкиПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля "ПроцентНаценки".
//
&НаКлиенте
Процедура ПроцентНаценкиПриИзменении(Элемент)
	
	СуммаРучнойСкидкиНаценки          = ПроцентРучнойСкидкиНаценки * СуммаДокумента / 100;
	СуммаДокументаСУчетомСкидки = СуммаДокумента + СуммаРучнойСкидкиНаценки - СуммаАвтоматическойСкидкиНаценки;
	
КонецПроцедуры // ПроцентНаценкиПриИзменении()

// Процедура - обработчик события "ПриИзменении" поля "СуммаДокументаСУчетомНаценки".
//
&НаКлиенте
Процедура СуммаДокументаСУчетомНаценкиПриИзменении(Элемент)
	
	Если СуммаДокументаСУчетомСкидки < СуммаДокумента Тогда
		СуммаДокументаСУчетомСкидки = СуммаДокумента - СуммаАвтоматическойСкидкиНаценки;
		СуммаРучнойСкидкиНаценки = 0;
		ПроцентРучнойСкидкиНаценки = 0;
	Иначе
		СуммаРучнойСкидкиНаценки   = СуммаДокументаСУчетомСкидки - (СуммаДокумента - СуммаАвтоматическойСкидкиНаценки);
		Если СуммаДокумента > 0 Тогда
			ПроцентРучнойСкидкиНаценки = СуммаРучнойСкидкиНаценки * 100 / СуммаДокумента;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // СуммаДокументаСУчетомНаценкиПриИзменении()

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если СуммаРучнойСкидкиНаценки > МаксимальнаяСуммаСкидкиДляКонтроля Тогда
		
		Отказ = Истина;
		
		ТекстСообщения =НСтр("ru = 'Сумма скидки превышает максимальное возможное значение: %МаксимальнаяСуммаСкидкиДляКонтроля% %Валюта%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%МаксимальнаяСуммаСкидкиДляКонтроля%", МаксимальнаяСуммаСкидкиДляКонтроля);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Валюта%", Валюта);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "СуммаРучнойСкидкиНаценки");
		
	КонецЕсли;
	
КонецПроцедуры
