
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОбъектаПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОбъектаПриИзменении(Элемент)
	
	Объект.Наименование = "";
	ВидОбъектаПриИзмененииНаСервере();

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидОбъектаПриИзмененииНаСервере()
		
	Если ПустаяСтрока(Объект.ВидОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Наименование.СписокВыбора.Очистить();

	Для Каждого КоллекцияИзМетаданных Из Метаданные[Объект.ВидОбъекта] Цикл
		Элементы.Наименование.СписокВыбора.Добавить(КоллекцияИзМетаданных.ПолноеИмя(), КоллекцияИзМетаданных.Имя);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

