&НаСервере
Процедура СформироватьНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Отчет");
	ОбработкаОбъект.СформироватьТабличныйДокумент(ТабличныйДокумент);

КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)

	СформироватьНаСервере();

КонецПроцедуры

&НаСервере	//	LNK 03.02.2020 12:11:41
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ (ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() И УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.АдминистраторПодарочныхСертификатов, Ложь)) Тогда

		Отказ = Истина;

	КонецЕсли;

КонецПроцедуры
