
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КлючФормы = "ФормаДокумента";

	Если Прав(ПараметрыВыполненияКоманды.Источник.ИмяФормы, СтрДлина(КлючФормы)) = КлючФормы Тогда  
		
		

		ЗаказыПокупателейКлиент.КомандаИзменитьСтатусДокумента(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник, КлючФормы);

	Иначе

		ДополнительныеПараметры = Новый Структура(
			"ДокументСсылка, Форма, КлючФормы"
			, ПараметрКоманды
			, ПараметрыВыполненияКоманды.Источник
			, "ФормаСписка"
		);
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьСтатусДокументаЗавершение", ЭтотОбъект, ДополнительныеПараметры);

		ПоказатьВопрос(ОписаниеОповещения
			, "Вы хотите изменить статус документа" + Символы.ПС + "«" + ПараметрКоманды + "»"
			, РежимДиалогаВопрос.ОКОтмена, 60, КодВозвратаДиалога.ОК
			, "Изменение статуса запроса доступности"
			, КодВозвратаДиалога.Отмена
		);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте	//	LNK 08.04.2019 10:19:42
Процедура ИзменитьСтатусДокументаЗавершение(КодВозврата, ДополнительныеПараметры)	Экспорт

	Если КодВозврата = КодВозвратаДиалога.ОК Тогда

		ЗаказыПокупателейКлиент.КомандаИзменитьСтатусДокумента(ДополнительныеПараметры.ДокументСсылка, 
																ДополнительныеПараметры.Форма, 
																ДополнительныеПараметры.КлючФормы);

	Иначе

		ПоказатьОповещениеПользователя("Отмена воздействия",, "Статус документа не изменен.", БиблиотекаКартинок.Предупреждение_32);

	КонецЕсли;

КонецПроцедуры
