//	LNK 12.08.2019 10:46:35
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	ДополнительныеСвойства.Вставить("Значение", Константы.РесурсWebRetailДоступен.Получить());

КонецПроцедуры

//	LNK 12.08.2019 10:46:40
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ДополнительныеСвойства.Свойство("СлужебнаяЗапись") Тогда

		Если НЕ Значение = ДополнительныеСвойства.Значение Тогда

			Если НЕ ПривилегированныйРежим() Тогда

				УстановитьПривилегированныйРежим(Истина);

			КонецЕсли;

			Константы.РесурсWebRetailРучноеОтключение.Установить(НЕ Значение);

			ЖурналСобытий.Регистрация("WEBRT.Доступность.РучноеОтключение"
			, ?(НЕ Значение, УровеньЖурналаРегистрации.Предупреждение, УровеньЖурналаРегистрации.Примечание)
			, Метаданные.Константы.РесурсWebRetailРучноеОтключение
			, НЕ Значение
			,
			, ?(НЕ Значение, "Контроль доступности ОТКЛЮЧЕН", "Контроль доступности возможен.")
			,, Истина);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
