//	LNK 26.04.2017 15:21:20
Функция РеквизитыМагазина(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РеквизитыМагазина(Магазин, ДатаСреза);

КонецФункции // РеквизитыМагазина()

//	LNK 26.04.2017 10:55:08
Функция РазрешитьПродажуУслуг(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РазрешитьПродажуУслуг(Магазин, ДатаСреза);

КонецФункции // РазрешитьПродажуУслуг()

//	LNK 07.11.2017 11:46:24
Функция БлокироватьИзменениеСуммыОплаты(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.БлокироватьИзменениеСуммыОплаты(Магазин, ДатаСреза);

КонецФункции // РазрешитьПродажуУслуг()

//	LNK 05.01.2018 08:38:55
Функция РазрешитьВерификациюПокупателей(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РазрешитьВерификациюПокупателей(Магазин, ДатаСреза);

КонецФункции

//	LNK 07.02.2022 07:01:18
Функция РазрешитьОтказВерификацииКонтрагента(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РазрешитьОтказВерификацииКонтрагента(Магазин, ДатаСреза);

КонецФункции

//	LNK 22.07.2022 06:07:10
Функция ОграничитьОтгрузкуРеализованногоЗаказаПокупателя(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.ОграничитьОтгрузкуРеализованногоЗаказаПокупателя(Магазин, ДатаСреза);

КонецФункции

//	LNK 11.08.2022 05:48:01
Функция ОтключитьОграниченияПериодаПоКассовомуДню(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.ОтключитьОграниченияПериодаПоКассовомуДню(Магазин, ДатаСреза);

КонецФункции

//	LNK 19.01.2018 11:24:00
Функция ПолучитьНазначениеКассыККМ(КассаККМ)	Экспорт

	Возврат РозничныеПродажиСервер.ПолучитьНазначениеКассыККМ(КассаККМ);

КонецФункции // ПолучитьНазначениеКассыККМ()

//	LNK 29.05.2019 13:24:47
Функция ИспользоватьВнешнююОбработкуРМК(Магазин)	Экспорт

	Возврат РозничныеПродажиСервер.ИспользоватьВнешнююОбработкуРМК(Магазин);

КонецФункции // ИспользоватьВнешнююОбработкуРМК()

//	LNK 13.09.2019 14:25:44
Функция РазрешитьОкруглениеВЧекеККМ(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.РазрешитьОкруглениеВЧекеККМ(Магазин, ДатаСреза);

КонецФункции

//	LNK 01.11.2019 13:27:30
Функция ЭтоУзелИнтернетМагазина()	Экспорт

	Возврат РозничныеПродажиСервер.ЭтоУзелИнтернетМагазина();

КонецФункции

//	LNK 02.04.2022 05:46:22
Функция ВсеПродажиБезНДС(ДатаСреза = '00010101')	Экспорт

	Возврат РозничныеПродажиСервер.ВсеПродажиБезНДС(ДатаСреза);

КонецФункции

//	LNK 25.05.2022 19:31:21
Функция ТоварПредставление(Номенклатура)	Экспорт

	Возврат РозничныеПродажиСервер.ТоварПредставление(Номенклатура);

КонецФункции
