////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕРЕОПРЕДЕЛЯМЫХ ОБРАБОТЧИКОВ  

//Процедура - обработчик команды "Печать ценников" обработки "Применение цен номенклатуры"
//
Процедура ПечатьЦенниковПрименениеЦенНоменклатуры(СтруктураПараметры) Экспорт
	
	ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма.Форма",
		СтруктураПараметры,           
		,                             
		Новый УникальныйИдентификатор);

КонецПроцедуры	
	
//Процедура - обработчик команды "Печать этикеток" обработки "Применение цен номенклатуры"
//
Процедура ПечатьЭтикетокПрименениеЦенНоменклатуры(СтруктураПараметры) Экспорт
	
	ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма.Форма",
		СтруктураПараметры,           
		,                             
		Новый УникальныйИдентификатор);
	
КонецПроцедуры	



