
Функция ПолучитьТочкуВхода() Экспорт
	WSURLВебСервиса = "https://api.novaposhta.ua/v2.0/xml/";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТранспортаОбмена.WSURLВебСервиса КАК WSURLВебСервиса
		|ИЗ
		|	ПланОбмена.ОбменНоваяПочта КАК ОбменНоваяПочта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиТранспортаОбмена КАК НастройкиТранспортаОбмена
		|		ПО ОбменНоваяПочта.Ссылка = НастройкиТранспортаОбмена.Узел";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЕСЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.WSURLВебСервиса)  тогда
				WSURLВебСервиса = ВыборкаДетальныеЗаписи.WSURLВебСервиса;
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	
	
	Возврат  WSURLВебСервиса;
КонецФункции


Функция ПолучитьКлючAPI() Экспорт
	APIКлюч = "435007549e68681182bb3ab1d15b1690";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиТранспортаОбмена.APIКлюч КАК APIКлюч
		|ИЗ
		|	ПланОбмена.ОбменНоваяПочта КАК ОбменНоваяПочта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиТранспортаОбмена КАК НастройкиТранспортаОбмена
		|		ПО ОбменНоваяПочта.Ссылка = НастройкиТранспортаОбмена.Узел";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЕСЛИ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.APIКлюч)  тогда
				APIКлюч = ВыборкаДетальныеЗаписи.APIКлюч;
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
	
	
	Возврат  APIКлюч;
КонецФункции


