
&НаКлиенте
Процедура ЗагрузитьИзТаблицыExcel(Команда)
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзТаблицыExcelЗавершение", ЭтотОбъект);
	ДиалогВыбораФайла  = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите файл книги MS Excel";
	//ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Лист Excel'") + " (*.xls)|*.xls|" + НСтр("ru = 'Лист Excel2007'") + " (*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Лист Excel2007'") + " (*.xlsx)|*.xlsx";
	ДиалогВыбораФайла.ПолноеИмяФайла = ПолноеИмяИмпортируемогоФайла;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;

	ДиалогВыбораФайла.Показать(ОписаниеОповещения);

КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьИзТаблицыExcelЗавершение(СписокФайлов, ДополнительныеПараметры)	Экспорт

	Если ТипЗнч(СписокФайлов) = Тип("Массив") И НЕ СписокФайлов.Количество() = 0 Тогда

		ПолноеИмяИмпортируемогоФайла = СписокФайлов[0];
		ТекстСообщения = "";

		Если ВыполнитьЗагрузкуИмёнИзФайлаExcel(
				ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяИмпортируемогоФайла), УникальныйИдентификатор),
				ОбщегоНазначенияКлиентСервер.lx_GetTooken(ПолноеИмяИмпортируемогоФайла, "."),
				ТекстСообщения) Тогда

			ПоказатьОповещениеПользователя("Операция выполнена",, ТекстСообщения, БиблиотекаКартинок.Информация2_32);

		Иначе

			ПоказатьОповещениеПользователя("Операция не выполнена из-за ошибки",, ТекстСообщения, БиблиотекаКартинок.Ошибка32);

		КонецЕсли;

	Иначе

		ПоказатьОповещениеПользователя("Операция не выполнена",, "Выбор файла не был сделан пользователем", БиблиотекаКартинок.Ошибка32);

	КонецЕсли;

КонецПроцедуры



&НаСервере	//	LNK 14.01.2019 10:56:13
Функция ВыполнитьЗагрузкуИмёнИзФайлаExcel(АдресВХранилище, Расширение, ТекстСообщения)
	Выполнено = Истина;
	Объект.Состав.Очистить(); 
	Попытка

		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);

		ТабличныйДокумент = Новый ТабличныйДокумент;

		ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);

		Колонки = Новый Массив;
		Колонки.Добавить(Новый Структура("Имя, Номер", "IDN", 1));
		Колонки.Добавить(Новый Структура("Имя, Номер", "Цена", 2));

		ТаблицаЗначений = Новый ТаблицаЗначений;
		ТаблицаЗначений.Колонки.Добавить("IDN", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(7)));
		ТаблицаЗначений.Колонки.Добавить("НомерСтроки" , Новый ОписаниеТипов("Число"));
		Для НомерСтроки = 2 По ТабличныйДокумент.ВысотаТаблицы Цикл

			СтрокаТаблицы = ТаблицаЗначений.Добавить();
			СтрокаТаблицы.НомерСтроки = НомерСтроки;


				ТекущаяОбласть = ТабличныйДокумент.ПолучитьОбласть(
					"R" + Формат(НомерСтроки, "ЧДЦ=; ЧН=0; ЧГ=") +
					"C" + Формат(1, "ЧДЦ=; ЧН=0; ЧГ=")).ТекущаяОбласть;

				Если НЕ ПустаяСтрока(ТекущаяОбласть.Текст) Тогда
						СтрокаТаблицы["IDN"] = Формат(ТекущаяОбласть.Значение,"ЧГ=0"); 

				КонецЕсли;



		КонецЦикла;

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Таблица.IDN КАК IDN
		|ПОМЕСТИТЬ Источник
		|ИЗ
		|	&ТаблицаЗначений КАК Таблица
		|ГДЕ
		|	НЕ Таблица.IDN = """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDN
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Источник КАК Источник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО Источник.IDN = Номенклатура.IDN
		|ГДЕ
		|	НЕ Номенклатура.Ссылка ЕСТЬ NULL"
		);
		Запрос.УстановитьПараметр("ТаблицаЗначений", ТаблицаЗначений);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Счётчик = 0;

		Пока Выборка.Следующий() Цикл
			Стр = Объект.Состав.Добавить();
			Стр.Номенклатура = Выборка.Номенклатура;
		КонецЦикла;
		
		ТекстСообщения = "Пройдено " + Формат(Счётчик, "ЧДЦ=; ЧН=НЕТ; ЧГ=")+ " записей.";





	Исключение

		Выполнено = Ложь;
		ТекстСообщения = ОписаниеОшибки();

	КонецПопытки;

	Возврат Выполнено;

КонецФункции // ВыполнитьЗагрузкуИмёнИзФайлаExcel()


