#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьВидимостьВсехОтделений(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОформлениеЭлементов(Ложь);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВсеОтделения(Команда)

	УстановитьВидимостьВсехОтделений(Не ВсеОтделения);
	УстановитьОформлениеЭлементов(Истина);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает в списке выбора видимость всех отделений
// 
// Параметры:
//  ВидимостьОтделений - Булево - Видимость отделений
&НаСервере
Процедура УстановитьВидимостьВсехОтделений(ВидимостьОтделений)
	
	ВсеОтделения = ВидимостьОтделений;
	Список.Параметры.УстановитьЗначениеПараметра("ВсеОтделения", ВсеОтделения);

КонецПроцедуры

// Установить оформление элементов.
// 
// Параметры:
//  Оповестить - Булево - Оповестить
&НаКлиенте
Процедура УстановитьОформлениеЭлементов(Оповестить)

	Если ВсеОтделения Тогда
		
		Элементы.ФормаВсеОтделения.Картинка  = БиблиотекаКартинок.ЗнакСтопЧБ;
		ПояснениеОповещения = "Отображаются все отделения";
	
	Иначе
		
		Элементы.ФормаВсеОтделения.Картинка  = БиблиотекаКартинок.ЗнакСтоп;
		ПояснениеОповещения = "Отображаются только работоющие";

	КонецЕсли;

	Если Оповестить = Истина Тогда

		ПоказатьОповещениеПользователя("Работающие отделения",, ПояснениеОповещения, БиблиотекаКартинок.Информация32);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
