
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	//установить ответственного по умолчанию
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

	//установить дату создания
	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если ОбщегоНазначенияРТСервер.РазрешеноИзменениеВУзле(ЭтотОбъект, Отказ) Тогда

	//	LNK 27.09.2017 15:30:43
		Возврат;

	КонецЕсли;


КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	//Если СпособФормирования <> 
	//		Перечисления.СпособыФормированияСегментов.ФормироватьДинамически Тогда
	//	СегментыСервер.Очистить(Ссылка);
	//КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	//Если НЕ ЭтоГруппа Тогда

	//	Если СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьДинамически Тогда

	//		СегментыСервер.Очистить(Ссылка);

	//	КонецЕсли;

	//	Если ДополнительныеСвойства.ЭтоНовый Тогда

	//		УправлениеПользователями.ДобавитьСегментВГруппуСегментов(Ссылка);	//	LNK 25.09.2018 10:57:33

	//	КонецЕсли;

	//КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ








