///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСимволовПослеЗапятой = 0;
	ПервыйВвод = Истина;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("ВводимаяДата") Тогда
		ВводимаяДата    = Параметры.ВводимаяДата;
		Если НЕ ЗначениеЗаполнено(ВводимаяДата) Тогда
			//ВводимаяДата = ТекущаяДата();
			ВводимаяДата = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервера();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаOK(Команда)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ВводимаяДата", ВводимаяДата);
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьДатаВыбор(Элемент, ВыбраннаяДата)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ВводимаяДата", ВводимаяДата);
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


