
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Функция выполняет проверку формулы
// и выдает соответствующее сообщение пользователю
Процедура ПроверитьФормулуИнтерактивно(Формула, Операнды, Знач Поле) Экспорт
	
	Если ЗначениеЗаполнено(Формула) Тогда
		Если РаботаСФормуламиКлиентСервер.ПроверитьФормулу(Формула, Операнды, Поле) Тогда
			
			ПоказатьОповещениеПользователя(
				НСтр("ru = 'В формуле ошибок не обнаружено'"),
				,
				,
				БиблиотекаКартинок.Информация32);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьФормулуИнтерактивно()
	
