#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТолькоПросмотр = ТолькоПросмотр();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	УстановитьОформлениеЭлементов();

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ТекущаяСтраница.Имя = "СтраницаГарантийноеПисьмо" Тогда

		УстановитьТекстГарантийногоПисьма();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьТекстГарантийногоПисьма()

	ГарантийноеПисьмо = "";

	МенеджерЗаписи = РегистрыСведений.ДанныеКредитныхПрограмм.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СчетНаОплатуПокупателю = Запись.СчетНаОплатуПокупателю;
	МенеджерЗаписи.УслугаБанка = Запись.УслугаБанка;

	МенеджерЗаписи.Прочитать();

	ДанныеПисьма = МенеджерЗаписи.ГарантийноеПисьмоДанные.Получить();

	Если ТипЗнч(ДанныеПисьма) = Тип("Структура") Тогда

		ГарантийноеПисьмо = ОбщегоНазначенияКлиентСервер.СтруктураПредставление("Данные гарантийного письма", ДанныеПисьма);

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТолькоПросмотр()

	Возврат НЕ (РольДоступна(Метаданные.Роли.АдминистраторСистемы) И ТехническаяПоддержкаВызовСервера.ИсключительныйРежим());

КонецФункции

&НаСервере
Процедура КомандаУстановитьСсылкуДокументПродажиНаСервере()

	Если НЕ ЗначениеЗаполнено(Запись.ДокументПродажи) Тогда

		Запись.ДокументПродажи = Документы.ЧекККМ.ПолучитьСсылку();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьСсылкуДокументПродажи(Команда)

	КомандаУстановитьСсылкуДокументПродажиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеЭлементов()

	Элементы.КомандаУстановитьСсылкуДокументПродажи.Доступность = НЕ ЗначениеЗаполнено(Запись.ДокументПродажи);

КонецПроцедуры

