
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УзелОбмена = Параметры.УзелОбмена;
	
	Если УзелОбмена = ПланыОбмена.ОбменМаженто2.ЭтотУзел() Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ОбновитьДеревоИзмененийСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ДеревоИзменений.ПолучитьЭлементы().Количество() = 0 Тогда
		
		ПоказатьОповещениеПользователя(
			НСтр("ru='Изменения не зарегистрированы.';uk='Зміни не зареєстровані.'")
			,,,
			БиблиотекаКартинок.Информация32);
			
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоИзменений

&НаКлиенте
Процедура ДеревоОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектОчистка(Элемент, СтандартнаяОбработка)
	
	Родитель = Элементы.ДеревоИзменений.ТекущиеДанные.ПолучитьРодителя();
	
	Если Родитель = НеОпределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьРегистрациюСервер(Элементы.ДеревоИзменений.ТекущиеДанные.Объект);
	Родитель.ПолучитьЭлементы().Удалить(Элементы.ДеревоИзменений.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДеревоИзмененийСервер();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьРегистрациюСервер(ДанныеСсылка);
	
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ДанныеСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоИзмененийСервер()
	
	СтруктураИзменений = ЗаполнитьСтруктуруИзмененийДляУзла(УзелОбмена);
	
	СтрокиДерева = ДеревоИзменений.ПолучитьЭлементы();
	СтрокиДерева.Очистить();
	
	Если СтруктураИзменений.Контрагенты.Количество() > 0 Тогда
		
		СтрокаДерева = СтрокиДерева.Добавить();
		СтрокаДерева.ВидОбъекта = НСтр("ru='Контрагенты';uk='Контрагенти'");
	
		Для Каждого ЭлементМассива Из СтруктураИзменений.Контрагенты Цикл
			СтрокаОбъекта = СтрокаДерева.ПолучитьЭлементы().Добавить();
			СтрокаОбъекта.Объект = ЭлементМассива;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

// Формирует структуру с массивами ссылок на измененные объекты для указанного узла плана обмена.
//
// Параметры:
//   УзелПланаОбмена - ПланОбменаСсылка - узел плана обмена, для которого формируется структура изменений
//
// Возвращаемое значение:
//   Структура:
//     * Контрагенты - Массив из СправочникСсылка.Контрагенты - ссылки на измененные контрагенты
&НаСервере
Функция ЗаполнитьСтруктуруИзмененийДляУзла(УзелПланаОбмена) Экспорт
	
	СтруктураИзменений = Новый Структура;
	СтруктураИзменений.Вставить("Контрагенты", Новый Массив);
	//СтруктураИзменений.Вставить("Услуги", Новый Массив);
	//СтруктураИзменений.Вставить("Ресурсы", Новый Массив);
	//СтруктураИзменений.Вставить("Заказы", Новый Массив);
	//СтруктураИзменений.Вставить("Файлы", Новый Массив);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтрагентыИзменения.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
	                      |ГДЕ
	                      |	КонтрагентыИзменения.Узел = &Узел"
						);
	
	Запрос.УстановитьПараметр("Узел", УзелПланаОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураИзменений["Контрагенты"].Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат СтруктураИзменений;
	
КонецФункции

#КонецОбласти



