#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Процедура ЗаписьСостояниеСтрокЗаказаПокупателя(СсылкаДокументаПроверки) Экспорт  
	
	Если ТипЗнч(СсылкаДокументаПроверки) = Тип("ДокументСсылка.ЗапросДоступностиТоваров") Тогда 
		
		ЗаписьВРегистр(СсылкаДокументаПроверки);
		
	ИначеЕсли ТипЗнч(СсылкаДокументаПроверки) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаДоступности.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПриходныйОрдерНаТовары КАК ТаблицаОрдер
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ТаблицаПеремещение
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ТаблицаЗаказ
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ТаблицаДоступности
			|				ПО (ТаблицаЗаказ.Ссылка = ТаблицаДоступности.ДокументОснование)
			|			ПО (ТаблицаПеремещение.ЗаказПокупателя = ТаблицаЗаказ.Ссылка)
			|		ПО (ТаблицаОрдер.ДокументОснование = ТаблицаПеремещение.Ссылка)
			|ГДЕ
			|	ТаблицаОрдер.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаДокументаПроверки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаписьВРегистр(Выборка.Ссылка, СсылкаДокументаПроверки.Проведен,, СсылкаДокументаПроверки.Проведен);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СсылкаДокументаПроверки) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаДоступности.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РасходныйОрдерНаТовары КАК ТаблицаОрдер
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ТаблицаПеремещениеОтОрдера
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ТаблицаДоступности
			|			ПО ТаблицаДоступности.Ссылка = ТаблицаПеремещениеОтОрдера.ДокументОснование
			|		ПО ТаблицаОрдер.ДокументОснование = ТаблицаПеремещениеОтОрдера.Ссылка
			|ГДЕ
			|	ТаблицаОрдер.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаДокументаПроверки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЗаписьВРегистр(Выборка.Ссылка,, СсылкаДокументаПроверки.Проведен);
			
		КонецЕсли;
		
	КонецЕсли;  

КонецПроцедуры      

Процедура ЗаписьВРегистрСтроки(СтруктураЗаписи, ОчисткаРегистра = Ложь) Экспорт 
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Отбор.ЗаказПокупателя.Установить(СтруктураЗаписи.ЗаказПокупателя);   
	НаборЗаписей.Отбор.ЗапросДоступностиТоваров.Установить(СтруктураЗаписи.ЗапросДоступностиТоваров);   
	НаборЗаписей.Отбор.КлючСвязи.Установить(СтруктураЗаписи.КлючСвязи); 
	
		
	Если Не ОчисткаРегистра Тогда
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда 
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ЗаказПокупателя = СтруктураЗаписи.ЗаказПокупателя;
			НоваяЗапись.ЗапросДоступностиТоваров = СтруктураЗаписи.ЗапросДоступностиТоваров;
			НоваяЗапись.КлючСвязи = СтруктураЗаписи.КлючСвязи; 
		Иначе 
			НоваяЗапись = НаборЗаписей[0];
		КонецЕсли;
	
		Если Не СтруктураЗаписи.ГотовКПродаже = Неопределено Тогда 
			
			НоваяЗапись.ГотовКПродаже = СтруктураЗаписи.ГотовКПродаже;
			
		КонецЕсли;
		
		Если Не СтруктураЗаписи.Продано = Неопределено Тогда 
			
			НоваяЗапись.Продано = СтруктураЗаписи.Продано;
			
		КонецЕсли;
		
		Если Не СтруктураЗаписи.Получен = Неопределено Тогда 
			
			НоваяЗапись.Получен = СтруктураЗаписи.Получен;
			
		КонецЕсли;
		
		Если Не СтруктураЗаписи.Отправлен = Неопределено Тогда 
			
			НоваяЗапись.Отправлен = СтруктураЗаписи.Отправлен;
			
		КонецЕсли;
		
		Если Не СтруктураЗаписи.Доставлено = Неопределено Тогда 
			
			НоваяЗапись.Доставлено = СтруктураЗаписи.Доставлено;
			
		КонецЕсли;

		Если Не СтруктураЗаписи.Согласовано = Неопределено Тогда 
			
			НоваяЗапись.Согласовано = СтруктураЗаписи.Согласовано;
			
		КонецЕсли;

	КонецЕсли;
		
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Функция ИнициализацияСтрокиЗаписи() Экспорт
	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ЗаказПокупателя"			, Документы.ЗаказПокупателя.ПустаяСсылка());
	СтруктураСтроки.Вставить("ЗапросДоступностиТоваров"	, Документы.ЗапросДоступностиТоваров.ПустаяСсылка());
	СтруктураСтроки.Вставить("КлючСвязи"				, 0);
	
	СтруктураСтроки.Вставить("ГотовКПродаже"			, Неопределено);
	СтруктураСтроки.Вставить("Продано"					, Неопределено);
	СтруктураСтроки.Вставить("Получен"					, Неопределено);
	СтруктураСтроки.Вставить("Отправлен"				, Неопределено);
	СтруктураСтроки.Вставить("Доставлено"				, Неопределено);
	СтруктураСтроки.Вставить("Согласовано"				, Неопределено);

	Возврат СтруктураСтроки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ЗаписьВРегистр(ДокументДляЗаписи, ОтОрдера = Ложь, Отправлен = Неопределено, Получен = Неопределено, Продан = Неопределено)
	
	СтрокаЗаписи = ИнициализацияСтрокиЗаписи();
	ОчисткаРегистра = (ДокументДляЗаписи.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отменён)
		Или (ДокументДляЗаписи.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Удалён);
	
	Для Каждого СтрокаЗапросаДоступности Из ДокументДляЗаписи.Товары Цикл 

		СтрокаЗаписи.ЗаказПокупателя = ДокументДляЗаписи.ДокументОснование;   
		СтрокаЗаписи.ЗапросДоступностиТоваров = ДокументДляЗаписи;   
		СтрокаЗаписи.КлючСвязи = СтрокаЗапросаДоступности.КлючСвязи; 
		
		Если ДокументДляЗаписи.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отменён 
				Или ДокументДляЗаписи.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Удалён  
				Или СтрокаЗапросаДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Удалён Тогда 
				
			СтрокаЗаписи.ГотовКПродаже = Ложь;
			СтрокаЗаписи.Отправлен = Ложь;
			СтрокаЗаписи.Получен = Ложь;
			СтрокаЗаписи.Согласовано = Ложь;
			
		ИначеЕсли ДокументДляЗаписи.МагазинОтправитель = ДокументДляЗаписи.МагазинПолучатель Тогда
			
			Если Не (ДокументДляЗаписи.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Новый 
					Или ДокументДляЗаписи.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВРаботе
					Или ДокументДляЗаписи.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ЧастичноСогласован) Тогда
				СтрокаЗаписи.ГотовКПродаже = Истина;
			Иначе 
				СтрокаЗаписи.ГотовКПродаже = Ложь; 
			КонецЕсли;
			
		ИначеЕсли Не ДокументДляЗаписи.ТипДоставки = Перечисления.ТипДоставкиЗаказПокупателя.Самовывоз
				И ДокументДляЗаписи.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Сборка Тогда
					
			СтрокаЗаписи.ГотовКПродаже = Истина;
			
		ИначеЕсли ОтОрдера Тогда 
			
			СтрокаЗаписи.ГотовКПродаже = Истина;
			
		КонецЕсли; 
		
		Если Не Отправлен = Неопределено Тогда 
			
			СтрокаЗаписи.Отправлен = Отправлен;
			
		КонецЕсли;
		
		Если Не Получен = Неопределено Тогда 
			
			СтрокаЗаписи.Получен = Получен;
			
		КонецЕсли; 
		
		Если Не Продан = Неопределено Тогда 
			
			СтрокаЗаписи.Продан = Продан;
			
		КонецЕсли; 

		Если ДокументДляЗаписи.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Согласован Тогда 
			
			СтрокаЗаписи.Согласовано = Истина;
			
		КонецЕсли; 

		ЗаписьВРегистрСтроки(СтрокаЗаписи, ОчисткаРегистра);		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли