
&НаСервере
Процедура УстановитьПериодНаСервере()
	ПараметрДатаНач = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрДатаНач.Использование = Истина;
	ПараметрДатаНач.Значение  = НачалоДня(Период.ДатаНачала);

	ПараметрДатаКон = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрДатаКон.Использование = Истина;
	ПараметрДатаКон.Значение  = КонецДня(Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	УстановитьПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	УстановитьПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
