&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.АдминистраторПолномочный) Тогда

		Если Запись.ИсходныйКлючЗаписи.Право.Пустая() Тогда

			Если УправлениеДоступомВызовСервера.ЗащищенныеПраваПользователей(Истина).Получить(Запись.Право) = Истина Тогда

				Запись.Право = Неопределено;	//	запретим копирование "секретного" права

			КонецЕсли;

		Иначе

			ТолькоПросмотр = Истина;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
