
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	АдресаДляОтправки = АдресаПочтыДляОтправки(ПараметрКоманды);
	МожноОтправлять = Истина;
	
	Если ПустаяСтрока(АдресаДляОтправки.КонтактноеЛицоОтправительEmail) Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не указан email контактного лица отправителя. Письмо не отправлено!!!";
		СообщениеПользователю.Сообщить();
		
		МожноОтправлять = Ложь;
		
	КонецЕсли;
	
	Если ПустаяСтрока(АдресаДляОтправки.АдресЭП) И АдресаДляОтправки.ОтправкаНаМагазин Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не указан email магазина для отпраки";
		СообщениеПользователю.Сообщить();
		
	КонецЕсли;
	
	Если МожноОтправлять Тогда		
		ОтправитьПисьмо(ПараметрКоманды, АдресаДляОтправки);

		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Письмо отправлено";
		СообщениеПользователю.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция АдресаПочтыДляОтправки(ДокументОтправки)
	
	Результат = Новый Структура;
	Результат.Вставить("КонтактноеЛицоОтправительEmail", "");
	Результат.Вставить("АдресЭП", "");
	Результат.Вставить("ОтправкаНаМагазин", Ложь);
	Результат.Вставить("ПоставщикСлужбойДоставки", "");
	Результат.Вставить("МагазинПолучатель", "");
	Результат.Вставить("НомерЗапроса", "");
	Результат.Вставить("ПутьКФайлуСтикера", "");
	Результат.Вставить("ПутьКФайлуТТН", "");
	Результат.Вставить("ПутьКФайлуТТННакладная", "");
	Результат.Вставить("ДокументДляТТН", "");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектроннаяНакладная.КонтактноеЛицоОтправитель.Email КАК КонтактноеЛицоОтправительEmail,
		|	МагазиныКонтактнаяИнформация.АдресЭП КАК АдресЭП,
		|	НЕ ЭлектроннаяНакладная.МагазинПолучатель = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка) КАК ОтправкаНаМагазин,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЭлектроннаяНакладная.ПоставщикСлужбойДоставки) КАК ПоставщикСлужбойДоставки,
		|	ЭлектроннаяНакладная.МагазинПолучатель.Наименование КАК МагазинПолучательНаименование,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ЭлектроннаяНакладная.МагазинПолучатель) КАК МагазинПолучатель,
		|	ЗапросДоступностиТоваров.Номер КАК НомерЗапроса,
		|	ЭлектроннаяНакладная.ПутьКФайлуСтикера КАК ПутьКФайлуСтикера,
		|	ЭлектроннаяНакладная.ПутьКФайлуТТН КАК ПутьКФайлуТТН,
		|	ЭлектроннаяНакладная.ПутьКФайлуТТННакладная КАК ПутьКФайлуТТННакладная,
		|	ЗапросДоступностиТоваров.Ссылка КАК ДокументДляТТН
		|ИЗ
		|	Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Магазины.КонтактнаяИнформация КАК МагазиныКонтактнаяИнформация
		|		ПО ЭлектроннаяНакладная.МагазинПолучатель = МагазиныКонтактнаяИнформация.Ссылка
		|		И МагазиныКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|		И МагазиныКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailМагазина)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|		ПО ЭлектроннаяНакладная.ДокументОснование = ЗапросДоступностиТоваров.Ссылка
		|ГДЕ
		|	ЭлектроннаяНакладная.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ОтправитьПисьмо(ДокументОтправки, АдресаДляОтправки)
		
	ПараметрыОповещения = ОповещенияПользователей.ПолучитьПараметрыЭлектроннаяПочта(Перечисления.ТипыСобытийОповещений.ОправкаДанныхДляПоставщиков);

	ТемаСообщения = СтрШаблон("%1 %2", АдресаДляОтправки.НомерЗапроса, АдресаДляОтправки.ПоставщикСлужбойДоставки);
	Если АдресаДляОтправки.ОтправкаНаМагазин Тогда

		ТемаСообщения = ТемаСообщения + " для " + АдресаДляОтправки.МагазинПолучатель;
		СтруктураПолучателяМагазин = Новый Структура;
		СтруктураПолучателяМагазин.Вставить("Адрес"        , АдресаДляОтправки.АдресЭП); 
		СтруктураПолучателяМагазин.Вставить("Представление", АдресаДляОтправки.МагазинПолучатель);
		
		ПараметрыОповещения[0].Копии.Добавить(СтруктураПолучателяМагазин);

	КонецЕсли;
	
	ТелоСообщения = ПараметрыОповещения[0].Тело;

	СтруктураПолучателя = Новый Структура;
	СтруктураПолучателя.Вставить("Адрес"        , АдресаДляОтправки.КонтактноеЛицоОтправительEmail); 
	СтруктураПолучателя.Вставить("Представление", АдресаДляОтправки.ПоставщикСлужбойДоставки);
	
	Вложения = Новый Соответствие();
	
	ДобавитьВоВложение(Вложения, АдресаДляОтправки.ПутьКФайлуТТН);
	ДобавитьВоВложение(Вложения, АдресаДляОтправки.ПутьКФайлуСтикера);

	МассивОбъектов = Новый Массив();
	МассивОбъектов.Добавить(АдресаДляОтправки.ДокументДляТТН);
	ОбъектыПечати = Новый СписокЗначений();
	ПараметрыВывода = Новый Структура("КодЯзыкаДляМногоязычныхПечатныхФорм", "uk");
	ДокументТоварнаяНакладная = Документы.ЗапросДоступностиТоваров.ПечатьТоварнаяНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыВывода);

	Поток = Новый ПотокВПамяти;
	ДокументТоварнаяНакладная.Записать(Поток, ТипФайлаТабличногоДокумента.PDF);
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	Вложения.Вставить("ТоварнаяНакладная.pdf", АдресФайла);

	ДвоичныеДанные = ПолучитьОбщийМакет("ХрупкоКартинкаДляНаклейки");
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	Вложения.Вставить("sticker.jpg", АдресФайла);

	ОповещенияПользователей.ВыполнитьОповещениеПоЭлектроннойПочтеПроизвольное(СтруктураПолучателя
		, ТемаСообщения
		, ТелоСообщения
		, ПараметрыОповещения[0].Копии
		,
		, Вложения) 

КонецПроцедуры 

&НаСервере
Процедура ДобавитьВоВложение(Вложения, ИмяФайлаДляВложения)

	АдресФайла = ДополнительныеОтчетыИОбработкиВБезопасномРежиме.ПолучитьФайлИзИнтернета(Новый УникальныйИдентификатор()
		, ИмяФайлаДляВложения);
		
	ИмяФайла = СтрРазделить(ИмяФайлаДляВложения, "/");
	Вложения.Вставить(ИмяФайла[ИмяФайла.Количество() - 1], АдресФайла);

КонецПроцедуры

#КонецОбласти
