#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьОбъект(ОбъектДляРегистрации) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбменСЕСпутником.Ссылка
		|ИЗ
		|	ПланОбмена.ОбменСЕСпутником КАК ОбменСЕСпутником
		|ГДЕ
		|	НЕ ОбменСЕСпутником.ЭтотУзел";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, ОбъектДляРегистрации);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#КонецЕсли