#Область ОбработчикиСобытийФормы

&НаСервере	//	LNK 23.03.2024 10:49:09
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Перем КлючПоиска;

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.

		Возврат;

	КонецЕсли;

	Параметры.Свойство("Заголовок", Заголовок);

	ПрочитатьДеревоМетаданных();

	Параметры.Свойство("ПолноеИмя", КлючПоиска);

	Если ТипЗнч(КлючПоиска) = Тип("Строка") И НЕ ПустаяСтрока(КлючПоиска) Тогда

		ИдентификаторСтроки	= 0;
		КоллекцияЭлементов	= ДеревоМетаданных.ПолучитьЭлементы();

		ОбщегоНазначенияКлиентСервер.ПолучитьИдентификаторСтрокиДереваПоЗначениюПоля("МетаПолноеИмя", ИдентификаторСтроки, КоллекцияЭлементов, КлючПоиска, Ложь);

		Элементы.ДеревоМетаданных.ТекущаяСтрока = ИдентификаторСтроки;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервере	//	LNK 23.03.2024 10:53:06
Процедура ПрочитатьДеревоМетаданных()

	ОбработкаОбъект = Обработки.РегистрацияИзмененийДляОбменаДанными.Создать();
	СтруктураДанных = ОбработкаОбъект.СформироватьСтруктуруМетаданных(, 2);

	ЗначениеВРеквизитФормы(СтруктураДанных.Дерево, "ДеревоМетаданных");

КонецПроцедуры

&НаКлиенте	//	LNK 23.03.2024 11:41:19
Процедура ДеревоМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Закрыть(Новый Структура(
		"Представление, ПолноеИмя"
		, Элемент.ТекущиеДанные.Наименование
		, Элемент.ТекущиеДанные.МетаПолноеИмя
		)
	);

КонецПроцедуры














