#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьТаблицуВидовДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Для каждого ЭлементНастройки Из НастройкаВидовДокументов Цикл

		Если НЕ ЭлементНастройки.Пометка Тогда

			СтрокиТаблицы = Отчет.ВидыДокументов.НайтиСтроки(
				Новый Структура("ПолноеИмя", ЭлементНастройки.Значение));

			Для каждого СтрокаТаблицы Из СтрокиТаблицы Цикл

				СтрокаТаблицы.Пометка = Ложь;

			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	НастройкаВидовДокументов.Очистить();

	Для каждого СтрокаТаблицы Из Отчет.ВидыДокументов Цикл

		НастройкаВидовДокументов.Добавить(СтрокаТаблицы.ПолноеИмя,, СтрокаТаблицы.Пометка);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)


КонецПроцедуры
	
#КонецОбласти

&НаСервере
Процедура СформироватьОтчетНаСервере()

	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)

	СформироватьОтчетНаСервере();

	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОтчет;

	ПоказатьОповещениеПользователя("Выполнено",, "Отчет по документам сформирован", БиблиотекаКартинок.Информация32);

КонецПроцедуры

&НаСервере
Процедура УстановитьТаблицуВидовДокументов()

	СписокМетаданных = Новый Массив;
	СписокМетаданных.Добавить(Метаданные.Документы.ПеремещениеТоваров);
	СписокМетаданных.Добавить(Метаданные.Документы.ОприходованиеТоваров);
	СписокМетаданных.Добавить(Метаданные.Документы.СписаниеТоваров);
	СписокМетаданных.Добавить(Метаданные.Документы.ПересортицаТоваров);
	СписокМетаданных.Добавить(Метаданные.Документы.ПересчетТоваровСамостоятельный);

	Для каждого ЭлементСписка Из СписокМетаданных Цикл

		СтрокаТаблицы = Отчет.ВидыДокументов.Добавить();
		СтрокаТаблицы.Пометка = Истина;
		СтрокаТаблицы.Имя = ЭлементСписка.Имя;
		СтрокаТаблицы.Представление = ЭлементСписка.Синоним;
		СтрокаТаблицы.ПолноеИмя = ЭлементСписка.ПолноеИмя();

	КонецЦикла;

	Отчет.ВидыДокументов.Сортировать("Представление");

КонецПроцедуры
