
///////////////////////////////////////////////////////////////////////////////
// Печать

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная",
				"Накладная",
				ПечатьНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,,Истина)
		
	КонецЕсли;
	
КонецПроцедуры




Функция ПечатьНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	А = 0;	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	//КодЯзыкаПечать = "uk";
	КолонкаКодов       = ФормированиеПечатныхФормСервер.ИмяДополнительнойКолонки();
	ВыводитьУпаковки   = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	ТабличныйДокумент  = Новый ТабличныйДокумент;
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	СинонимДокумента   = НСтр("ru='Счет на оплату';uk='Рахунок на оплату'", КодЯзыкаПечать);
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НН";
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СрокиРеализацииТовары.Номенклатура КАК Номенклатура,
		|	СрокиРеализацииТовары.Номенклатура.IDN КАК IDN,
		|	СрокиРеализацииТовары.Номенклатура.Производитель КАК Производитель,
		|	СрокиРеализацииТовары.СрокГодности КАК СрокГодности,
		|	СУММА(СрокиРеализацииТовары.КоличествоОтстаток) КАК КоличествоОтстаток,
		|	СУММА(СрокиРеализацииТовары.КоличествоПродажи) КАК КоличествоПродажи,
		|	СрокиРеализацииТовары.Цена КАК Цена,
		|	СрокиРеализацииТовары.ДатаПрихода КАК ДатаПрихода
		|ИЗ
		|	Документ.СрокиРеализации.Товары КАК СрокиРеализацииТовары
		|ГДЕ
		|	СрокиРеализацииТовары.Ссылка = &МассивОбъектов
		|
		|СГРУППИРОВАТЬ ПО
		|	СрокиРеализацииТовары.Номенклатура,
		|	СрокиРеализацииТовары.СрокГодности,
		|	СрокиРеализацииТовары.Цена,
		|	СрокиРеализацииТовары.Номенклатура.Производитель,
		|	СрокиРеализацииТовары.Номенклатура.IDN,
		|	СрокиРеализацииТовары.ДатаПрихода";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Таб = РезультатЗапроса.ВЫгрузить();
	
	
Макет = УправлениеПечатью.ПолучитьМакет("Документ.СрокиРеализации.Накладная", КодЯзыкаПечать);
Область = Макет.ПолучитьОбласть("ОбластьЗаголовок");

ТабРеквезиты = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(МассивОбъектов,"ДатаФормирования,Ответственный,Магазин");

Область.Параметры.ДатаФормирования = ТабРеквезиты.ДатаФормирования;
Область.Параметры.Ответственный = ТабРеквезиты.Ответственный;
Область.Параметры.Магазин = ТабРеквезиты.Магазин;
ТабличныйДокумент.Вывести(Область);

Область = Макет.ПолучитьОбласть("ОбластьСтрока");

Для Каждого СтрСостава Из Таб Цикл 
	А = А + 1;
    Область.Параметры.Заполнить(СтрСостава);
	Область.Параметры.НомерПП = А;	
    ТабличныйДокумент.Вывести(Область); 
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;	
КонецЦикла;

//Область = Макет.ПолучитьОбласть("ОбластьИтог");
//Область.Параметры.КоличествоИтого = Таб.Итог("Количество");
//Область.Параметры.СуммаИтого = Таб.Итог("Сумма");
//Область.Параметры.СуммаНДСИтого = Таб.Итог("СуммаНДС");

//ТабличныйДокумент.Вывести(Область);
	
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, МассивОбъектов);
		
	
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
