
//	LNK 05.09.2018 07:05:37
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		ЗаписьНабора.ДатаИзменения = ТекущаяДата();

	КонецЦикла;

КонецПроцедуры

//	LNK 11.05.2018 13:13:21
Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() И КонтекстПриложения.ЭтоКлиентскоеСоединение() Тогда

	//	Не нагружаем сеанс РМК и исключаем ошибки в вызываемых методах - если и возникнет ошибка, то возникнет она в другом процессе. 
		ФоновыеЗадания.Выполнить("ТехническаяПоддержка.НазначитьОбъектуДействие", ОбщегоНазначенияКлиентСервер.AAD(Отбор.СерийныйНомер.Значение, Неопределено, "ПЕРЕДАТЬ_В_ЦЕНТР", Истина, ПараметрыСеанса.ТекущийПользователь));

	КонецЕсли;

КонецПроцедуры
