
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтображениеЭлементов()
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтправкаИзОтделенияПриИзменении(Элемент)
	
	ОтображениеЭлементов();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтображениеЭлементов()
	
	Элементы.ОтправкаНаАдрес.Видимость = Не Объект.ОтправкаИзОтделения;
	Элементы.ОтправкаНаОтделение.Видимость = Объект.ОтправкаИзОтделения;
	
КонецПроцедуры

// Код процедур и функций

#КонецОбласти
