///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСимволовПослеЗапятой = 0;
	ПервыйВвод = Истина;
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("ВведенныйПериод") Тогда
		ВводимыйПериод    = Параметры.ВведенныйПериод;
	КонецЕсли;
	
КонецПроцедуры

  


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаOK(Команда)
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ВведенныйПериод", ВводимыйПериод);
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборКонечнойДаты(Команда)
	
	ПолучитьИнтерактивноДату(НСтр("ru = 'Введите дату.'"), ВводимыйПериод.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборНачальнойДаты(Команда)
	
	ПолучитьИнтерактивноДату(НСтр("ru = 'Введите дату.'"), ВводимыйПериод.ДатаНачала);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПолучитьИнтерактивноДату(Заголовок, ВводимаяДата)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Заголовок"             , Заголовок);
	ПараметрыОткрытия.Вставить("ВводимаяДата"          , ВводимаяДата);
	
	Результат = ОткрытьФормуМодально("Обработка.РМК.Форма.ФормаВводаДаты", ПараметрыОткрытия, УникальныйИдентификатор);
	
	Если НЕ Результат = Неопределено Тогда
		ЗначениеВыбора = Результат.ВводимаяДата;
		Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
			ВводимаяДата = ЗначениеВыбора;
		Иначе
			ВводимаяДата = Дата("00010101");
		КонецЕсли;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
КонецФункции // ПолучитьИнтерактивноЧисло()

