
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.КассаУправляющейСистемы Тогда
		
		// Редактирование Магазина для кассы управляющей системы не предусмотрено
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРедактированиеОрганизации;
		Элементы.РазрешитьРедактированиеМагазина.ТолькоПросмотр = Истина;
		Элементы.РазрешитьРедактированиеОрганизации.ТолькоПросмотр = Ложь;
	Иначе
		
		// Редактирование Организации для кассы не управляющей системы не предусмотрено
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРедактированиеМагазина;
		Элементы.РазрешитьРедактированиеМагазина.ТолькоПросмотр = Ложь;
		Элементы.РазрешитьРедактированиеОрганизации.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	РазрешитьРедактированиеМагазина    = Истина;
	РазрешитьРедактированиеОрганизации = Истина;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	Если РазрешитьРедактированиеМагазина Тогда
		Результат.Добавить("Магазин");
	КонецЕсли;
	Если РазрешитьРедактированиеОрганизации Тогда
		Результат.Добавить("Владелец");
	КонецЕсли;
	
	Закрыть(Результат);

КонецПроцедуры