#Область ОбработчикиОсновныхСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)


КонецПроцедуры

&НаКлиенте	//	LNK 18.06.2021 07:26:48
Процедура ПриОткрытии(Отказ)

	РазрешеноРедактирование = Объект.Ссылка.Пустая() ИЛИ ТехническаяПоддержкаВызовСервера.ВыполняютсяСлужебныеДействия();

	Если НЕ РазрешеноРедактирование Тогда

		ТолькоПросмотр = Истина;

	Иначе

		Элементы.НомерОтправленного.ТолькоПросмотр = Ложь;
		Элементы.НомерПринятого.ТолькоПросмотр     = Ложь;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти







