
&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	
	Если РазрешитьРедактированиеЕдиницаИзмерения Тогда
		Результат.Добавить("ЕдиницаИзмерения");
	КонецЕсли;
	
	Если РазрешитьРедактированиеКоэффициент Тогда
		Результат.Добавить("Коэффициент");
	КонецЕсли;

	Закрыть(Результат);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешитьРедактированиеЕдиницаИзмерения = Истина;
	РазрешитьРедактированиеКоэффициент		= Истина;
	
КонецПроцедуры
