Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

//	Правила регистрации обеспечивают миграцию "сверху вниз".. но из ПБ в ЦБ данные этого регистра НЕ ЕДУТ.
//	А в ЦБ ограничим доступ по режиму "Отладка".

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда	//	LNK 17.02.2021 05:48:58

		Если НЕ ТехническаяПоддержкаВызовСервера.ОтладочныйРежимРаботы() Тогда

			Отказ = Истина;
			Сообщить("Запрещено изменять границы запрета.");

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
