
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;
	
	Номенклатура = Параметры.Номенклатура; 
	
	НоваяСтрока = СтрокаЗапроса.Добавить();
	НоваяСтрока.Количество = Параметры.Количество;
	НоваяСтрока.КоличествоИзменено = Параметры.Количество;
	НоваяСтрока.КоличествоТребование = Параметры.КоличествоТребование;
    НоваяСтрока.КлючСвязи = Параметры.КлючСвязи;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	СтрокаТЧ = СтрокаЗапроса[0]; 
	
	Если СтрокаТЧ.Количество = СтрокаТЧ.КоличествоИзменено Тогда 
		
		Закрыть();
		
	ИначеЕсли ПустаяСтрока(Причина) Тогда 
		
		ТекстОшибки = НСтр("ru='Не указана причина изменения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"Причина"
			);
		
	Иначе 
		
		Результат = Новый Структура;
		Результат.Вставить("Причина", Причина);
		Результат.Вставить("Количество", СтрокаТЧ.КоличествоИзменено);
		Результат.Вставить("КлючСвязи", СтрокаТЧ.КлючСвязи);
		Закрыть(Результат);	
		
	КонецЕсли;
                       
КонецПроцедуры
