#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Заголовок", Заголовок);

	Если Параметры.Свойство("Выполнить") Тогда

		Элементы.КомандаВыполнитьПриВыборе.Заголовок = Параметры.Выполнить;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если НЕ УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.ПраваПользователей.РазрешитьПередачуБонусныхБалловНаБлаготворительныйФонд"), Ложь) Тогда

		Отказ = Истина;

		ПоказатьОповещениеПользователя("Заборонено!"
			,
			, "Користувачеві не надано дозвіл на цю операцію"
			, БиблиотекаКартинок.Ошибка32
		);

	Иначе

		УстановитьОформлениеЭлементов();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура НомерТелефонаОткрытие(Элемент, СтандартнаяОбработка)

	НайтиКонтрагентаПоНомеруТелефона(НомерТелефона, Контрагент);
	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)

	НайтиКонтрагентаПоНомеруТелефона(НомерТелефона, Контрагент);
	УстановитьОформлениеЭлементов();

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикСобытийКомандФормы

&НаКлиенте	//	LNK 27.09.2023 08:53:53
Процедура КомандаВыполнитьПриВыборе(Команда)

	РозничныеПродажиКлиент.ПередатьБонусныеБаллыНаБлаготворительныйФонд(
		  НомерТелефона
		, Контрагент
		, ""
		, УникальныйИдентификатор
		, ЭтотОбъект
	);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте	//	LNK 27.09.2023 08:50:20
Процедура УстановитьОформлениеЭлементов()	Экспорт

	Если Контрагент.Пустая() Тогда

		ТекущийЭлемент = Элементы.НомерТелефона;

	Иначе

		ТекущийЭлемент = Элементы.КомандаВыполнитьПриВыборе;

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура НайтиКонтрагентаПоНомеруТелефона(Знач НомерТелефона, Контрагент)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаПокупатели.Ссылка КАК Контрагент,
	|	ТаблицаТелефоны.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Контрагенты КАК ТаблицаПокупатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ТаблицаТелефоны
	|		ПО ТаблицаПокупатели.Ссылка = ТаблицаТелефоны.Ссылка
	|			И (ТаблицаТелефоны.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|ГДЕ
	|	ТаблицаТелефоны.НомерТелефона = &НомерТелефона"
	);
	Запрос.УстановитьПараметр("НомерТелефона", ОтправкаSMS.ПодготовитьНомерТелефона(НомерТелефона));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		Контрагент = Выборка.Контрагент;

	Иначе

		Контрагент = Неопределено;

	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти


















