
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыКонтактноеЛицо = Новый Структура;
	ПараметрыКонтактноеЛицо.Вставить("КонтактИнд", ТекущийОбъект.Идентификатор);
	ПараметрыКонтактноеЛицо.Вставить("Контрагент", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Контрагент, "Идентификатор"));
	ПараметрыКонтактноеЛицо.Вставить("Фамилия", ТекущийОбъект.Фамилия);
	ПараметрыКонтактноеЛицо.Вставить("Имя", ТекущийОбъект.Имя);
	ПараметрыКонтактноеЛицо.Вставить("Отчество", ТекущийОбъект.Отчество);
	ПараметрыКонтактноеЛицо.Вставить("Телефон", ТекущийОбъект.Телефон);
	ПараметрыКонтактноеЛицо.Вставить("Email", ТекущийОбъект.Email);
	
	СтруктураОтвета = ОбменНПСервер.КонтактноеЛицоКонтрагентаЗаписать(ПараметрыКонтактноеЛицо);
	
	Если СтруктураОтвета.Ошибка Тогда
	
		Отказ = Истина;
		Сообщить(СтруктураОтвета.ТектОшибки);
		
	Иначе
		
		ТекущийОбъект.Идентификатор = СтруктураОтвета.КонтактИнд;
		ТекущийОбъект.КонтактноеЛицо = СтруктураОтвета.КонтактноеЛицо;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
