
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииСервер()
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюСервер()
КонецПроцедуры

&НаСервере
Процедура НаименованиеПриИзмененииСервер()
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.НаименованиеДляНалоговыхДокументов) Тогда
		Объект.НаименованиеДляНалоговыхДокументов = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюСервер()
	
	// преобразуем так как это необходимо для формирования номера налоговых накладных: 1 -> 0001 (только числа)
	Попытка
		
		ПрефиксЧисловой = Число(Объект.Префикс);
		Если ПрефиксЧисловой < 0  Тогда
			ПрефиксЧисловой = - ПрефиксЧисловой;
		КонецЕсли;
		
		Объект.Префикс = Формат(ПрефиксЧисловой,"ЧЦ=4; ЧВН=; ЧГ=" );
		
	Исключение
		
		Объект.Префикс = "";
		
	КонецПопытки;
	
КонецПроцедуры
