////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Функция возвращает пустую структуру,
// которая в последующем заполняется значениями и используется 
// при проверке ассортимента в табличной части
// Возвращаемое значение: 
// 		СтруктураПроверкиАссортимента - Структура
Функция ПараметрыПроверкиАссортимента() Экспорт 
	
	СтруктураПроверкиАссортимента = Новый Структура;
	
	СтруктураПроверкиАссортимента.Вставить("Магазин", 				  Неопределено);
	СтруктураПроверкиАссортимента.Вставить("Дата", 					  Неопределено);
	СтруктураПроверкиАссортимента.Вставить("ТекстСообщения", 		  Неопределено);
	СтруктураПроверкиАссортимента.Вставить("ИмяРесурсаАссортимента",  Неопределено);
	СтруктураПроверкиАссортимента.Вставить("Ссылка", 				  Неопределено);
	СтруктураПроверкиАссортимента.Вставить("РазрешатьДобавление", 	  Неопределено);
	СтруктураПроверкиАссортимента.Вставить("ПровереноМожноДобавлять", Неопределено);
	СтруктураПроверкиАссортимента.Вставить("ПроверитьТоварВЗаказе",   Неопределено);
	СтруктураПроверкиАссортимента.Вставить("ИмяТабличнойЧасти",   	  "Товары");
	
	Возврат СтруктураПроверкиАссортимента;
	
КонецФункции // ПараметрыПроверкиАссортимента()

// Функция возвращает пустую структуру,
// которая в последующем заполняется значениями и используется 
// при формировании условия в ряде отчетов по ассортименту, не использующих СКД
// Возвращаемое значение: 
// 		СтруктураПараметровУсловия - Структура
Функция ПараметрыДляУсловия() Экспорт 
	
	СтруктураПараметровУсловия = Новый Структура;
	
	СтруктураПараметровУсловия.Вставить("СчетчикУсловий", 0);
	СтруктураПараметровУсловия.Вставить("СчетчикПараметров", 0);
	СтруктураПараметровУсловия.Вставить("ТекстУсловия", "");
	СтруктураПараметровУсловия.Вставить("ТекстНачальногоУсловия", "");
	СтруктураПараметровУсловия.Вставить("УсловиеГруппы", "");
	СтруктураПараметровУсловия.Вставить("СоответствиеПолейУсловия", Новый Соответствие);
	
	Возврат СтруктураПараметровУсловия;
	
КонецФункции // ПараметрыДляУсловия()

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
