///////////////////////////////////////////////////////////////////////////////
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка ИЛИ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "СлужебныйРежимЗаписи", Ложь) = Истина Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		ОрганизацияМагазина = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "Организация");

		Если ЗначениеЗаполнено(ОрганизацияМагазина) И НЕ Организация = ОрганизацияМагазина Тогда

			Организация = ОрганизацияМагазина;
			Сообщить("Установлена организация по магазину - «" + Организация + "»");

		КонецЕсли;

		Если ТипСклада = Перечисления.ТипыСкладов.ТорговыйЗал Тогда

			Если НазначениеСклада.Пустая() Тогда

				НазначениеСклада = Перечисления.НазначенияСкладов.ТорговыйЗал;

			КонецЕсли;

		КонецЕсли;

	//	LNK 12.01.2021 16:22:02
		Если ПустаяСтрока(IDN) И РольДоступна(Метаданные.Роли.АдминистраторСистемы) И ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Магазины.СкладПродажи.IDN КАК IDN
			|ИЗ
			|	Справочник.Магазины КАК Магазины
			|ГДЕ
			|	Магазины.Ссылка = &Магазин"
			);
			Запрос.УстановитьПараметр("Магазин", Магазин);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.IDN) Тогда

				IDN = Выборка.IDN;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

//	LNK 20.04.2017 10:38:20
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка ИЛИ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "СлужебныйРежимЗаписи", Ложь) = Истина Тогда

		Возврат;

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ТипСклада = Перечисления.ТипыСкладов.ТорговыйЗал Тогда

		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("Организация");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

	ИначеЕсли НЕ НазначениеСклада = Перечисления.НазначенияСкладов.ТорговыйЗал Тогда

		Отказ = Истина;
		Сообщить("Неверно указано назначение склада!");

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	IDN   = "";
	Отдел = "";

КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
