//	LNK 02.03.2018 13:20:31
Функция СоответствиеТиповСоставаПланаОбмена()	Экспорт

	СоответствиеТипов = Новый Структура(
		"МД, Порядок"
		, Новый Соответствие, Новый Соответствие);

	НомерТипа = 0;

	Для каждого ОбъектСостава Из Метаданные.ПланыОбмена.ПоУстройствамАнтошка.Состав Цикл

		НомерТипа = НомерТипа + 1;

		ОписаниеТипа = Новый Структура(
			"Класс, Имя, НомерТипа"
			, ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектСостава.Метаданные)
			, ОбъектСостава.Метаданные.Имя
			, НомерТипа);

		СоответствиеТипов.МД.Вставить(ОбъектСостава.Метаданные, ОписаниеТипа);
		СоответствиеТипов.Порядок.Вставить(НомерТипа, ОписаниеТипа);

	КонецЦикла;

	Возврат СоответствиеТипов;

КонецФункции // СоответствиеТиповСоставаПланаОбмена()

//	LNK 07.05.2018 10:54:30
Функция ПолучитьУзелПоУстройствам(Идентификатор)	Экспорт

	УзелПолучатель = ПланыОбмена.ПоУстройствамАнтошка.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаУзлов.Ссылка КАК Узел
	|ИЗ
	|	ПланОбмена.ПоУстройствамАнтошка КАК ТаблицаУзлов
	|ГДЕ
	|	ТаблицаУзлов.Ссылка = &УзелПолучатель"
	);
	Запрос.УстановитьПараметр("УзелПолучатель", УзелПолучатель);
	
	Если Запрос.Выполнить().Пустой() Тогда

		УзелПолучатель = Неопределено;

	КонецЕсли;

	Возврат УзелПолучатель;

КонецФункции // ПолучитьУзелПоУстройствам()

//	LNK 14.05.2018 08:44:53
Функция ВыполнятьРегистрацию()	Экспорт

	Возврат Ложь;

КонецФункции // ВыполнятьРегистрацию()
