#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Запись ключевых атребутов запроса доступности.
// 
// Параметры:
//  СтруктураЗаписи - Структура - Структура для изменения регистра:
//		* ЗапросДоступности - ДокументСсылка.ЗапросДоступностиТоваров
//		* СтатусЗапроса - ПеречислениеСсылка.СтатусыЗапросовДоступностиТоваровШапка
//		* ОтправкаПочты - Булево 
//		* ОправленоВNavision - ПеречислениеСсылка.СтатусыЗапросаДоступностиВNavision
Процедура ЗаписьКлючевыхАтребутовЗапросаДоступности(СтруктураЗаписи) Экспорт

	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса());
	НаборЗаписей.Отбор.ЗапросДоступности.Установить(СтруктураЗаписи.ЗапросДоступности);

	ЗаписьНабора = НаборЗаписей.Добавить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ТаблицаРегистра.Период КАК Период,
		|	ТаблицаРегистра.ЗапросДоступности КАК ЗапросДоступности,
		|	ТаблицаРегистра.СтатусЗапроса КАК СтатусЗапроса,
		|	ТаблицаРегистра.ОтправкаПочты КАК ОтправкаПочты,
		|	ТаблицаРегистра.ДатаИзменения КАК ДатаИзменения,
		|	ТаблицаРегистра.Примечание КАК Примечание,
		|	ТаблицаРегистра.ОправленоВNavision КАК ОправленоВNavision
		|ИЗ
		|	РегистрСведений.КлючевыеАтрибутыЗапросовДоступности.СрезПоследних(, ЗапросДоступности = &ЗапросДоступности) КАК
		|		ТаблицаРегистра";
	
	Запрос.УстановитьПараметр("ЗапросДоступности", СтруктураЗаписи.ЗапросДоступности);
	
	ТЗАтрибутов = Запрос.Выполнить().Выгрузить();
	
	Если ТЗАтрибутов.Количество() = 0 Тогда
		СтрокаАтрибутов = ТЗАтрибутов.Добавить();
		СтрокаАтрибутов.ЗапросДоступности = СтруктураЗаписи.ЗапросДоступности;
	Иначе
		СтрокаАтрибутов = ТЗАтрибутов[0];
	КонецЕсли;
	
	ЗаписатьРегистр = Ложь;

	Для Каждого КлючЗначение Из СтруктураЗаписи Цикл

		Если КлючЗначение.Значение = СтрокаАтрибутов[КлючЗначение.Ключ]
				Или КлючЗначение.Значение = Неопределено Тогда

			Продолжить;
			
		Иначе
			
			СтрокаАтрибутов[КлючЗначение.Ключ] = КлючЗначение.Значение;
			ЗаписатьРегистр = Истина;

		КонецЕсли;
	
	КонецЦикла;
	
	Если ЗаписатьРегистр Тогда
		
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтрокаАтрибутов);
		ЗаписьНабора.Период			 = НаборЗаписей.Отбор.Период.Значение;
		ЗаписьНабора.ЗапросДоступности = НаборЗаписей.Отбор.ЗапросДоступности.Значение;
		ЗаписьНабора.ДатаИзменения = ТекущаяДатаСеанса();

		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

// Инициализация структуры записи регистра.
// 
// Параметры:
//  ЗД - ДокументСсылка.ЗапросДоступностиТоваров
// 
// Возвращаемое значение:
// 	Структура - структура регистр для записи:
//		* ЗапросДоступности - ДокументСсылка.ЗапросДоступностиТоваров
//		* СтатусЗапроса - ПеречислениеСсылка.СтатусыЗапросовДоступностиТоваровШапка
//		* ОтправкаПочты - Булево 
//		* ОправленоВNavision - ПеречислениеСсылка.СтатусыЗапросаДоступностиВNavision
//  
Функция ИнициализацияСтруктурыЗаписиРегистра(ЗД) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапросДоступности",		ЗД);
	Результат.Вставить("СтатусЗапроса",			Неопределено);
	Результат.Вставить("ОтправкаПочты",			Неопределено);
	Результат.Вставить("ОправленоВNavision",	Неопределено);

	Возврат Результат;
	
КонецФункции

// Получение статуса записи в Navision.
// 
// Параметры:
//  ЗД - ДокументСсылка.ЗапросДоступностиТоваров
// 
// Возвращаемое значение:
// 	ПеречислениеСсылка.СтатусыЗапросаДоступностиВNavision
//  
Функция ПолучитьСтатусЗаписиВNavision(ЗД) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КлючевыеАтрибутыЗапросовДоступностиСрезПоследних.ОправленоВNavision
		|ИЗ
		|	РегистрСведений.КлючевыеАтрибутыЗапросовДоступности.СрезПоследних(, ЗапросДоступности = &ЗД) КАК
		|		КлючевыеАтрибутыЗапросовДоступностиСрезПоследних";
	
	Запрос.УстановитьПараметр("ЗД", ЗД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.ОправленоВNavision;
		
	Иначе
		
		Результат = Перечисления.СтатусыЗапросаДоступностиВNavision.ПустаяСсылка();
		
	КонецЕсли; 

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
	
#КонецЕсли
