Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		Если ПустаяСтрока(НаименованиеЛатиница) Тогда

			НаименованиеЛатиница = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Наименование);

		КонецЕсли;

		Если ПустаяСтрока(НаименованиеУкраинскоеЛатиница) Тогда

			НаименованиеУкраинскоеЛатиница = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(НаименованиеУкраинское);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры
