
#Область ДоступКОбъектам

// Возвращает на клиент значение параметра сеанса по имени.
//
Функция ЗначениеПараметраСеанса(ИмяПараметра) Экспорт
	
	Возврат ПараметрыСеанса[ИмяПараметра]
	
КонецФункции

// Устанавливает параметр сеанса по имени и значению, переданных с клиента.
//
Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметра, ЗначениеПараметра) Экспорт
	
	ПараметрыСеанса[ИмяПараметра] = ЗначениеПараметра;
	
КонецПроцедуры

#КонецОбласти

//	LNK 23.09.2022 12:14:14
Функция ПолучитьПравилаПротокола(Период = '00010101')	Экспорт

	Возврат ОбщегоНазначенияРТповтИсп.ПолучитьПравилаПротокола(Период);

КонецФункции

//	Переопределение вызова

//	LNK 17.11.2023 12:31:41
Функция РеквизитыМагазина(Магазин, ДатаСреза = '00010101')	Экспорт

	Возврат ОбщегоНазначенияРТповтИсп.РеквизитыМагазина(Магазин, ДатаСреза);

КонецФункции

//	LNK 17.11.2023 12:31:41
Функция РеквизитыСклада(Склад, ДатаСреза = '00010101')	Экспорт

	Возврат ОбщегоНазначенияРТповтИсп.РеквизитыСклада(Склад, ДатаСреза);

КонецФункции
