
Функция ПроверитьОбновитьТипСобытияДокумента(Документ, ТипСобытия, СтатусДокумента) Экспорт 
	
	НаборЗаписей = РегистрыСведений.ОтправленныеСобытия_еСпутник.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Документ.Установить(Документ, Истина);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Активность 	= Истина; 
		Запись.Период		= ТекущаяДата();
		Запись.Документ		= Документ;
		Запись.ТипСобытия	= ТипСобытия;
		Запись.СтатусДокумента	= СтатусДокумента;
		
		НаборЗаписей.Записать(); 
		
		Возврат Истина;
		
	Иначе
		
		Запись = НаборЗаписей.Получить(0);
		
		Если СокрЛП(Запись.ТипСобытия) = СокрЛП(ТипСобытия) Тогда 
			Возврат Ложь
		КонецЕсли;	
		
		Запись.Активность 	= Истина; 
		Запись.Период		= ТекущаяДата();
		Запись.Документ		= Документ;
		Запись.ТипСобытия	= ТипСобытия;
		Запись.СтатусДокумента	= СтатусДокумента;
		
		НаборЗаписей.Записать(); 
		
		Возврат Истина;
		
	КонецЕсли;	
	
КонецФункции	