
&НаКлиенте
Процедура КомандаОтправитьКодПодтверждения(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВвестиКодПодтверждения(Команда)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Дата = ТекущаяДата();
		ЗаполнитьЗначенияСвойств(Объект,Параметры);
		Строка_ = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(Строка_,Параметры);
		Строка_.ДатаК = Параметры.ДатаК;
	КонецЕсли;
КонецПроцедуры
