//	LNK 28.05.2019 10:44:17
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

//	---------------------------------------------------------------------------------------

	Индекс = 0;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		ЗаписьНабора.Период = Отбор.Период.Значение;

		Если НЕ Отбор.Индекс.Использование Тогда

				ЗаписьНабора.Индекс	= Индекс;

		Иначе	ЗаписьНабора.Индекс	= Отбор.Индекс.Значение;

		КонецЕсли;

		Если ЗаписьНабора.Магазин.Пустая() Тогда

			ЗаписьНабора.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;

		КонецЕсли;

		Если ЗаписьНабора.Продавец.Пустая() Тогда

			ЗаписьНабора.Продавец = Пользователи.АвторизованныйПользователь();

		КонецЕсли;

		Если ПустаяСтрока(ЗаписьНабора.Компьютер) Тогда

			ЗаписьНабора.Компьютер = ИмяКомпьютера();

		КонецЕсли;

		Если ЗаписьНабора.ЭлементСтруктуры.Пустая() Тогда

			Если ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Свойство("ЭлементСтруктуры") Тогда

				ЗаписьНабора.ЭлементСтруктуры = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ЭлементСтруктуры;

			КонецЕсли;

		КонецЕсли;

		Индекс = Индекс + 1;

	КонецЦикла;

КонецПроцедуры
