//	LNK 29.04.2024 06:31:21
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ Количество() = 0 Тогда

		ПроверитьЗащищённыеРеквизиты(Отказ);

	КонецЕсли;

КонецПроцедуры

//	LNK 29.04.2024 06:36:02
Процедура ПроверитьЗащищённыеРеквизиты(Отказ)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.Блокирован КАК Блокирован,
	|	ТаблицаРегистра.КлиентMagentoII КАК КлиентMagentoII,
	|	ТаблицаРегистра.Код КАК Код,
	|	ТаблицаРегистра.КодПоставщика КАК КодПоставщика,
	|	ТаблицаРегистра.КодПроекта КАК КодПроекта,
	|	ТаблицаРегистра.Наименование КАК Наименование,
	|	ТаблицаРегистра.НаименованиеУкраинское КАК НаименованиеУкраинское,
	|	ТаблицаРегистра.ПоказательМаржинальности КАК ПоказательМаржинальности,
	|	ТаблицаРегистра.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ТаблицаРегистра.Примечание КАК Примечание
	|ИЗ
	|	РегистрСведений.РеквизитыКонтрагентов.СрезПоследних(&Период, Контрагент = &Контрагент) КАК ТаблицаРегистра"
	);
	Запрос.УстановитьПараметр("Период"		, Отбор.Период.Значение - 1);
	Запрос.УстановитьПараметр("Контрагент"	, Отбор.Контрагент.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();

		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

			Если Выборка.КлиентMagentoII = Истина Тогда

				ЗаписьНабора.КлиентMagentoII = Истина;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры












