	 
#Область ОбъявлениеПеременных

&НаКлиенте
Перем ЗакрытиеПодтверждено;

#КонецОбласти	 
	 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Доступно 2 режима: "ВводСсылки" и "КопированиеСсылки"
	Параметры.Свойство("РежимРаботы", РежимРаботы);
	
	Если РежимРаботы <> РежимРаботыВводСсылки() И РежимРаботы <> РежимРаботыКопированиеСсылки() Тогда
		СообщитьПользователю("В форму копирования/ввода ссылки не передан параметр с режимом работы формы или режим указан некорректно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если РежимРаботы = РежимРаботыВводСсылки() Тогда
		
		Элементы.СтраницаВводСсылки.Видимость = Истина;
		Элементы.СтраницаКопированиеСсылки.Видимость = Ложь;
		
	ИначеЕсли РежимРаботы = РежимРаботыКопированиеСсылки() Тогда
		
		Параметры.Свойство("СсылкаНаФрагментКода", СсылкаНаФрагментКода);
		
		Если ПустаяСтрока(СсылкаНаФрагментКода) Тогда
			СообщитьПользователю("В форму не была передана ссылка на опубликованный фрагмент кода.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Элементы.СтраницаВводСсылки.Видимость = Ложь;
		Элементы.СтраницаКопированиеСсылки.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если РежимРаботы = РежимРаботыКопированиеСсылки() И НЕ ПользовательСохранилСсылку И НЕ ЗакрытиеПодтверждено И НЕ ЗавершениеРаботы Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ВопросПодтвердитьЗакрытиеФормыЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Вы не сохранили ссылку. Подвердить закрытие формы?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СсылкаНаФрагментКода1Нажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиПоСсылкеНаФрагментКода();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьКод(Команда)
	
	ТекстОшибки = "";
	Если ПустаяСтрока(СсылкаНаФрагментКода) Тогда
		ТекстОшибки = "Ссылка не введена.";
	КонецЕсли;
	
	Если СтрНайти(НРег(СсылкаНаФрагментКода), "https://paste1c.ru") = 0 Тогда
		ТекстОшибки = "Проверьте правильность введенной ссылки. Необходимо ввести ссылку к сервису ""https://paste1c.ru/""";
	КонецЕсли;

	ПозицияПоследнегоСлэша = СтрНайти(НРег(СсылкаНаФрагментКода), "/", НаправлениеПоиска.СКонца);
	
	Если ПозицияПоследнегоСлэша = 0 ИЛИ Сред(СсылкаНаФрагментКода, 1, ПозицияПоследнегоСлэша - 1) <> "https://paste1c.ru" Тогда
		ПоказатьПредупреждение(, "Введена некорректная ссылка. Введенная ссылка должна быть аналогична ссылке в примере.");
		Возврат;
	КонецЕсли;	
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(СсылкаНаФрагментКода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылке(Команда)
	
	ПерейтиПоСсылкеНаФрагментКода();
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСсылку(Команда)
	
	БуферОбмена = 
		СтрШаблон("<!DOCTYPE html>
		|<html>
		|	<body onload='copy()'>
		|		<input id='input' type='text'/>
		|		<script>
		|			function copy() {
		|				var text = '%1';
		|				var ua = navigator.userAgent;
		|				if (ua.search(/MSIE/) > 0 || ua.search(/Trident/) > 0) {
		|					window.clipboardData.setData('Text', text);
		|				} else {
		|					var copyText = document.getElementById('input');
		|					copyText.value = text;
		|					copyText.select();
		|					document.execCommand('copy');
		|				}
		|			}
		|		</script>
		|	</body>
		|</html>", СсылкаНаФрагментКода);    
	
	ПоказатьОповещениеПользователя("Ссылка скопирована.",,, БиблиотекаКартинок.ОформлениеФлажок);	
	
	ПользовательСохранилСсылку = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВопросПодтвердитьЗакрытиеФормыЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗакрытиеПодтверждено = Истина;
		Закрыть();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылкеНаФрагментКода()

	Попытка
		ПерейтиПоНавигационнойСсылке(СсылкаНаФрагментКода);
		ПользовательСохранилСсылку = Истина;
	Исключение
	    СообщитьПользователю("Не удалось перейти по ссылки по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(ТекстСообщения)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РежимРаботыКопированиеСсылки()
	
	Возврат "КопированиеСсылки";
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РежимРаботыВводСсылки()

	Возврат "ВводСсылки";
	
КонецФункции


#КонецОбласти

#Область ИнициализацияПеременных

ЗакрытиеПодтверждено = Ложь;

#КонецОбласти 
