#Область ОбработчикиСобытийФормы

&НаКлиенте	//	LNK 06.05.2024 16:01:41
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Если РегистрацияВыполнена(Запись) Тогда

		ПоказатьОповещениеПользователя("Выполнено!"
			,
			, "Регистрация текущей записи для NAV выполнена!"
			, БиблиотекаКартинок.Информация32
		);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста	//	LNK 06.05.2024 16:03:50
Функция РегистрацияВыполнена(Знач ЭтаЗапись)

	НаборЗаписей = РегистрыСведений.СоответствиеДокументовNavision.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ЭтаЗапись.Объект);
	НаборЗаписей.Отбор.Магазин.Установить(ЭтаЗапись.Магазин);

	Если ПланыОбмена.ИзменениеЗарегистрировано(ВнешниеИсточникиПовтИсп.СписокУзловNavision()[0], НаборЗаписей) Тогда

			Возврат Истина;

	Иначе	Возврат Ложь;

	КонецЕсли;

	Возврат Истина;

КонецФункции

























