#Область ПрограммныйИнтерфейс

//	LNK 26.10.2016 15:02:52
Процедура ЗаполнитьДанныеПереоценки(ИспользоватьОстаткиТоваровНаДатуНовыхЦен)	Экспорт

//	Предыдущие цены принимаем на конец дня "вчера", текущие - "сегодня", а остатки - на конец "сегодня".

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТоварыНаСкладах.Склад КАК Склад,
	|	ТоварыНаСкладах.Склад.Магазин.ПравилоЦенообразования.ВидЦен КАК ВидЦен,
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Характеристика КАК Характеристика,
	|	ТоварыНаСкладах.КоличествоОстаток КАК Количество,
	|	ТоварыНаСкладах.Номенклатура.Наименование КАК КлючПорядка
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ), СЕКУНДА, 1),
	|			Склад.Магазин = &Магазин
	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.КоличествоОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЦен,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.Склад КАК Склад,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Характеристика КАК Характеристика,
	|	ТаблицаДанных.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДанных.ТипПереоценки = ЗНАЧЕНИЕ(Перечисление.ТипыПереоценок.ПромоНачало)
	|			ТОГДА ТаблицаДанных.ЦенаОпорная
	|		ИНАЧЕ ТаблицаДанных.Цена
	|	КОНЕЦ КАК Цена,
	|	ТаблицаДанных.ЦенаНовая КАК ЦенаНовая,
	|	ТаблицаДанных.Акция КАК Акция,
	|	ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК Сумма,
	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество КАК СуммаНовая,
	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество - ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК СуммаПереоценки,
	|	ТаблицаДанных.КлючПорядка КАК КлючПорядка,
	|	ТаблицаДанных.ТорговаяМарка КАК ТорговаяМарка,
	|	ТаблицаДанных.Производитель КАК Производитель,
	|	ТаблицаДанных.ТипПереоценки КАК ТипПереоценки
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Склад КАК Склад,
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.Характеристика КАК Характеристика,
	|		Товары.Количество КАК Количество,
	|		ЕСТЬNULL(ЦеныПредыдущие.Цена, 0) / ЕСТЬNULL(ЦеныПредыдущие.Упаковка.Коэффициент, 1) КАК Цена,
	|		ЕСТЬNULL(ЦеныНовые.Цена, 0) / ЕСТЬNULL(ЦеныНовые.Упаковка.Коэффициент, 1) КАК ЦенаНовая,
	|		ЦеныНовые.Акция КАК Акция,
	|		Товары.КлючПорядка КАК КлючПорядка,
	|		ЕСТЬNULL(ТаблицаРеквизиты.Значение, ЗНАЧЕНИЕ(Справочник.Марки.ПустаяСсылка)) КАК ТорговаяМарка,
	|		Товары.Номенклатура.Производитель КАК Производитель,
	|		ЦеныНовые.ТипПереоценки КАК ТипПереоценки,
	|		ЕСТЬNULL(ОпорныеЦеныНоменклатуры.Цена, 0) / ЕСТЬNULL(ОпорныеЦеныНоменклатуры.Упаковка.Коэффициент, 1) КАК ЦенаОпорная
	|	ИЗ
	|		Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(
	|					&ДатаДокумента,
	|					ОбъектЦенообразования = &Магазин
	|						И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ЦеныПредыдущие
	|			ПО Товары.Номенклатура = ЦеныПредыдущие.Номенклатура
	|				И Товары.Характеристика = ЦеныПредыдущие.Характеристика
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|					КОНЕЦПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ),
	|					ВидЦены В
	|						(ВЫБРАТЬ ПЕРВЫЕ 1
	|							Товары.ВидЦен
	|						ИЗ
	|							Товары)) КАК ЦеныНовые
	|			ПО Товары.Номенклатура = ЦеныНовые.Номенклатура
	|				И Товары.Характеристика = ЦеныНовые.Характеристика
	|				И Товары.ВидЦен = ЦеныНовые.ВидЦены
	|				И (ЦеныНовые.Период >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ), ДЕНЬ, -1))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ТаблицаРеквизиты
	|			ПО Товары.Номенклатура = ТаблицаРеквизиты.Ссылка
	|				И (ТаблицаРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ТорговыеМарки))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОпорныеЦеныНоменклатуры.СрезПоследних(, ) КАК ОпорныеЦеныНоменклатуры
	|			ПО Товары.Номенклатура = ОпорныеЦеныНоменклатуры.Номенклатура
	|				И Товары.Характеристика = ОпорныеЦеныНоменклатуры.Характеристика
	|				И Товары.Склад.Магазин = ОпорныеЦеныНоменклатуры.Магазин) КАК ТаблицаДанных
	|ГДЕ
	|	НЕ ТаблицаДанных.ЦенаНовая = ТаблицаДанных.Цена
	|	И ТаблицаДанных.Акция ЕСТЬ НЕ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТорговаяМарка,
	|	Производитель,
	|	КлючПорядка"
	);
	Запрос.УстановитьПараметр("ДатаДокумента"  , Дата);
	Запрос.УстановитьПараметр("ДатаНовыхЦен"   , ДатаНовыхЦен);
	Запрос.УстановитьПараметр("ДатаОстатков"   ,
		?(ИспользоватьОстаткиТоваровНаДатуНовыхЦен = Истина, ДатаОстатков, Дата));
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидОперации"    , ВидОперации);
	Запрос.УстановитьПараметр("Магазин"        , Магазин);
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти


Процедура ЗаполнитьДанныеПереоценкиСоСкидками(ИспользоватьОстаткиТоваровНаДатуНовыхЦен)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТоварыНаСкладах.Склад КАК Склад,
	|	ТоварыНаСкладах.Склад.Магазин.ПравилоЦенообразования.ВидЦен КАК ВидЦен,
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Характеристика КАК Характеристика,
	|	ТоварыНаСкладах.КоличествоОстаток КАК Количество,
	|	ТоварыНаСкладах.Номенклатура.Наименование КАК КлючПорядка
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ), СЕКУНДА, 1),
	|			Склад.Магазин = &Магазин
	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.КоличествоОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЦен,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Бонусы.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(Бонусы.СписаниеБонусов) КАК СписаниеБонусов,
	|	МАКСИМУМ(Бонусы.НачислениеБонусов) КАК НачислениеБонусов
	|ПОМЕСТИТЬ ТабБонусы
	|ИЗ
	|	(ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура КАК Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка.ПрограммаЛояльности.МаксимальныйПроцентОплатыБонусами КАК СписаниеБонусов,
	|		0 КАК НачислениеБонусов
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииСписаниебонусов
	|		И ДействиеСкидокНаценок.Период <= &КонецДня
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка.ЗначениеСкидкиНаценки
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииНачислениеБонусов
	|		И ДействиеСкидокНаценок.Период <= &КонецДня
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА) КАК Бонусы
	|
	|СГРУППИРОВАТЬ ПО
	|	Бонусы.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Бонусы.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцииЗавтра.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(АкцииЗавтра.СписаниеБонусов) КАК СписаниеБонусов,
	|	МАКСИМУМ(АкцииЗавтра.НачислениеБонусов) КАК НачислениеБонусов
	|ПОМЕСТИТЬ ТабБонусыЗавтра
	|ИЗ
	|	(ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ДействиеСкидокНаценок.СкидкаНаценка.ПрограммаЛояльности.МаксимальныйПроцентОплатыБонусами) КАК СписаниеБонусов,
	|		0 КАК НачислениеБонусов
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииСписаниебонусов
	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		МАКСИМУМ(ДействиеСкидокНаценок.СкидкаНаценка.ЗначениеСкидкиНаценки)
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииНачислениеБонусов
	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура) КАК АкцииЗавтра
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцииЗавтра.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаСложная) КАК СкидкаСложная,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаОптовая) КАК СкидкаОптовая,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаПервая) КАК СкидкаПервая
	|ПОМЕСТИТЬ ТабАкции
	|ИЗ
	|	(ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура КАК Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка КАК СкидкаСложная,
	|		0 КАК СкидкаОптовая,
	|		0 КАК СкидкаПервая,
	|		0 КАК СкидкаКэшБэк
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкциисложная
	|		И ДействиеСкидокНаценок.Период <= &КонецДня
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка,
	|		0,
	|		0
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииОптовая
	|		И ДействиеСкидокНаценок.Период <= &КонецДня
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка,
	|		0
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииНаПервуюПозицию
	|		И ДействиеСкидокНаценок.Период <= &КонецДня
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка) КАК АкцииЗавтра
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцииЗавтра.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаСложная) КАК СкидкаСложная,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаОптовая) КАК СкидкаОптовая,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаПервая) КАК СкидкаПервая
	|ПОМЕСТИТЬ ТабАкцииЗавтра
	|ИЗ
	|	(ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура КАК Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка КАК СкидкаСложная,
	|		0 КАК СкидкаОптовая,
	|		0 КАК СкидкаПервая
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкциисложная
	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка,
	|		0
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииОптовая
	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииНаПервуюПозицию
	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка) КАК АкцииЗавтра
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабАкцииЗавтра.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаПервая = 0
	|			ТОГДА ТабАкцииЗавтра.СкидкаПервая
	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаОптовая = 0
	|			ТОГДА ТабАкцииЗавтра.СкидкаОптовая
	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаСложная = 0
	|			ТОГДА ТабАкцииЗавтра.СкидкаСложная
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК АкцияНовая
	|ПОМЕСТИТЬ ТабВыборАкцииЗавтра
	|ИЗ
	|	ТабАкцииЗавтра КАК ТабАкцииЗавтра
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ ТабАкции.СкидкаПервая = 0
	|			ТОГДА ТабАкции.СкидкаПервая
	|		КОГДА НЕ ТабАкции.СкидкаОптовая = 0
	|			ТОГДА ТабАкции.СкидкаОптовая
	|		КОГДА НЕ ТабАкции.СкидкаСложная = 0
	|			ТОГДА ТабАкции.СкидкаСложная
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Акция,
	|	ТабАкции.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТабВыборАкции
	|ИЗ
	|	ТабАкции КАК ТабАкции
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабВыборАкции.Номенклатура КАК Номенклатура,
	|	ТабВыборАкции.Акция КАК Акция,
	|	1 КАК Поле1
	|ПОМЕСТИТЬ АкцииОбъед
	|ИЗ
	|	ТабВыборАкции КАК ТабВыборАкции
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТабВыборАкцииЗавтра.Номенклатура,
	|	ТабВыборАкцииЗавтра.АкцияНовая,
	|	2
	|ИЗ
	|	ТабВыборАкцииЗавтра КАК ТабВыборАкцииЗавтра
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцииОбъед.Номенклатура КАК Номенклатура,
	|	АкцииОбъед.Акция КАК АкцияНовая,
	|	СУММА(АкцииОбъед.Поле1) КАК Поле1
	|ПОМЕСТИТЬ АкцииРезультат
	|ИЗ
	|	АкцииОбъед КАК АкцииОбъед
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцииОбъед.Номенклатура,
	|	АкцииОбъед.Акция
	|
	|ИМЕЮЩИЕ
	|	СУММА(АкцииОбъед.Поле1) = 2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцииОбъед.Номенклатура КАК Номенклатура,
	|	АкцииОбъед.Акция КАК АкцияНовая,
	|	СУММА(АкцииОбъед.Поле1) КАК Поле1
	|ПОМЕСТИТЬ АкцииРезультат2
	|ИЗ
	|	АкцииОбъед КАК АкцииОбъед
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцииОбъед.Номенклатура,
	|	АкцииОбъед.Акция
	|
	|ИМЕЮЩИЕ
	|	СУММА(АкцииОбъед.Поле1) = 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцииРезультат.Номенклатура КАК Номенклатура,
	|	АкцииРезультат.АкцияНовая КАК АкцияНовая,
	|	2 КАК Поле1
	|ПОМЕСТИТЬ АкцииРезультатИтог
	|ИЗ
	|	АкцииРезультат КАК АкцииРезультат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АкцииРезультат2.Номенклатура,
	|	АкцииРезультат2.АкцияНовая,
	|	2
	|ИЗ
	|	АкцииРезультат2 КАК АкцииРезультат2
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.Склад КАК Склад,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Характеристика КАК Характеристика,
	|	ТаблицаДанных.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДанных.ТипПереоценки = ЗНАЧЕНИЕ(Перечисление.ТипыПереоценок.ПромоНачало)
	|			ТОГДА ТаблицаДанных.ЦенаОпорная
	|		ИНАЧЕ ТаблицаДанных.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ТаблицаДанных.ЦенаНовая = 0
	|			ТОГДА ТаблицаДанных.Цена
	|		ИНАЧЕ ТаблицаДанных.ЦенаНовая
	|	КОНЕЦ КАК ЦенаНовая,
	|	ТаблицаДанных.Акция КАК Акция,
	|	ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК Сумма,
	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество КАК СуммаНовая,
	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество - ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК СуммаПереоценки,
	|	ТаблицаДанных.КлючПорядка КАК КлючПорядка,
	|	ТаблицаДанных.ТорговаяМарка КАК ТорговаяМарка,
	|	ТаблицаДанных.Производитель КАК Производитель,
	|	ТабВыборАкцииЗавтра.АкцияНовая КАК СкидкаНаценка,
	|	ТабВыборАкцииЗавтра.АкцияНовая.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	|	ТабВыборАкцииЗавтра.АкцияНовая.ТипСкидкиНаценки КАК ТипСкидкиНаценки,
	|	ТаблицаДанных.ТипПереоценки КАК ТипПереоценки,
	|	ТабБонусыЗавтра.СписаниеБонусов КАК БонусАкцияСписан,
	|	ТабБонусыЗавтра.НачислениеБонусов КАК БонусБазаНачислен
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Склад КАК Склад,
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.Характеристика КАК Характеристика,
	|		Товары.Количество КАК Количество,
	|		ЕСТЬNULL(ЦеныПредыдущие.Цена, 0) / ЕСТЬNULL(ЦеныПредыдущие.Упаковка.Коэффициент, 1) КАК Цена,
	|		ЕСТЬNULL(ЦеныНовые.Цена, 0) / ЕСТЬNULL(ЦеныНовые.Упаковка.Коэффициент, 1) КАК ЦенаНовая,
	|		ЦеныНовые.Акция КАК Акция,
	|		Товары.КлючПорядка КАК КлючПорядка,
	|		ЕСТЬNULL(ТаблицаРеквизиты.Значение, ЗНАЧЕНИЕ(Справочник.Марки.ПустаяСсылка)) КАК ТорговаяМарка,
	|		Товары.Номенклатура.Производитель КАК Производитель,
	|		ЦеныНовые.ТипПереоценки КАК ТипПереоценки,
	|		ЕСТЬNULL(ОпорныеЦеныНоменклатуры.Цена, 0) / ЕСТЬNULL(ОпорныеЦеныНоменклатуры.Упаковка.Коэффициент, 1) КАК ЦенаОпорная
	|	ИЗ
	|		Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(
	|					&ДатаДокумента,
	|					ОбъектЦенообразования = &Магазин
	|						И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ЦеныПредыдущие
	|			ПО Товары.Номенклатура = ЦеныПредыдущие.Номенклатура
	|				И Товары.Характеристика = ЦеныПредыдущие.Характеристика
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|					КОНЕЦПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ),
	|					ВидЦены В
	|						(ВЫБРАТЬ ПЕРВЫЕ 1
	|							Товары.ВидЦен
	|						ИЗ
	|							Товары)) КАК ЦеныНовые
	|			ПО Товары.Номенклатура = ЦеныНовые.Номенклатура
	|				И Товары.Характеристика = ЦеныНовые.Характеристика
	|				И Товары.ВидЦен = ЦеныНовые.ВидЦены
	|				И (ЦеныНовые.Период >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ), ДЕНЬ, -1))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ТаблицаРеквизиты
	|			ПО Товары.Номенклатура = ТаблицаРеквизиты.Ссылка
	|				И (ТаблицаРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ТорговыеМарки))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОпорныеЦеныНоменклатуры.СрезПоследних(, ) КАК ОпорныеЦеныНоменклатуры
	|			ПО Товары.Номенклатура = ОпорныеЦеныНоменклатуры.Номенклатура
	|				И Товары.Характеристика = ОпорныеЦеныНоменклатуры.Характеристика
	|				И Товары.Склад.Магазин = ОпорныеЦеныНоменклатуры.Магазин) КАК ТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ АкцииРезультатИтог КАК АкцииРезультатИтог
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатаИзмененияУсловийСкидокНаценок КАК ДатаИзмененияУсловийСкидокНаценок
	|			ПО АкцииРезультатИтог.АкцияНовая = ДатаИзмененияУсловийСкидокНаценок.СкидкаНаценка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатаИзмененияСегментов КАК ДатаИзмененияСегментов
	|			ПО АкцииРезультатИтог.Номенклатура = ДатаИзмененияСегментов.Номенклатура
	|		ПО ТаблицаДанных.Номенклатура = АкцииРезультатИтог.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабВыборАкцииЗавтра КАК ТабВыборАкцииЗавтра
	|		ПО ТаблицаДанных.Номенклатура = ТабВыборАкцииЗавтра.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабВыборАкции КАК ТабВыборАкции
	|		ПО ТаблицаДанных.Номенклатура = ТабВыборАкции.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабАкцииЗавтра КАК ТабАкцииЗавтра
	|		ПО ТаблицаДанных.Номенклатура = ТабАкцииЗавтра.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабБонусы КАК ТабБонусы
	|		ПО ТаблицаДанных.Номенклатура = ТабБонусы.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабБонусыЗавтра КАК ТабБонусыЗавтра
	|		ПО ТаблицаДанных.Номенклатура = ТабБонусыЗавтра.Номенклатура
	|ГДЕ
	|	(ТаблицаДанных.Цена <> ТаблицаДанных.ЦенаНовая
	|				И ТаблицаДанных.Акция ЕСТЬ НЕ NULL 
	|			ИЛИ АкцииРезультатИтог.Поле1 = 2
	|			ИЛИ ДатаИзмененияУсловийСкидокНаценок.Дата МЕЖДУ &НачалоДня И &КонецДня
	|			ИЛИ ДатаИзмененияСегментов.Дата МЕЖДУ &НачалоДня И &КонецДня
	|			ИЛИ ТаблицаДанных.Номенклатура.ДатаИзменения МЕЖДУ &НачалоДня И &КонецДня
	|			ИЛИ ТабВыборАкции.Акция <> ТабВыборАкцииЗавтра.АкцияНовая
	|			ИЛИ ТабБонусы.СписаниеБонусов <> ТабБонусыЗавтра.СписаниеБонусов
	|				И (ТабБонусыЗавтра.НачислениеБонусов <> 0
	|					ИЛИ ТабБонусыЗавтра.НачислениеБонусов ЕСТЬ NULL)
	|			ИЛИ ТабБонусы.НачислениеБонусов <> ТабБонусыЗавтра.НачислениеБонусов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанных.ТорговаяМарка,
	|	ТаблицаДанных.Склад,
	|	ТаблицаДанных.Акция,
	|	ТаблицаДанных.КлючПорядка,
	|	ТаблицаДанных.Характеристика,
	|	ТаблицаДанных.Номенклатура,
	|	ТаблицаДанных.Производитель,
	|	ТаблицаДанных.ТипПереоценки,
	|	ТаблицаДанных.Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДанных.ТипПереоценки = ЗНАЧЕНИЕ(Перечисление.ТипыПереоценок.ПромоНачало)
	|			ТОГДА ТаблицаДанных.ЦенаОпорная
	|		ИНАЧЕ ТаблицаДанных.Цена
	|	КОНЕЦ,
	|	ТаблицаДанных.Цена * ТаблицаДанных.Количество,
	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество,
	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество - ТаблицаДанных.Цена * ТаблицаДанных.Количество,
	|	ТабВыборАкцииЗавтра.АкцияНовая,
	|	ТабВыборАкцииЗавтра.АкцияНовая.ЗначениеСкидкиНаценки,
	|	ТабВыборАкцииЗавтра.АкцияНовая.ТипСкидкиНаценки,
	|	ВЫБОР
	|		КОГДА ТаблицаДанных.ЦенаНовая = 0
	|			ТОГДА ТаблицаДанных.Цена
	|		ИНАЧЕ ТаблицаДанных.ЦенаНовая
	|	КОНЕЦ,
	|	ТабБонусыЗавтра.СписаниеБонусов,
	|	ТабБонусыЗавтра.НачислениеБонусов
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТорговаяМарка,
	|	Производитель,
	|	КлючПорядка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабАкцииЗавтра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабАкции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабВыборАкции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабВыборАкцииЗавтра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АкцииОбъед
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АкцииРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АкцииРезультат2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АкцииРезультатИтог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабБонусыЗавтра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТабБонусы"
	);
	Запрос.УстановитьПараметр("ДатаДокумента"  , Дата);
	Запрос.УстановитьПараметр("ДатаНовыхЦен"   , ДатаНовыхЦен);
	Запрос.УстановитьПараметр("ДатаОстатков"   ,
		?(ИспользоватьОстаткиТоваровНаДатуНовыхЦен = Истина, ДатаОстатков, Дата));
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидОперации"    , ВидОперации);
	Запрос.УстановитьПараметр("ТипАкциисложная"        , Перечисления.ТипСкидкиНаценки.СложнаяМеханика);
	Запрос.УстановитьПараметр("ТипАкцииНачислениеБонусов"        , Перечисления.ТипСкидкиНаценки.НачислениеБонусов);	
	Запрос.УстановитьПараметр("ТипАкцииСписаниебонусов"        , Перечисления.ТипСкидкиНаценки.СписаниеБонусов);	
	
	Запрос.УстановитьПараметр("ТипАкцииОптовая"        , Перечисления.ТипСкидкиНаценки.Оптовая);
	Запрос.УстановитьПараметр("ТипАкцииНаПервуюПозицию"        , Перечисления.ТипСкидкиНаценки.НаПервуюПозицию);
	Запрос.УстановитьПараметр("КонецДня"        , КонецДня(Дата));
	Запрос.УстановитьПараметр("НачалоДня"        ,  НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДняЗавтра"        ,  КонецДня(Дата)+24*60*60);
	Запрос.УстановитьПараметр("НачалоДняЗавтра"        ,  НачалоДня(Дата)+24*60*60);
	Запрос.УстановитьПараметр("Магазин"        , Магазин);

	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ЗаполнитьДанныеПереоценкиСоСкидкамиЦРМ(ИспользоватьОстаткиТоваровНаДатуНовыхЦен)	Экспорт


	
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТоварыНаСкладах.Склад КАК Склад,
		|	ТоварыНаСкладах.Склад.Магазин.ПравилоЦенообразования.ВидЦен КАК ВидЦен,
		|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладах.Характеристика КАК Характеристика,
		|	ТоварыНаСкладах.КоличествоОстаток КАК Количество,
		|	ТоварыНаСкладах.Номенклатура.Наименование КАК КлючПорядка
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ), СЕКУНДА, 1),
		|			Склад.Магазин = &Магазин
		|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ТоварыНаСкладах
		|ГДЕ
		|	ТоварыНаСкладах.КоличествоОстаток > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВидЦен,
		|	Номенклатура,
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Склад КАК Склад,
		|	Товары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ДействиеСкидокНаценок.СкидкаНаценка.ЗначениеСкидкиНаценки) КАК СкидкаНаценкаЗначениеСкидкиНаценки
		|ПОМЕСТИТЬ ТабЦРМ
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
		|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
		|		ПО НоменклатураСегмента.Номенклатура = Товары.Номенклатура
		|ГДЕ
		|	ДействиеСкидокНаценок.ДатаОкончания <= &ДатаОстатков
		|	И ДействиеСкидокНаценок.Период >= &ДатаОстатков
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Склад,
		|	Товары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.Склад КАК Склад,
		|	ТаблицаДанных.Номенклатура КАК Номенклатура,
		|	ТаблицаДанных.Характеристика КАК Характеристика,
		|	ТаблицаДанных.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ТаблицаДанных.ТипПереоценки = ЗНАЧЕНИЕ(Перечисление.ТипыПереоценок.ПромоНачало)
		|			ТОГДА ТаблицаДанных.ЦенаОпорная
		|		ИНАЧЕ ТаблицаДанных.Цена
		|	КОНЕЦ КАК Цена,
		|	ТаблицаДанных.ЦенаНовая КАК ЦенаНовая,
		|	ТаблицаДанных.Акция КАК Акция,
		|	ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК Сумма,
		|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество КАК СуммаНовая,
		|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество - ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК СуммаПереоценки,
		|	ТаблицаДанных.КлючПорядка КАК КлючПорядка,
		|	ТаблицаДанных.ТорговаяМарка КАК ТорговаяМарка,
		|	ТаблицаДанных.Производитель КАК Производитель,
		|	ТаблицаДанных.ТипПереоценки КАК ТипПереоценки
		|ПОМЕСТИТЬ ТабЦены
		|ИЗ
		|	(ВЫБРАТЬ
		|		Товары.Склад КАК Склад,
		|		Товары.Номенклатура КАК Номенклатура,
		|		Товары.Характеристика КАК Характеристика,
		|		Товары.Количество КАК Количество,
		|		ЕСТЬNULL(ЦеныПредыдущие.Цена, 0) / ЕСТЬNULL(ЦеныПредыдущие.Упаковка.Коэффициент, 1) КАК Цена,
		|		ЕСТЬNULL(ЦеныНовые.Цена, 0) / ЕСТЬNULL(ЦеныНовые.Упаковка.Коэффициент, 1) КАК ЦенаНовая,
		|		ЦеныНовые.Акция КАК Акция,
		|		Товары.КлючПорядка КАК КлючПорядка,
		|		ЕСТЬNULL(ТаблицаРеквизиты.Значение, ЗНАЧЕНИЕ(Справочник.Марки.ПустаяСсылка)) КАК ТорговаяМарка,
		|		Товары.Номенклатура.Производитель КАК Производитель,
		|		ЦеныНовые.ТипПереоценки КАК ТипПереоценки,
		|		ЕСТЬNULL(ОпорныеЦеныНоменклатуры.Цена, 0) / ЕСТЬNULL(ОпорныеЦеныНоменклатуры.Упаковка.Коэффициент, 1) КАК ЦенаОпорная
		|	ИЗ
		|		Товары КАК Товары
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(
		|					&ДатаДокумента,
		|					ОбъектЦенообразования = &Магазин
		|						И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ЦеныПредыдущие
		|			ПО Товары.Номенклатура = ЦеныПредыдущие.Номенклатура
		|				И Товары.Характеристика = ЦеныПредыдущие.Характеристика
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|					КОНЕЦПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ),
		|					ВидЦены В
		|						(ВЫБРАТЬ ПЕРВЫЕ 1
		|							Товары.ВидЦен
		|						ИЗ
		|							Товары)) КАК ЦеныНовые
		|			ПО Товары.Номенклатура = ЦеныНовые.Номенклатура
		|				И Товары.Характеристика = ЦеныНовые.Характеристика
		|				И Товары.ВидЦен = ЦеныНовые.ВидЦены
		|				И (ЦеныНовые.Период >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ), ДЕНЬ, -1))
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ТаблицаРеквизиты
		|			ПО Товары.Номенклатура = ТаблицаРеквизиты.Ссылка
		|				И (ТаблицаРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ТорговыеМарки))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОпорныеЦеныНоменклатуры.СрезПоследних(, ) КАК ОпорныеЦеныНоменклатуры
		|			ПО Товары.Номенклатура = ОпорныеЦеныНоменклатуры.Номенклатура
		|				И Товары.Характеристика = ОпорныеЦеныНоменклатуры.Характеристика
		|				И Товары.Склад.Магазин = ОпорныеЦеныНоменклатуры.Магазин) КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Склад КАК Склад,
		|	Товары.ВидЦен КАК ВидЦен,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество,
		|	Товары.КлючПорядка КАК КлючПорядка,
		|	ТабЦены.Цена КАК Цена,
		|	ТабЦены.Акция КАК Акция,
		|	ТабЦены.Сумма КАК Сумма,
		|	ТабЦены.СуммаНовая КАК СуммаНовая,
		|	ТабЦены.СуммаПереоценки КАК СуммаПереоценки,
		|	ТабЦены.ТорговаяМарка КАК ТорговаяМарка,
		|	ТабЦены.Производитель КАК Производитель,
		|	ТабЦены.ТипПереоценки КАК ТипПереоценки,
		|	ТабЦены.Цена * ТабЦРМ.СкидкаНаценкаЗначениеСкидкиНаценки / 100 КАК БонусБазаНачислен
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦРМ КАК ТабЦРМ
		|		ПО Товары.Номенклатура = ТабЦРМ.Номенклатура
		|			И Товары.Склад = ТабЦРМ.Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦены КАК ТабЦены
		|		ПО Товары.Склад = ТабЦены.Склад
		|			И Товары.Номенклатура = ТабЦены.Номенклатура"
	);
	Запрос.УстановитьПараметр("ДатаДокумента"  , Дата);
	Запрос.УстановитьПараметр("НачалоДня"  , НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаНовыхЦен"   , ДатаНовыхЦен);
	Запрос.УстановитьПараметр("ДатаОстатков"   ,
		?(ИспользоватьОстаткиТоваровНаДатуНовыхЦен = Истина, ДатаОстатков, Дата));
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("Магазин"        , Магазин);

	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ЗаполнитьДанныеСкидками(ИспользоватьОстаткиТоваровНаДатуНовыхЦен)	Экспорт

//	Предыдущие цены принимаем на конец дня "вчера", текущие - "сегодня", а остатки - на конец "сегодня".

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТоварыНаСкладах.Склад КАК Склад,
	|	ТоварыНаСкладах.Склад.Магазин.ПравилоЦенообразования.ВидЦен КАК ВидЦен,
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладах.Характеристика КАК Характеристика,
	|	ТоварыНаСкладах.КоличествоОстаток КАК Количество,
	|	ТоварыНаСкладах.Номенклатура.Наименование КАК КлючПорядка
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ), СЕКУНДА, 1),
	|			Склад.Магазин = &Магазин
	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.КоличествоОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЦен,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцииЗавтра.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаСложная) КАК СкидкаСложная,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаОптовая) КАК СкидкаОптовая,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаПервая) КАК СкидкаПервая,
	|	АкцииЗавтра.СкидкаКэшБэк КАК СкидкаКэшБэк
	|ПОМЕСТИТЬ ТабАкцииЗавтра
	|ИЗ
	|	(ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура КАК Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка КАК СкидкаСложная,
	|		0 КАК СкидкаОптовая,
	|		0 КАК СкидкаПервая,
	|		0 КАК СкидкаКэшБэк
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкциисложная
	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка,
	|		0,
	|		0
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииОптовая
	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка,
	|		0
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииНаПервуюПозицию
	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		0,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииКэшБэк
	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка) КАК АкцииЗавтра
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура,
	|	АкцииЗавтра.СкидкаКэшБэк
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцииЗавтра.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаСложная) КАК СкидкаСложная,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаОптовая) КАК СкидкаОптовая,
	|	МАКСИМУМ(АкцииЗавтра.СкидкаПервая) КАК СкидкаПервая,
	|	АкцииЗавтра.СкидкаКэшБэк КАК СкидкаКэшБэк
	|ПОМЕСТИТЬ ТабАкции
	|ИЗ
	|	(ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура КАК Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка КАК СкидкаСложная,
	|		0 КАК СкидкаОптовая,
	|		0 КАК СкидкаПервая,
	|		0 КАК СкидкаКэшБэк
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкциисложная
	|		И ДействиеСкидокНаценок.Период <= &КонецДня
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка,
	|		0,
	|		0
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииОптовая
	|		И ДействиеСкидокНаценок.Период <= &КонецДня
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка,
	|		0
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииНаПервуюПозицию
	|		И ДействиеСкидокНаценок.Период <= &КонецДня
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НоменклатураСегмента.Номенклатура,
	|		0,
	|		0,
	|		0,
	|		ДействиеСкидокНаценок.СкидкаНаценка
	|	ИЗ
	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
	|	ГДЕ
	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииКэшБэк
	|		И ДействиеСкидокНаценок.Период <= &КонецДня
	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
	|		И ДействиеСкидокНаценок.СкидкаНаценка.УчаствуетВПереоценке = ИСТИНА
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НоменклатураСегмента.Номенклатура,
	|		ДействиеСкидокНаценок.СкидкаНаценка) КАК АкцииЗавтра
	|
	|СГРУППИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура,
	|	АкцииЗавтра.СкидкаКэшБэк
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АкцииЗавтра.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаПервая = 0
	|			ТОГДА ТабАкцииЗавтра.СкидкаПервая
	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаКэшБэк = 0
	|			ТОГДА ТабАкцииЗавтра.СкидкаКэшБэк
	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаОптовая = 0
	|			ТОГДА ТабАкцииЗавтра.СкидкаОптовая
	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаСложная = 0
	|			ТОГДА ТабАкцииЗавтра.СкидкаСложная
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК АкцияНовая
	|ПОМЕСТИТЬ ТабВыборАкцииЗавтра
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабАкцииЗавтра КАК ТабАкцииЗавтра
	|		ПО Товары.Номенклатура = ТабАкцииЗавтра.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ТабАкции.СкидкаПервая = 0
	|			ТОГДА ТабАкции.СкидкаПервая
	|		КОГДА НЕ ТабАкции.СкидкаКэшБэк = 0
	|			ТОГДА ТабАкции.СкидкаКэшБэк
	|		КОГДА НЕ ТабАкции.СкидкаОптовая = 0
	|			ТОГДА ТабАкции.СкидкаОптовая
	|		КОГДА НЕ ТабАкции.СкидкаСложная = 0
	|			ТОГДА ТабАкции.СкидкаСложная
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Акция
	|ПОМЕСТИТЬ ТабВыборАкции
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабАкции КАК ТабАкции
	|		ПО Товары.Номенклатура = ТабАкции.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанных.Склад КАК Склад,
	|	ТаблицаДанных.Номенклатура КАК Номенклатура,
	|	ТаблицаДанных.Характеристика КАК Характеристика,
	|	ТаблицаДанных.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДанных.ТипПереоценки = ЗНАЧЕНИЕ(Перечисление.ТипыПереоценок.ПромоНачало)
	|			ТОГДА ТаблицаДанных.ЦенаОпорная
	|		ИНАЧЕ ТаблицаДанных.Цена
	|	КОНЕЦ КАК Цена,
	|	ТаблицаДанных.ЦенаНовая КАК ЦенаНовая,
	|	ТаблицаДанных.Акция КАК Акция,
	|	ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК Сумма,
	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество КАК СуммаНовая,
	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество - ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК СуммаПереоценки,
	|	ТаблицаДанных.КлючПорядка КАК КлючПорядка,
	|	ТаблицаДанных.ТорговаяМарка КАК ТорговаяМарка,
	|	ТаблицаДанных.Производитель КАК Производитель,
	|	ТабВыборАкцииЗавтра.АкцияНовая КАК СкидкаНаценка,
	|	ТабВыборАкцииЗавтра.АкцияНовая.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
	|	ТабВыборАкцииЗавтра.АкцияНовая.ТипСкидкиНаценки КАК ТипСкидкиНаценки,
	|	ТаблицаДанных.ТипПереоценки КАК ТипПереоценки
	|ИЗ
	|	(ВЫБРАТЬ
	|		Товары.Склад КАК Склад,
	|		Товары.Номенклатура КАК Номенклатура,
	|		Товары.Характеристика КАК Характеристика,
	|		Товары.Количество КАК Количество,
	|		ЕСТЬNULL(ЦеныПредыдущие.Цена, 0) / ЕСТЬNULL(ЦеныПредыдущие.Упаковка.Коэффициент, 1) КАК Цена,
	|		ЕСТЬNULL(ЦеныНовые.Цена, 0) / ЕСТЬNULL(ЦеныНовые.Упаковка.Коэффициент, 1) КАК ЦенаНовая,
	|		ЦеныНовые.Акция КАК Акция,
	|		Товары.КлючПорядка КАК КлючПорядка,
	|		ЕСТЬNULL(ТаблицаРеквизиты.Значение, ЗНАЧЕНИЕ(Справочник.Марки.ПустаяСсылка)) КАК ТорговаяМарка,
	|		Товары.Номенклатура.Производитель КАК Производитель,
	|		ЦеныНовые.ТипПереоценки КАК ТипПереоценки,
	|		ЕСТЬNULL(ОпорныеЦеныНоменклатуры.Цена, 0) / ЕСТЬNULL(ОпорныеЦеныНоменклатуры.Упаковка.Коэффициент, 1) КАК ЦенаОпорная
	|	ИЗ
	|		Товары КАК Товары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(
	|					&ДатаДокумента,
	|					ОбъектЦенообразования = &Магазин
	|						И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ЦеныПредыдущие
	|			ПО Товары.Номенклатура = ЦеныПредыдущие.Номенклатура
	|				И Товары.Характеристика = ЦеныПредыдущие.Характеристика
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|					КОНЕЦПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ),
	|					ВидЦены В
	|						(ВЫБРАТЬ ПЕРВЫЕ 1
	|							Товары.ВидЦен
	|						ИЗ
	|							Товары)) КАК ЦеныНовые
	|			ПО Товары.Номенклатура = ЦеныНовые.Номенклатура
	|				И Товары.Характеристика = ЦеныНовые.Характеристика
	|				И Товары.ВидЦен = ЦеныНовые.ВидЦены
	|				И (ЦеныНовые.Период >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ), ДЕНЬ, -1))
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ТаблицаРеквизиты
	|			ПО Товары.Номенклатура = ТаблицаРеквизиты.Ссылка
	|				И (ТаблицаРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ТорговыеМарки))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОпорныеЦеныНоменклатуры.СрезПоследних(, ) КАК ОпорныеЦеныНоменклатуры
	|			ПО Товары.Номенклатура = ОпорныеЦеныНоменклатуры.Номенклатура
	|				И Товары.Характеристика = ОпорныеЦеныНоменклатуры.Характеристика
	|				И Товары.Склад.Магазин = ОпорныеЦеныНоменклатуры.Магазин
	|	ГДЕ
	|		НЕ &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПереоценкаТоваровНаСкладах.РегламентнаяПереоценка)) КАК ТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабВыборАкцииЗавтра КАК ТабВыборАкцииЗавтра
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатаИзмененияУсловийСкидокНаценок КАК ДатаИзмененияУсловийСкидокНаценок
	|			ПО ТабВыборАкцииЗавтра.АкцияНовая = ДатаИзмененияУсловийСкидокНаценок.СкидкаНаценка
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатаИзмененияСегментов КАК ДатаИзмененияСегментов
	|			ПО ТабВыборАкцииЗавтра.Номенклатура = ДатаИзмененияСегментов.Номенклатура
	|		ПО ТаблицаДанных.Номенклатура = ТабВыборАкцииЗавтра.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабВыборАкции КАК ТабВыборАкции
	|		ПО ТаблицаДанных.Номенклатура = ТабВыборАкции.Номенклатура
	|ГДЕ
	|	ТаблицаДанных.Акция ЕСТЬ НЕ NULL 
	|	И (ТаблицаДанных.Цена <> ТаблицаДанных.ЦенаНовая
	|			ИЛИ ТабВыборАкции.Акция <> ТабВыборАкцииЗавтра.АкцияНовая
	|			ИЛИ ДатаИзмененияУсловийСкидокНаценок.Дата МЕЖДУ &НачалоДня И &КонецДня
	|			ИЛИ ДатаИзмененияСегментов.Дата МЕЖДУ &НачалоДня И &КонецДня
	|			ИЛИ ТаблицаДанных.Номенклатура.ДатаИзменения МЕЖДУ &НачалоДня И &КонецДня)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТорговаяМарка,
	|	Производитель,
	|	КлючПорядка"
	);
	Запрос.УстановитьПараметр("ДатаДокумента"  , Дата);
	Запрос.УстановитьПараметр("ДатаНовыхЦен"   , ДатаНовыхЦен);
	Запрос.УстановитьПараметр("ДатаОстатков"   ,
		?(ИспользоватьОстаткиТоваровНаДатуНовыхЦен = Истина, ДатаНовыхЦен, Дата));
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ВидОперации"    , Перечисления.ВидыОперацийПереоценкаТоваровНаСкладах.РегламентнаяПереоценка);
	Запрос.УстановитьПараметр("ТипАкциисложная"        , Перечисления.ТипСкидкиНаценки.СложнаяМеханика);
	Запрос.УстановитьПараметр("ТипАкцииКэшБэк"        , Перечисления.ТипСкидкиНаценки.КэшБэк);	
	Запрос.УстановитьПараметр("ТипАкцииОптовая"        , Перечисления.ТипСкидкиНаценки.Оптовая);
	Запрос.УстановитьПараметр("ТипАкцииНаПервуюПозицию"        , Перечисления.ТипСкидкиНаценки.НаПервуюПозицию);
	Запрос.УстановитьПараметр("КонецДня"        , КонецДня(Дата));
	Запрос.УстановитьПараметр("НачалоДня"        ,  НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДняЗавтра"        ,  КонецДня(Дата)+24*60*60);
	Запрос.УстановитьПараметр("НачалоДняЗавтра"        ,  НачалоДня(Дата)+24*60*60);
	Запрос.УстановитьПараметр("Магазин"        , Магазин);

	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры



//Процедура ЗаполнитьДанныеПереоценкиСоСкидками(ИспользоватьОстаткиТоваровНаДатуНовыхЦен)	Экспорт

////	Предыдущие цены принимаем на конец дня "вчера", текущие - "сегодня", а остатки - на конец "сегодня".

//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	ТоварыНаСкладах.Склад,
//	|	ТоварыНаСкладах.Склад.Магазин.ПравилоЦенообразования.ВидЦен КАК ВидЦен,
//	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
//	|	ТоварыНаСкладах.Характеристика КАК Характеристика,
//	|	ТоварыНаСкладах.КоличествоОстаток КАК Количество,
//	|	ТоварыНаСкладах.Номенклатура.Наименование КАК КлючПорядка
//	|ПОМЕСТИТЬ Товары
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
//	|			ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ДатаОстатков, ДЕНЬ), СЕКУНДА, 1),
//	|			Склад.Магазин = &Магазин
//	|				И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ТоварыНаСкладах
//	|ГДЕ
//	|	ТоварыНаСкладах.КоличествоОстаток > 0
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	ВидЦен,
//	|	Номенклатура,
//	|	Характеристика
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	АкцииЗавтра.Номенклатура,
//	|	МАКСИМУМ(АкцииЗавтра.СкидкаСложная) КАК СкидкаСложная,
//	|	МАКСИМУМ(АкцииЗавтра.СкидкаОптовая) КАК СкидкаОптовая,
//	|	МАКСИМУМ(АкцииЗавтра.СкидкаПервая) КАК СкидкаПервая
//	|ПОМЕСТИТЬ ТабАкцииЗавтра
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		НоменклатураСегмента.Номенклатура КАК Номенклатура,
//	|		ДействиеСкидокНаценок.СкидкаНаценка КАК СкидкаСложная,
//	|		0 КАК СкидкаОптовая,
//	|		0 КАК СкидкаПервая
//	|	ИЗ
//	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
//	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
//	|	ГДЕ
//	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкциисложная
//	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
//	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		НоменклатураСегмента.Номенклатура,
//	|		ДействиеСкидокНаценок.СкидкаНаценка
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		НоменклатураСегмента.Номенклатура,
//	|		0,
//	|		ДействиеСкидокНаценок.СкидкаНаценка,
//	|		0
//	|	ИЗ
//	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
//	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
//	|	ГДЕ
//	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииНаПервуюПозицию
//	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
//	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		НоменклатураСегмента.Номенклатура,
//	|		ДействиеСкидокНаценок.СкидкаНаценка
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		НоменклатураСегмента.Номенклатура,
//	|		0,
//	|		0,
//	|		ДействиеСкидокНаценок.СкидкаНаценка
//	|	ИЗ
//	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
//	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
//	|	ГДЕ
//	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииОптовая
//	|		И ДействиеСкидокНаценок.Период <= &КонецДняЗавтра
//	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДняЗавтра
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		НоменклатураСегмента.Номенклатура,
//	|		ДействиеСкидокНаценок.СкидкаНаценка) КАК АкцииЗавтра
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	АкцииЗавтра.Номенклатура
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	АкцииЗавтра.Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	АкцииЗавтра.Номенклатура,
//	|	МАКСИМУМ(АкцииЗавтра.СкидкаСложная) КАК СкидкаСложная,
//	|	МАКСИМУМ(АкцииЗавтра.СкидкаОптовая) КАК СкидкаОптовая,
//	|	МАКСИМУМ(АкцииЗавтра.СкидкаПервая) КАК СкидкаПервая
//	|ПОМЕСТИТЬ ТабАкции
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		НоменклатураСегмента.Номенклатура КАК Номенклатура,
//	|		ДействиеСкидокНаценок.СкидкаНаценка КАК СкидкаСложная,
//	|		0 КАК СкидкаОптовая,
//	|		0 КАК СкидкаПервая
//	|	ИЗ
//	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
//	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
//	|	ГДЕ
//	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкциисложная
//	|		И ДействиеСкидокНаценок.Период <= &КонецДня
//	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		НоменклатураСегмента.Номенклатура,
//	|		ДействиеСкидокНаценок.СкидкаНаценка
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		НоменклатураСегмента.Номенклатура,
//	|		0,
//	|		ДействиеСкидокНаценок.СкидкаНаценка,
//	|		0
//	|	ИЗ
//	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
//	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
//	|	ГДЕ
//	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииНаПервуюПозицию
//	|		И ДействиеСкидокНаценок.Период <= &КонецДня
//	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		НоменклатураСегмента.Номенклатура,
//	|		ДействиеСкидокНаценок.СкидкаНаценка
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ
//	|		НоменклатураСегмента.Номенклатура,
//	|		0,
//	|		0,
//	|		ДействиеСкидокНаценок.СкидкаНаценка
//	|	ИЗ
//	|		РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
//	|			ПО ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = НоменклатураСегмента.Сегмент
//	|	ГДЕ
//	|		ДействиеСкидокНаценок.СкидкаНаценка.ТипСкидкиНаценки = &ТипАкцииОптовая
//	|		И ДействиеСкидокНаценок.Период <= &КонецДня
//	|		И ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня
//	|	
//	|	СГРУППИРОВАТЬ ПО
//	|		НоменклатураСегмента.Номенклатура,
//	|		ДействиеСкидокНаценок.СкидкаНаценка) КАК АкцииЗавтра
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	АкцииЗавтра.Номенклатура
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	АкцииЗавтра.Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	ВЫБОР
//	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаПервая = 0
//	|			ТОГДА ТабАкцииЗавтра.СкидкаПервая
//	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаОптовая = 0
//	|			ТОГДА ТабАкцииЗавтра.СкидкаОптовая
//	|		КОГДА НЕ ТабАкцииЗавтра.СкидкаСложная = 0
//	|			ТОГДА ТабАкцииЗавтра.СкидкаСложная
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК АкцияНовая
//	|ПОМЕСТИТЬ ТабВыборАкцииЗавтра
//	|ИЗ
//	|	Товары КАК Товары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабАкцииЗавтра КАК ТабАкцииЗавтра
//	|		ПО Товары.Номенклатура = ТабАкцииЗавтра.Номенклатура
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	ВЫБОР
//	|		КОГДА НЕ ТабАкции.СкидкаПервая = 0
//	|			ТОГДА ТабАкции.СкидкаПервая
//	|		КОГДА НЕ ТабАкции.СкидкаОптовая = 0
//	|			ТОГДА ТабАкции.СкидкаОптовая
//	|		КОГДА НЕ ТабАкции.СкидкаСложная = 0
//	|			ТОГДА ТабАкции.СкидкаСложная
//	|		ИНАЧЕ 0
//	|	КОНЕЦ КАК Акция
//	|ПОМЕСТИТЬ ТабВыборАкции
//	|ИЗ
//	|	Товары КАК Товары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабАкции КАК ТабАкции
//	|		ПО Товары.Номенклатура = ТабАкции.Номенклатура
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаДанных.Склад,
//	|	ТаблицаДанных.Номенклатура,
//	|	ТаблицаДанных.Характеристика,
//	|	ТаблицаДанных.Количество,
//	|	ТаблицаДанных.Цена,
//	|	ТаблицаДанных.ЦенаНовая,
//	|	ТаблицаДанных.Акция,
//	|	ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК Сумма,
//	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество КАК СуммаНовая,
//	|	ТаблицаДанных.ЦенаНовая * ТаблицаДанных.Количество - ТаблицаДанных.Цена * ТаблицаДанных.Количество КАК СуммаПереоценки,
//	|	ТаблицаДанных.КлючПорядка КАК КлючПорядка,
//	|	ТаблицаДанных.ТорговаяМарка КАК ТорговаяМарка,
//	|	ТаблицаДанных.Производитель КАК Производитель,
//	|	ТабВыборАкцииЗавтра.АкцияНовая КАК СкидкаНаценка,
//	|	ТабВыборАкцииЗавтра.АкцияНовая.ЗначениеСкидкиНаценки КАК ЗначениеСкидкиНаценки,
//	|	ТабВыборАкцииЗавтра.АкцияНовая.ТипСкидкиНаценки КАК ТипСкидкиНаценки
//	|ИЗ
//	|	(ВЫБРАТЬ
//	|		Товары.Склад КАК Склад,
//	|		Товары.Номенклатура КАК Номенклатура,
//	|		Товары.Характеристика КАК Характеристика,
//	|		Товары.Количество КАК Количество,
//	|		ЕСТЬNULL(ЦеныПредыдущие.Цена, 0) / ЕСТЬNULL(ЦеныПредыдущие.Упаковка.Коэффициент, 1) КАК Цена,
//	|		ЕСТЬNULL(ЦеныНовые.Цена, 0) / ЕСТЬNULL(ЦеныНовые.Упаковка.Коэффициент, 1) КАК ЦенаНовая,
//	|		ЦеныНовые.Акция КАК Акция,
//	|		Товары.КлючПорядка КАК КлючПорядка,
//	|		ЕСТЬNULL(ТаблицаРеквизиты.Значение, ЗНАЧЕНИЕ(Справочник.Марки.ПустаяСсылка)) КАК ТорговаяМарка,
//	|		Товары.Номенклатура.Производитель КАК Производитель
//	|	ИЗ
//	|		Товары КАК Товары
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(
//	|					ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаДокумента, ДЕНЬ), СЕКУНДА, -1),
//	|					ОбъектЦенообразования = &Магазин
//	|						И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ЦеныПредыдущие
//	|			ПО Товары.Номенклатура = ЦеныПредыдущие.Номенклатура
//	|				И Товары.Характеристика = ЦеныПредыдущие.Характеристика
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(
//	|					&ДатаДокумента,
//	|					ОбъектЦенообразования = &Магазин
//	|						И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ЦеныНовые
//	|			ПО Товары.Номенклатура = ЦеныНовые.Номенклатура
//	|				И Товары.Характеристика = ЦеныНовые.Характеристика
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ТаблицаРеквизиты
//	|			ПО Товары.Номенклатура = ТаблицаРеквизиты.Ссылка
//	|				И (ТаблицаРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ТорговыеМарки))
//	|	
//	|	ОБЪЕДИНИТЬ
//	|	
//	|	ВЫБРАТЬ
//	|		Товары.Склад,
//	|		Товары.Номенклатура,
//	|		Товары.Характеристика,
//	|		Товары.Количество,
//	|		ЕСТЬNULL(ЦеныПредыдущие.Цена, 0) / ЕСТЬNULL(ЦеныПредыдущие.Упаковка.Коэффициент, 1),
//	|		ЕСТЬNULL(ЦеныНовые.Цена, 0) / ЕСТЬNULL(ЦеныНовые.Упаковка.Коэффициент, 1),
//	|		ЦеныНовые.Акция,
//	|		Товары.КлючПорядка,
//	|		ЕСТЬNULL(ТаблицаРеквизиты.Значение, ЗНАЧЕНИЕ(Справочник.Марки.ПустаяСсылка)),
//	|		Товары.Номенклатура.Производитель
//	|	ИЗ
//	|		Товары КАК Товары
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(
//	|					&ДатаДокумента,
//	|					ОбъектЦенообразования = &Магазин
//	|						И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры) КАК ЦеныПредыдущие
//	|			ПО Товары.Номенклатура = ЦеныПредыдущие.Номенклатура
//	|				И Товары.Характеристика = ЦеныПредыдущие.Характеристика
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
//	|					КОНЕЦПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ),
//	|					ВидЦены В
//	|						(ВЫБРАТЬ ПЕРВЫЕ 1
//	|							Товары.ВидЦен
//	|						ИЗ
//	|							Товары)) КАК ЦеныНовые
//	|			ПО Товары.Номенклатура = ЦеныНовые.Номенклатура
//	|				И Товары.Характеристика = ЦеныНовые.Характеристика
//	|				И Товары.ВидЦен = ЦеныНовые.ВидЦены
//	|				И (ЦеныНовые.Период >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаНовыхЦен, ДЕНЬ), ДЕНЬ, -1))
//	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ТаблицаРеквизиты
//	|			ПО Товары.Номенклатура = ТаблицаРеквизиты.Ссылка
//	|				И (ТаблицаРеквизиты.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ТорговыеМарки))
//	|	ГДЕ
//	|		НЕ &ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПереоценкаТоваровНаСкладах.РегламентнаяПереоценка)) КАК ТаблицаДанных
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабВыборАкцииЗавтра КАК ТабВыборАкцииЗавтра
//	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатаИзмененияУсловийСкидокНаценок КАК ДатаИзмененияУсловийСкидокНаценок
//	|			ПО ТабВыборАкцииЗавтра.АкцияНовая = ДатаИзмененияУсловийСкидокНаценок.СкидкаНаценка
//	|		ПО ТаблицаДанных.Номенклатура = ТабВыборАкцииЗавтра.Номенклатура
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабВыборАкции КАК ТабВыборАкции
//	|		ПО ТаблицаДанных.Номенклатура = ТабВыборАкции.Номенклатура
//	|ГДЕ
//	|	ТаблицаДанных.Акция ЕСТЬ НЕ NULL 
//	|	И (ТаблицаДанных.Цена <> ТаблицаДанных.ЦенаНовая
//	|			ИЛИ ТабВыборАкции.Акция <> ТабВыборАкцииЗавтра.АкцияНовая
//	|			ИЛИ ТабВыборАкции.Акция.ЗначениеСкидкиНаценки <> ТабВыборАкцииЗавтра.АкцияНовая.ЗначениеСкидкиНаценки
//	|			ИЛИ ДатаИзмененияУсловийСкидокНаценок.Дата МЕЖДУ &НачалоДня И &КонецДня)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	ТорговаяМарка,
//	|	Производитель,
//	|	КлючПорядка"
//	);
//	Запрос.УстановитьПараметр("ДатаДокумента"  , Дата);
//	Запрос.УстановитьПараметр("ДатаНовыхЦен"   , ДатаНовыхЦен);
//	Запрос.УстановитьПараметр("ДатаОстатков"   ,
//		?(ИспользоватьОстаткиТоваровНаДатуНовыхЦен = Истина, ДатаНовыхЦен, Дата));
//	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
//	Запрос.УстановитьПараметр("ВидОперации"    , ВидОперации);
//	Запрос.УстановитьПараметр("ТипАкциисложная"        , Перечисления.ТипСкидкиНаценки.СложнаяМеханика);
//	Запрос.УстановитьПараметр("ТипАкцииОптовая"        , Перечисления.ТипСкидкиНаценки.Оптовая);
//	Запрос.УстановитьПараметр("ТипАкцииНаПервуюПозицию"        , Перечисления.ТипСкидкиНаценки.НаПервуюПозицию);
//	Запрос.УстановитьПараметр("КонецДня"        , КонецДня(Дата));
//	Запрос.УстановитьПараметр("НачалоДня"        ,  НачалоДня(Дата));
//	Запрос.УстановитьПараметр("КонецДняЗавтра"        ,  КонецДня(Дата)+24*60*60);
//	Запрос.УстановитьПараметр("НачалоДняЗавтра"        ,  НачалоДня(Дата)+24*60*60);
//	Запрос.УстановитьПараметр("Магазин"        , Магазин);

//	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

//КонецПроцедуры



#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ИсключительныйРежимВключен"
		, ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() ИЛИ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "ИзменениеСтатусаРаботыСТерминалом", Ложь) = Истина);
//	LNK 16.02.2017 14:33:05 - здесь ИсключительныйРежим будет отлючен для бесправного пользователя
	ЗаполнениеОбъектовСобытия.ОбщиеДействияПередЗаписью(ЭтотОбъект, Отказ);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
	
	Если ОбменДанными.Загрузка Тогда

		Возврат;
		
	КонецЕсли;

	СуммаДокумента = Товары.Итог("СуммаПереоценки");
	
//	LNK 20.09.2016 09:50:56
//	NAV:БлокировкаДанныхУчестьДокументВNavision
	Если НЕ ДополнительныеСвойства.ИсключительныйРежимВключен И НЕ ЭтоНовый() Тогда

		Если ВнешниеИсточникиСобытия.ПередачаNavision(Ссылка) Тогда

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ «" + СокрЛП(Ссылка) + "» учтён в КСУ Navision! Изменения запрещены. Отказано.", Ссылка,,, Отказ);
			Возврат;

		КонецЕсли;

	КонецЕсли;

	Если ВидОперации = Перечисления.ВидыОперацийПереоценкаТоваровНаСкладах.РегламентнаяПереоценка Тогда

		ДатаНовыхЦен = Дата;

	КонецЕсли;

	Если Ответственный.Пустая() Тогда

		Ответственный = Пользователи.ТекущийПользователь();

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда

		Возврат;
		
	КонецЕсли;

	ВведенВЭксплуатацию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "ВведенВЭксплуатацию");

//	NAV:БлокировкаДанныхУчестьДокументВNavision
	Если ВведенВЭксплуатацию = Истина И ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "РегистрацияПередачиВNavision", Ложь) Тогда

		ВнешниеИсточникиСобытия.УстановитьПереданоNavision(Ссылка, ОбщегоНазначенияРТСервер.ПолучитьМагазиныПоОбъекту(Ссылка),,,,, Истина);

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);

	КонецЕсли;

	ИнициализироватьДокумент();

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)


КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)


КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

///////////////////////////////////////////////////////////////////////////////
// Инициализация и заполнение

// Инициализирует применение цен номенклатуры.
//
Процедура ИнициализироватьДокумент()

	Ответственный = Пользователи.ТекущийПользователь();
	ДатаНовыхЦен = ?(Дата = '00010101', Дата, КонецДня(Дата) + 1);

	Если Магазин.Пустая() Тогда

		Магазин = ЗначениеНастроекПовтИсп.ПолучитьМагазинПоУмолчанию(Магазин);	

	КонецЕсли;

	Если ВидНоменклатуры.Пустая() Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыНоменклатуры.Ссылка КАК ВидНоменклатуры,
		|	ВидыНоменклатуры.НомерПроекта КАК НомерПроекта
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПереоценкаТоваровНаСкладах КАК ТаблицаПереоценки
		|		ПО ВидыНоменклатуры.Ссылка = ТаблицаПереоценки.ВидНоменклатуры
		|			И (НЕ ТаблицаПереоценки.ПометкаУдаления)
		|			И (ТаблицаПереоценки.Магазин = &Магазин)
		|			И (ТаблицаПереоценки.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ))
		|ГДЕ
		|	ТаблицаПереоценки.Ссылка ЕСТЬ NULL 
		|	И НЕ ВидыНоменклатуры.НомерПроекта = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПроекта"
		);
		Запрос.УстановитьПараметр("Магазин"    , Магазин);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда

			ВидНоменклатуры = Выборка.ВидНоменклатуры;

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти




