
#Область ПрограммныйИнтерфейс

// Преобразовать картинку.
// 
// Параметры:
//  ДвоичныеДанные - ДвоичныеДанные - Двоичные данные исходной картинки
//  ФорматИсточника - Строка - Формат картинки источника
//  ФорматПриемника - Строка - Формат картинки приемника
// 
// Возвращаемое значение:
//  Структура:
//   * Ошибка - Булево - Если ошибка, то ИСТИНА
//   * ТекстОшибки - Строка - Текст ошибки
//   * ДанныеКартинки - ДвоичныеДанные, Неопределено - Данные картинки. Если ошибка, то НЕОПРЕДЕЛЕНО
Функция ПреобразоватьКартинку(ДвоичныеДанные, ФорматИсточника, ФорматПриемника) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ДанныеКартинки", Неопределено);
	
	Инфо = Новый СистемнаяИнформация;
	Если Инфо.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		ИмяМакета = "КонвертацияКартинокLinux64";
	ИначеЕсли Инфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		ИмяМакета = "КонвертацияКартинокWindows64";
	Иначе

		Результат.Ошибка = Истина;
		Результат.ТекстОшибки = "Тип платформы не поддерживается";

	КонецЕсли;		
	
	Если Не ПодключитьВнешнююКомпоненту("ОбщийМакет." + ИмяМакета
			, "MedIgor"
			, ТипВнешнейКомпоненты.Native
			,  ТипПодключенияВнешнейКомпоненты.НеИзолированно) Тогда

		Результат.Ошибка = Истина;
		Результат.ТекстОшибки = "Не удалось подключить внешнюю компоненту";

	КонецЕсли; 
	
	Converter = Новый ("Addin.MedIgor.ImageConverter");
	
	Попытка
		Результат.ДанныеКартинки = Converter.ConvertBuffer(ДвоичныеДанные, ФорматИсточника, ФорматПриемника);
	Исключение

		Результат.Ошибка = Истина;
		Результат.ТекстОшибки = Converter.LastError;

	КонецПопытки;
	
	Возврат Результат; 
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
