&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	МассивНепроведенныхДокументов = ФормированиеПечатныхФормСервер.ПолучитьМассивНепроведенныхДокументов(ПараметрКоманды);

	Если МассивНепроведенныхДокументов.Количество() > 0 Тогда

		Если МассивНепроведенныхДокументов.Количество() = 1 Тогда

				ТекстВопроса = "Друк можливий лише після проведення документа, провести документ?";

		Иначе	ТекстВопроса = "Друк можливий лише після проведення документів, провести документи?";

		КонецЕсли;

		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);

		Если Ответ = КодВозвратаДиалога.Да Тогда

			МассивНепроведенныхДокументов = ФормированиеПечатныхФормСервер.ПровестиДокументы(МассивНепроведенныхДокументов);

		КонецЕсли;

	КонецЕсли;

	Если МассивНепроведенныхДокументов.Количество() = 0 Тогда

		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.ЧекККМ"
			, "ТоварныйЧекДляПД"
			, ПараметрКоманды
			, ПараметрыВыполненияКоманды.Источник
			, Неопределено
		);

	КонецЕсли;

КонецПроцедуры
