
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ДекорацияСертификатНедействителен.Заголовок = "";

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ввести(Команда)
	
	Если ПустаяСтрока(КодСертификата) Тогда
		Закрыть();
	Иначе
		
		СостояниеСерийногоНомера = ПодарочныеСертификатыСервер.ПолучитьСоставСерийногоНомера(СокрЛП(КодСертификата));
		
		Если СостояниеСерийногоНомера.Найден Тогда
			
			ДанныеПоСертификату = ПодарочныеСертификатыСервер.ПолучитьСостояниеПодарочногоСертификатаКод(СостояниеСерийногоНомера.КодСерийногоНомера, Ложь);
			
			Если Не ДанныеПоСертификату.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияСерийныхНомеров.Активен") Тогда
				
				Элементы.ДекорацияСертификатНедействителен.Заголовок = СтрШаблон(
						НСтр("ru = 'Сертификат %1 не активет. Статус %2';uk = 'Сертифікат %1 не активний. Статус %2'")
						, ДанныеПоСертификату.КодСерийногоНомера
						, Строка(ДанныеПоСертификату.Состояние));
						
			ИначеЕсли НачалоДня(ДанныеПоСертификату.ДатаОкончанияДействия) <= НачалоДня(ТекущаяДата()) Тогда
				
				Элементы.ДекорацияСертификатНедействителен.Заголовок = СтрШаблон(
						НСтр("ru = 'Срок сертификата истек %1';uk = 'Строк сертифіката закінчився %1'")
						, ДанныеПоСертификату.ДатаОкончанияДействия);

			Иначе
				
				Закрыть(ДанныеПоСертификату);
				
			КонецЕсли;

		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
