#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Проведение

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период
	|ИЗ
	|	Документ.ВводОстатковПоНакопительнымСкидкам КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Остатки.Номенклатура КАК Номенклатура,
	|	Остатки.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	Остатки.ДисконтнаяКарта.ВладелецКарты КАК ВладелецДисконтнойКарты,
	|	Остатки.Характеристика КАК Характеристика,
	|	Остатки.Сумма КАК Сумма,
	|	Остатки.Количество КАК Количество,
	|	&Период КАК Период
	|ИЗ
	|	Документ.ВводОстатковПоНакопительнымСкидкам.Остатки КАК Остатки
	|ГДЕ
	|	Остатки.Ссылка = &Ссылка"
	;
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Результат = Запрос.ВыполнитьПакет();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаПродажиПоДисконтнымКартам", Результат[0].Выгрузить());
	
КонецПроцедуры

#КонецЕсли
