
&НаСервере
Процедура КомандаЗагрузитьНаСервере()
	ТекДата = Период.ДатаНачала;
	Пока ТекДата <= Период.ДатаОкончания Цикл
		ОбменДаннымиСервисТревог.ОбновитьКартуТревогV2(ТекДата);
		ТекДата = ТекДата + 86400;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	Если Период.ДатаНачала < Дата("20260101") Тогда
		ПоказатьОповещениеПользователя("Можно загружать данные не раньше 2026 года!");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ПоказатьОповещениеПользователя("Не выбрана дата окончания!");
		Возврат;
	КонецЕсли;
	
	КомандаЗагрузитьНаСервере(); 

	ПоказатьОповещениеПользователя("Загрузка завершена!");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		Период.ДатаНачала = ТекущаяДата() - 86400;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.ДатаОкончания = ТекущаяДата() - 86400;	
	КонецЕсли;
		
КонецПроцедуры
