Процедура ПередЗаписью(Отказ, Замещение)	//	LNK 14.01.2021 10:51:17

	Если НЕ (ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() ИЛИ ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ВидУзла = Перечисления.ВидыУзлов.ТестовыйУзел) Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ОбменДанными.Загрузка Тогда

		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

			ЗаписьНабора.ДатаИзменения = ТекущаяДатаСеанса();

		КонецЦикла;

	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ОтключитьУправлениеПоследовательностью") Тогда

		Возврат;	//	LNK 06.10.2021 11:38:06

	КонецЕсли;

	Если НЕ ДополнительныеСвойства.Свойство("УправлениеПоследовательностьюБонусныеБаллы") Тогда

		БонусныеБаллыПоследовательность.ПодготовитьДополнительныеСвойства(ДополнительныеСвойства);

	КонецЕсли;

	БлокироватьДляИзменения = Истина;

	РегистрыНакопления.БонусныеБаллы.ИнициализироватьДанныеВлиянияНаПоследовательность(ЭтотОбъект, "ПередЗаписью");

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если НЕ (ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() ИЛИ ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ВидУзла = Перечисления.ВидыУзлов.ТестовыйУзел) Тогда

		Возврат;

	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ОтключитьУправлениеПоследовательностью") Тогда

		Возврат;	//	LNK 06.10.2021 11:38:06

	КонецЕсли;

	РегистрыНакопления.БонусныеБаллы.ИнициализироватьДанныеВлиянияНаПоследовательность(ЭтотОбъект, "ПриЗаписи");

	БонусныеБаллыПоследовательность.УправлениеПоследовательностью(ЭтотОбъект, Отказ);

КонецПроцедуры


















