#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте	//	LNK 30.06.2024 09:40:29
Процедура КомандаВедомостьБонусныхНакоплений(Команда)

	ОткрытьОтчёт("ВедомостьБонусныхНакоплений", "ВедомостьБонусныхНакопленийДокументНачисления", Элементы.Список.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте	//	LNK 30.06.2024 11:23:16
Процедура КомандаАнализБонусныхНакоплений(Команда)

	ОткрытьОтчёт("АнализБонусныхНакоплений", "АнализБонусныеБаллы", Элементы.Список.ТекущиеДанные);

КонецПроцедуры
	
#КонецОбласти

#Область ПоддержкаФункционалаФормы

&НаКлиенте	//	LNK 01.07.2024 07:38:21
Процедура ОткрытьОтчёт(ИмяОтчёта, КлючВарианта, ТекущиеДанные)

	Если НЕ ТекущиеДанные = Неопределено Тогда

		Отбор = Новый Структура("Контрагент", ТекущиеДанные.Контрагент);

		ПараметрыНастроек = Новый Структура(
			"Период"
			, Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод)
		);
		ПараметрыНастроек.Период.ДатаОкончания = ТекущиеДанные.ДатаАннуляции;

		ПараметрыФормы = Новый Структура(
			"КлючВарианта, Отбор, СформироватьПриОткрытии, ПользовательскиеНастройки"
			, КлючВарианта
			, Отбор
			, Истина
			, ВариантыОтчетовВызовСервера.ПолучитьПользовательскиеНастройки(ИмяОтчёта, ПараметрыНастроек)
		);

		ОткрытьФорму("Отчет." + ИмяОтчёта + ".Форма"
			, ПараметрыФормы
			, ЭтотОбъект
			, ЭтотОбъект
		);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти














