Перем ОписаниеТиповОбъектовКОтправкеНазад;
Перем ОписаниеТиповПеремещениеТоваров;

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДаннымиПовтИсп.ЭтоПредопределенныйУзелПланаОбмена(Ссылка)
		ИЛИ ОбменДаннымиПовтИсп.ГлавныйУзел("ПоМагазину") = Ссылка Тогда
				
		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("РежимВыгрузкиИнформативныхОстатков");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачалаВыгрузкиДокументов");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);

	КонецЕсли;

	Если ВидУзла = Перечисления.ВидыУзлов.Магазин Тогда

		ПроверяемыеРеквизиты.Добавить("Магазин");

	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	Если ОбменДаннымиСервер.НадоВыполнитьОбработчикПослеЗагрузкиДанных(ЭтотОбъект, Ссылка) Тогда
		ПослеЗагрузкиДанных(Отказ);		
	КонецЕсли;      
				
КонецПроцедуры

//	LNK 20.04.2017 12:56:58
Процедура ПриЗаписи(Отказ)

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() И НЕ ДополнительныеСвойства.ЭтоНовый Тогда

		Если ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "ИнтерактивнаяЗапись", Ложь) = Истина Тогда

			Справочники.СтруктураУзлов.УстановитьМагазины(ОбменДаннымиПовтИсп.ПолучитьТекущийЭлементСтруктурыУзлов(Ссылка), Магазины.ВыгрузитьКолонку("Магазин"));

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПослеЗагрузкиДанных(Отказ)
	
		
КонецПроцедуры

Процедура ПриОтправкеДанныхУзлаПодчиненному(ЭлементДанных, Игнорировать)
	
	Игнорировать = Истина;
	
КонецПроцедуры // ПриОтправкеДанныхУзлаПодчиненному()

ОписаниеТиповОбъектовКОтправкеНазад = Новый ОписаниеТипов("РегистрНакопленияНаборЗаписей.ТоварыОрганизаций");
ОписаниеТиповПеремещениеТоваров     = Новый ОписаниеТипов("ДокументОбъект.ПеремещениеТоваров, ДокументСсылка.ПеремещениеТоваров");
