
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	КлючВарианта = "ОстаткиНаСкладах";
	Отбор		 = Новый Структура("Номенклатура", ПараметрКоманды);

	ПараметрыНастроек = Новый Структура(
		"Период"
		, Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя)
	);

	ПараметрыФормы = Новый Структура(
		"КлючВарианта, Отбор, СформироватьПриОткрытии, ПользовательскиеНастройки"
		, КлючВарианта
		, Отбор
		, Истина
		, ВариантыОтчетовВызовСервера.ПолучитьПользовательскиеНастройки("ВедомостьПоТоварамНаСкладах", ПараметрыНастроек)
	);

	ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма"
		, ПараметрыФормы
		, ПараметрыВыполненияКоманды.Источник
		, ПараметрыВыполненияКоманды.Уникальность
		, ПараметрыВыполненияКоманды.Окно
		, ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);

КонецПроцедуры
