
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ЗаписанЗапросДоступностиТоваров" Тогда

		Элементы.Список.Обновить();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;

	Если НЕ ТекущиеДанные = Неопределено Тогда

			ДокументСсылка = ТекущиеДанные.Ссылка;

	Иначе	ДокументСсылка = Неопределено;

	КонецЕсли;

	ЗаказыПокупателейКлиент.ОформитьКнопкуИзменениеСтатусаДокумента(ДокументСсылка, ЭтотОбъект, "ФормаСписка");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЯвляетсяСуперВайзером = Ложь;
	СотрудникКоллЦентраСтруктура = ЗаказыПокупателейСервер.ЯвляетсяСотрудникомКоллЦентра(ПараметрыСеанса.ТекущийПользователь);
	СотрудникКоллЦентра = СотрудникКоллЦентраСтруктура.СотрудникКоллЦентра;
	ВыбранТекущийПользовательОтветственным = СотрудникКоллЦентраСтруктура.ВыбранТекущийПользовательОтветственным;
	
	Если СотрудникКоллЦентра.Пустая() Тогда 
		Элементы.ОтборОтветственный.ТолькоПросмотр = Ложь;
	Иначе 
		Если СотрудникКоллЦентра.РольСотрудника = Перечисления.РолиСотрудниковКоллЦентра.СуперВайзер Тогда 
			Элементы.ОтборОтветственный.ТолькоПросмотр = Ложь;
			ЯвляетсяСуперВайзером = Истина; 
		Иначе
			Элементы.ОтборОтветственный.ТолькоПросмотр = Истина;
		КонецЕсли;
		Ответственный = СотрудникКоллЦентра.Владелец;
	КонецЕсли;

	УстановитьОтборДинамическихСписков();

КонецПроцедуры 

///////////////////////////////////////////////////////////////////////////////
// Прочее

// Функция возвращает массив динамических списков, для которых требуется установка отбора.
//
&НаСервере
Функция ПолучитьМассивДинамическихСписковНаСервере()

	МассивСписков = Новый Массив;
	МассивСписков.Добавить(Список);
	
	Возврат МассивСписков;

КонецФункции

// Процедура устанавливает отбор динамических списков формы.
//
&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	Для Каждого ДинамическийСписок Из ПолучитьМассивДинамическихСписковНаСервере() Цикл
		
		//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок, "Магазин"      , Магазин                  , ЗначениеЗаполнено(Магазин)                  , ВидСравненияКомпоновкиДанных.Равно);
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок, "Ответственный", Ответственный            , ЗначениеЗаполнено(Ответственный)            , ВидСравненияКомпоновкиДанных.Равно);
		//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок, "Состояние"    , СостояниеЗаказаПокупателя, ЗначениеЗаполнено(СостояниеЗаказаПокупателя), ВидСравненияКомпоновкиДанных.Равно);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйПриИзменении(Элемент)
	
	СотрудникКоллЦентраСтруктура = ЗаказыПокупателейСервер.ЯвляетсяСотрудникомКоллЦентра(Ответственный);
	СотрудникКоллЦентра = СотрудникКоллЦентраСтруктура.СотрудникКоллЦентра;
	ВыбранТекущийПользовательОтветственным = СотрудникКоллЦентраСтруктура.ВыбранТекущийПользовательОтветственным;
	
	УстановитьОтборДинамическихСписков();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЯвляетсяСуперВайзером Тогда 
		
		Возврат;
		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ЗаказыПокупателейСервер.ВыборСотрудникаКЦ(ДанныеВыбора, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Ответственный = ВыбранноеЗначение;
КонецПроцедуры

