//	LNK 03.12.2019 09:33:16
Функция ПолучитьДанныеУзла(УзелИнформационнойБазы)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	""ОбменMicrosoftDynamics"" КАК Имя,
	|	ТаблицаУзлов.Ссылка КАК Узел,
	|	ТаблицаУзлов.Код КАК Код,
	|	ТаблицаУзлов.Наименование КАК Наименование,
	|	ТаблицаУзлов.ПометкаУдаления КАК ПометкаУдаления,
	|	ТаблицаУзлов.НомерОтправленного КАК НомерОтправленного,
	|	ТаблицаУзлов.НомерПринятого КАК НомерПринятого,
	|	ТаблицаУзлов.Магазин КАК Магазин,
	|	ТаблицаУзлов.ПорядокОбратный КАК ПорядокОбратный,
	|	ТаблицаУзлов.РегистрироватьИзменения КАК РегистрироватьИзменения,
	|	ТаблицаУзлов.ТипРегистрации КАК ТипРегистрации,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураУзлов.MSDyn_CRM) КАК ЭлементСтруктуры
	|ИЗ
	|	ПланОбмена.ОбменMicrosoftDynamics КАК ТаблицаУзлов
	|ГДЕ
	|	ТаблицаУзлов.Ссылка = &ТекущийУзел"
	);
	Запрос.УстановитьПараметр("ТекущийУзел", УзелИнформационнойБазы);

	Результат = Запрос.Выполнить();

	ДанныеУзла = Новый Структура;

	Для каждого Колонка Из Результат.Колонки Цикл

		ДанныеУзла.Вставить(Колонка.Имя, Колонка.ТипЗначения.ПривестиЗначение());

	КонецЦикла;

	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда

		ЗаполнитьЗначенияСвойств(ДанныеУзла, Выборка);

		Для каждого Колонка Из Результат.Колонки Цикл

			Если Колонка.ТипЗначения.СодержитТип(Тип("РезультатЗапроса")) Тогда

				ДанныеУзла[Колонка.Имя] = Выборка[Колонка.Имя].Выгрузить();

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
	Возврат ДанныеУзла;

КонецФункции

//	LNK 08.06.2022 08:40:22
Функция ПрименитьОбъектПриКоллизииИзменений(УзелИнформационнойБазы, Объект)	Экспорт

	Возврат Истина;

КонецФункции
