
Функция ПолучитьданныеПоПродажам(ДатаС, ДатаПо, НомерМагазина ,ИмяМакета) Экспорт
	//Если ИмяМакета = "РеестрНН_Возвраты" тогда
	//	СхемаКомпоновки = ПолучитьОбщийМакет("РеестрНН_Возвраты");
	//Иначе
	//	СхемаКомпоновки = ПолучитьОбщийМакет("РеестрНН_Продажи");
	//КонецЕсли;		
	СхемаКомпоновки = ПолучитьОбщийМакет(ИмяМакета);
	
	Настройки = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаС",НачалоДня(ДатаС));   
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаПо",КонецДня(ДатаПо));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерМагазина",НомерМагазина);
	  
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновки,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,истина);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Возврат ТаблицаЗначений;
	
КонецФункции



Функция ПолучитьданныеПоВозвратамВсеМагазины(ДатаС, ДатаПо, ИмяМакета) Экспорт
	СхемаКомпоновки = ПолучитьОбщийМакет(ИмяМакета);
	Настройки = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаС",НачалоДня(ДатаС));   
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаПо",КонецДня(ДатаПо));
	  
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновки,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,истина);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Возврат ТаблицаЗначений;
	
КонецФункции



Функция ПолучитьданныеПоРеализациям(ДатаС, ДатаПо, КодПоЕДРПОУ ,ИмяМакета) Экспорт
	//Если ИмяМакета = "РеестрНН_Возвраты" тогда
	//	СхемаКомпоновки = ПолучитьОбщийМакет("РеестрНН_Возвраты");
	//Иначе
	//	СхемаКомпоновки = ПолучитьОбщийМакет("РеестрНН_Продажи");
	//КонецЕсли;		
	СхемаКомпоновки = ПолучитьОбщийМакет(ИмяМакета);
	
	Настройки = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаС",НачалоДня(ДатаС));   
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаПо",КонецДня(ДатаПо));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КодПоЕДРПОУ",КодПоЕДРПОУ);
	  
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновки,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,истина);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Возврат ТаблицаЗначений;
	
КонецФункции

