#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламныйМатериал КАК РекламныйМатериал,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламнаяПлоскость КАК РекламнаяПлоскость,
	|	СУММА(РаспоряжениеНаПриемкуРекламныеМатериалы.Количество) КАК Количество,
	|	СУММА(РаспоряжениеНаПриемкуРекламныеМатериалы.Сумма) КАК Сумма,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Цена КАК Цена,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Магазин КАК Магазин,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Организация КАК Организация,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.ДатаС КАК ДатаС,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.ДатаПо КАК ДатаПо,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка КАК РаспоряжениеНаПриемку
	|ИЗ
	|	Документ.РаспоряжениеНаПриемку.РекламныеМатериалы КАК РаспоряжениеНаПриемкуРекламныеМатериалы
	|ГДЕ
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламнаяПлоскость,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламныйМатериал,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Организация,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Магазин,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Цена,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.ДатаС,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.ДатаПо,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламныйМатериал КАК РекламныйМатериал,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламнаяПлоскость КАК РекламнаяПлоскость,
	|	СУММА(РаспоряжениеНаПриемкуРекламныеМатериалы.Количество) КАК Количество,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Магазин КАК Магазин,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка КАК ДокументРаспоряжение,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.РаспоряжениеНаПриемку.РекламныеМатериалы КАК РаспоряжениеНаПриемкуРекламныеМатериалы
	|ГДЕ
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка = &ДокументСсылка
	|	И РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.НеТребуетПриемки = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламнаяПлоскость,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Магазин,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Организация,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.РекламныйМатериал,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка,
	|	РаспоряжениеНаПриемкуРекламныеМатериалы.Ссылка.Дата"
	);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Результаты = Запрос.ВыполнитьПакет();

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРекламныеМатериалы", Результаты[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаРекламныеМатериалыКПриемке", Результаты[1].Выгрузить());

КонецПроцедуры

#КонецОбласти

#КонецЕсли



