
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОбщегоНазначенияРТСервер.ВывестиДатуФормированияОтчета(ДокументРезультат);
	
	Если ЗначениеЗаполнено(ГруппаПолучателейСкидки) Тогда
		Параметр = НастройкаПараметра("ГруппаПолучателейСкидки");
		Если Параметр <> Неопределено Тогда
			Параметр.Значение = ГруппаПолучателейСкидки;
			Параметр.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ

Функция НастройкаПараметра(ИмяПараметра)

	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если ПараметрДанных <> Неопределено Тогда
		ПараметрПользовательскойНастройки =
			КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
				ПараметрДанных.ИдентификаторПользовательскойНастройки
			);
		Если ПараметрПользовательскойНастройки <> Неопределено Тогда
			Возврат ПараметрПользовательскойНастройки;
		Иначе
			Возврат ПараметрДанных;
		КонецЕсли;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

