&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКарт.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресКартВХранилище));
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора());
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСтруктуруВыбора()
	
	ТекущиеДанные = Элементы.ТаблицаКарт.ТекущиеДанные;
	СтруктураВыбора = Новый Структура;
	Если ТекущиеДанные <> Неопределено Тогда
		СтруктураВыбора.Вставить("ИнформационнаяКарта", ТекущиеДанные.ИнформационнаяКарта);
		СтруктураВыбора.Вставить("ВладелецКарты", ТекущиеДанные.ВладелецКарты);
	Иначе
		СтруктураВыбора.Вставить("ИнформационнаяКарта", ПредопределенноеЗначение("Справочник.ИнформационныеКарты.ПустаяСсылка"));
		СтруктураВыбора.Вставить("ВладелецКарты", Неопределено);		
	КонецЕсли;
	
	Возврат СтруктураВыбора;
	
КонецФункции	

&НаКлиенте
Процедура ТаблицаКартВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(ПодготовитьСтруктуруВыбора());
	
КонецПроцедуры

