#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТолькоПросмотр = ТолькоПросмотр();
	
	Если Параметры.Отбор.Свойство("СчетНаОплатуПокупателю") Тогда
		ОснованиеЗаявки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Параметры.Отбор.СчетНаОплатуПокупателю,"ОснованиеЗаявки"); 
		Если ОснованиеЗаявки = Документы.СчетНаОплатуПокупателю.ПустаяСсылка() Тогда
			Список.Параметры.УстановитьЗначениеПараметра("СчетНаОплатуПокупателю",Параметры.Отбор.СчетНаОплатуПокупателю);
		Иначе 
			Список.Параметры.УстановитьЗначениеПараметра("СчетНаОплатуПокупателю",ОснованиеЗаявки);
		КонецЕсли;
	КонецЕсли;
	
			


КонецПроцедуры

&НаКлиенте	//	LNK 12.10.2020 10:44:11
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеСпискаСчетНаОплатуПокупателю" Тогда

		Элементы.Список.Обновить();

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)

	Если ТолькоПросмотр() ИЛИ НЕ ТехническаяПоддержкаВызовСервера.ВыполняютсяСлужебныеДействия() Тогда

		Отказ = Истина;
		ПоказатьОповещениеПользователя("Отказано!",, "Удаление записей регистра запрещено", БиблиотекаКартинок.Ошибка32);

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТолькоПросмотр()

	Возврат НЕ (РольДоступна(Метаданные.Роли.АдминистраторСистемы) И ТехническаяПоддержкаВызовСервера.ИсключительныйРежим());

КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Список.Отбор.Элементы.Очистить()
КонецПроцедуры
