///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СтрокаНомера = Параметр[0];
	//ПриЗакрытии();
	//ВладелецШтрихкода = СтрокаНомераПриИзмененииНаСервере(СтрокаНомера);
	//Если ЗначениеЗаполнено(ВладелецШтрихкода) Тогда
	//	
	//	Закрыть(ВладелецШтрихкода);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если ЗначениеЗаполнено(СтрокаНомера) Тогда
	ВладелецШтрихкода = СтрокаНомераПриИзмененииНаСервере(СтрокаНомера);
	
	//Если ЗначениеЗаполнено(ВладелецШтрихкода) Тогда
	//	
	//	Закрыть(ВладелецШтрихкода);
	//КонецЕсли;
	
		Если ЗначениеЗаполнено(ВладелецШтрихкода) Тогда
			Закрыть(ВладелецШтрихкода);
		Иначе
			ПоказатьПредупреждение(, "Продавец не найден!",1);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, "Штрихкод не заполнен!",1);
	КонецЕсли;
КонецПроцедуры



///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаOK(Команда)
	
	Штрихкод = ЭтотОбъект.СтрокаНомера ;
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		ВладелецШтрихкода = СтрокаНомераПриИзмененииНаСервере(Штрихкод);
		Если ЗначениеЗаполнено(ВладелецШтрихкода) Тогда
			Закрыть(ВладелецШтрихкода);
		Иначе
			ПоказатьПредупреждение(, "Продавец не найден!",1);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(, "Штрихкод не заполнен!",1);
	КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция	СтрокаНомераПриИзмененииНаСервере(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Штрихкоды.Владелец
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод",Штрихкод);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		 Владелец = Выборка.Владелец;
	КонецЦикла;
	
	Возврат Владелец.ВладелецКарты;
	
КонецФункции



