//	LNK 21.04.2017 11:37:39
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Отказ = Истина;

	Иначе

		Организация = ПараметрыСеанса.ТекущаяОрганизация;

		Если РольДоступна(Метаданные.Роли.АдминистраторСистемы) Тогда

		//	У всех других ролей должен работать RLS... а тут просто отбор - для удобства.
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ссылка", Новый Массив(ПараметрыСеанса.ОрганизацииУзла), Истина, ВидСравненияКомпоновкиДанных.ВСписке);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

//	LNK 21.04.2017 11:37:44
&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

//	LNK 21.04.2017 11:41:28
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Перем ПараметрОповещения;

	СтандартнаяОбработка = Ложь;

	Если ВыполнитьИзменениеТекущейОрганизации(ВыбраннаяСтрока, ПараметрОповещения) Тогда

		ОбщегоНазначенияРТКлиент.УстановитьЗаголовокПриложенияРТ();
		Оповестить("ПользовательИзменилТекущуюОрганизацию", ПараметрОповещения, ЭтотОбъект);

	КонецЕсли;

КонецПроцедуры

//	LNK 21.04.2017 11:41:33
&НаСервере
Функция ВыполнитьИзменениеТекущейОрганизации(Знач ВыбраннаяОрганизация, ПараметрОповещения)

	ЗначениеНастроек.УстановитьОрганизациюПоУмолчанию(ВыбраннаяОрганизация,, Ложь);

	Если НЕ Организация = ВыбраннаяОрганизация Тогда

		Организация = ВыбраннаяОрганизация;
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ТекущаяОрганизация",, Организация);

		УстановитьЗаголовок = Истина;
		ОбновитьПовторноИспользуемыеЗначения();

		ПараметрОповещения = Новый Структура(
			"Организация, Магазин"
			, ПараметрыСеанса.ТекущаяОрганизация, ПараметрыСеанса.ТекущийМагазин);

	Иначе

		УстановитьЗаголовок = Ложь;

	КонецЕсли;

	Возврат УстановитьЗаголовок;

КонецФункции

