
&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    Если ЗначениеЗаполнено(Параметры.СписокКонтрагентов) Тогда  
        НовыйЭлемент = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
        НовыйЭлемент.ВидСравнения  = ВидСравненияКомпоновкиДанных.ВСписке;
        НовыйЭлемент.ПравоеЗначение   = Параметры.СписокКонтрагентов;
        НовыйЭлемент.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы;
		ОткрыватьСписком = Истина;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ОткрыватьСписком тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
КонецПроцедуры
