#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.СпособОповещения = Перечисления.СпособыОповещения.Telegram Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Тема");
		ИначеЕсли Запись.СпособОповещения = Перечисления.СпособыОповещения.Email Тогда	
			МассивНепроверяемыхРеквизитов.Добавить("Бот");
		КонецЕсли;
			
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

#КонецОбласти
 
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
