
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	

	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросЗакрытияРеестра",
			ЭтотОбъект,
			ПараметрКоманды);
			
	ПоказатьВопрос(Оповещение, "Ви бажаєте закрити реєстр НП?",
			РежимДиалогаВопрос.ДаНет,
			0,
			КодВозвратаДиалога.Нет,
			"Закриття реєстра.");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьРеестр(СсылкаНаРеестр)
	
	Возврат ОбменНПСервер.ПолучитьФайлРеестра(СсылкаНаРеестр);
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросЗакрытияРеестра(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда

		РеестрНПСтруктура = ПолучитьРеестр(Параметры);
		
		Если РеестрНПСтруктура.ЕстьДокумет Тогда
			
			Попытка
				
				ЗапуститьПриложение(РеестрНПСтруктура.СсылкаНаДокумент);
			
			Исключение
			
				ТекстОшибки = ОписаниеОшибки();
				ПоказатьОповещениеПользователя(ТекстОшибки,
					,
					,
					БиблиотекаКартинок.ПредупрежденияОшибки);

			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
