
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	#Если Не ВебКлиент Тогда
	мИмяКомпьютера = ИмяКомпьютера();
	#КонецЕсли  
	
	ПолучитьТекущуюНастройкуРМКСервер();
	
	ОбновитьЗаголовкиФормыИЭлементовКлиент();

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ


&НаКлиенте
Процедура КомандаИзменениеНастройкиРМК(Команда)

	Если Не ЗначениеЗаполнено(НастройкаРМК) Тогда
		
		ОтветПользователя = ОбщегоНазначенияРТКлиент.ВывестиВопросДляРМК("На цьому комп'ютері РМК не налаштовано! Вибрати налаштування РМК?");
		
		Если НЕ ВРЕГ(ОтветПользователя) = "ДА" Тогда
			Возврат;
		КонецЕсли;
		
		ВыборНастройкиРМК();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкаРМК) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", НастройкаРМК);
	
	ОткрытьФормуМодально("Справочник.НастройкиРМК.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры



&НаКлиенте
Процедура КомандаВыборНастройкиРМК(Команда)
	
	ВыборНастройкиРМК();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТорговоеОборудование(Команда)
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФормуМодально("Справочник.ПодключаемоеОборудование.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПраваПользователей(Команда)
	
	ОткрытьФормуМодально("РегистрСведений.ЗначенияДополнительныхПравПользователя.Форма.ФормаРедактирования")
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПолучитьТекущуюНастройкуРМКСервер()
	
	НастройкаРМК = ПродажиСервер.ТекущаяНастройкаРМКСервер(мИмяКомпьютера);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборНастройкиРМК()

	ВыбраннаяНастройкаРМК = ОткрытьФормуМодально("Справочник.НастройкиРМК.ФормаВыбора");
	
	Если ЗначениеЗаполнено(ВыбраннаяНастройкаРМК) И НЕ ВыбраннаяНастройкаРМК = НастройкаРМК Тогда

		НастройкаРМК = ВыбраннаяНастройкаРМК;
		ЗаписатьТекущуюНастройкуРМК();
		ОбновитьЗаголовкиФормыИЭлементовКлиент();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьТекущуюНастройкуРМК()
	
	МенеджерРегистраНастройкаРМК = РегистрыСведений.НастройкаРМК.СоздатьМенеджерЗаписи();
	МенеджерРегистраНастройкаРМК.Компьютер    = мИмяКомпьютера;
	МенеджерРегистраНастройкаРМК.НастройкаРМК = НастройкаРМК;
	МенеджерРегистраНастройкаРМК.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовкиФормыИЭлементовКлиент()

	Заголовок = "Налаштування " + мИмяКомпьютера;

	Если ЗначениеЗаполнено(НастройкаРМК) Тогда

			Элементы.КомандаИзменениеНастройкиРМК.Заголовок = "Зміна налаштування РМК " + НастройкаРМК;

	Иначе	Элементы.КомандаИзменениеНастройкиРМК.Заголовок = "Зміна налаштування РМК (не обрана)";

	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	
	Закрыть();
	
КонецПроцедуры



