
// Процедура - обработчик события "ОбработкаКоманды".
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник) Тогда
		
		ПараметрыФормы = Новый Структура("МассивДокументов", ПараметрКоманды);
		ПараметрыПечати = ОткрытьФормуМодально("Документ.УстановкаЦенНоменклатуры.Форма.ФормаНастройкиПечатнойФормыУстановкиЦенНоменклатуры", ПараметрыФормы);
		
		Если ПараметрыПечати <> Неопределено Тогда
			
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
				"Документ.УстановкаЦенНоменклатуры",
				"УстановкаЦенНоменклатуры",
				ПараметрКоманды,
				Неопределено,
				ПараметрыПечати
				);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()
