#Область ОбаботчикиСобытийФормы

&НаСервере	//	LNK 10.09.2021 01:40:16
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ВРег(Запись.Протокол) = "HTTP" Тогда

		Элементы.ФормаПроверитьСоединениеСЦБ.Доступность = Ложь;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте	//	LNK 18.08.2020 06:07:25
Процедура ПроверитьСоединениеСЦБ(Команда)

	ДанныеПроверки = ПроверитьСоединениеСЦБНаСервере();

	ТекстРезультата =
		"Начало соединения: " + Формат(ДанныеПроверки.НачалоПередачи / 1000, "ЧДЦ=3; ЧН=0,000; ЧГ=") + Символы.ПС +
		"Конец соединения:  " + Формат(ДанныеПроверки.КонецПередачи / 1000, "ЧДЦ=3; ЧН=0,000; ЧГ=") + Символы.ПС +
		"Полное время соединения (сек): " + Формат((ДанныеПроверки.КонецПередачи - ДанныеПроверки.НачалоПередачи) / 1000, "ЧДЦ=3; ЧН=0,000; ЧГ=") + Символы.ПС +
		"Получено в ЦБ: " + Формат(ДанныеПроверки.Начало / 1000, "ЧДЦ=3; ЧН=0,000; ЧГ=") + Символы.ПС +
		"Запрос в ЦБ выполнен: " + Формат(ДанныеПроверки.КонецЗапроса / 1000, "ЧДЦ=3; ЧН=0,000; ЧГ=") + Символы.ПС +
		"Размер запроса в ЦБ: " + ДанныеПроверки.РазмерЗапроса + Символы.ПС
	;

	ПараметрыФормы = Новый Структура(
		"Заголовок, ТекстСообщения"
		, "Результат проверки соединения"
		, ТекстРезультата
	);

	ОткрытьФорму("ОбщаяФорма.ФормаПростогоТекстовогоСообщения"
		, ПараметрыФормы
		, ЭтотОбъект
		, ЭтотОбъект
		,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);

КонецПроцедуры

&НаСервереБезКонтекста	//	LNK 18.08.2020 06:14:16
Функция ПроверитьСоединениеСЦБНаСервере()

	НачалоПередачи = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Подключение    = СервисыСервер.Подключение("RetailPack");
	ДанныеПроверки = ОбщегоНазначенияКлиентСервер.ДесериализоватьJSON(Подключение.PingExtended(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().НомерМагазина));

	ДанныеПроверки.Вставить("НачалоПередачи", НачалоПередачи);
	ДанныеПроверки.Вставить("КонецПередачи" , ТекущаяУниверсальнаяДатаВМиллисекундах());

	Возврат ДанныеПроверки;

КонецФункции
