#Область ОбработчикиОсновныхСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);

	Магазин = ПараметрыСеанса.ТекущийМагазин;
	Список.Параметры.УстановитьЗначениеПараметра("ИсключительныйРежим", ТехническаяПоддержкаВызовСервера.ИсключительныйРежим());

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Магазин  = Настройки.Получить("Магазин");
	УстановитьОтборДинамическихСписковПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьВидимостьЭлементов();
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МагазинОтборПриИзменении(Элемент)

	УстановитьОтборДинамическихСписковНаКлиенте();
	УстановитьДоступностьВидимостьЭлементов();

КонецПроцедуры

#КонецОбласти

#Область СлужебныепроцедурыИФункции

&НаСервере
Процедура СоздатьПакетДокументовПоМагазинуНаСервере()

	Документы.ПереоценкаТоваровНаСкладах.СформироватьДокументыПереоценки(Магазин);
	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПакетДокументовПоМагазину(Команда)

	СоздатьПакетДокументовПоМагазинуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВидимостьЭлементов()

	Элементы.СоздатьПакетДокументовПоМагазину.Доступность = ЗначениеЗаполнено(Магазин);

КонецПроцедуры // УстановитьДоступностьВидимостьЭлементов()

&НаКлиенте
Процедура УстановитьОтборДинамическихСписковНаКлиенте()

	УстановитьОтборДинамическихСписковПриИзмененииСервер();

КонецПроцедуры // УстановитьОтборДинамическихСписковНаКлиенте()

&НаСервере
Процедура УстановитьОтборДинамическихСписковПриИзмененииСервер()

	УстановитьОтборДинамическихСписков("Магазин");

КонецПроцедуры // УстановитьОтборДинамическихСписковНаКлиенте()

&НаСервере
Процедура УстановитьОтборДинамическихСписков(ИмяРеквизита)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		ИмяРеквизита, 
		ЭтотОбъект[ИмяРеквизита], 
		ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]));

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзТСДНаСервере()
	ТранспортТерминалов.ПроверитьСтатусТСД();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСД(Команда)
	ЗагрузитьИзТСДНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВТСДНаСервере()
	ТранспортТерминалов.ПроверитьСтатусТСД(); 	
	ТранспортТерминалов.ВыгрузитьДанныеВТранспортТерминала();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВТСД(Команда)
	ВыгрузитьВТСДНаСервере();
КонецПроцедуры

#КонецОбласти













