
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Ок(Команда)
	
	АдресКомпоновщикаНастроек = ПоместитьВоВременноеХранилище(КомпоновщикНастроек, Новый УникальныйИдентификатор(УникальныйИдентификаторФормы));
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("Результат", "ОК");
	ДанныеВозврата.Вставить("АдресКомпоновщикаНастроек", АдресКомпоновщикаНастроек);
	Закрыть(ДанныеВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть();

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()

	УстановитьПривилегированныйРежим(Истина);
	АдресСхемыКомпоновкиДанных = Параметры.АдресСхемыКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	УникальныйИдентификаторФормы = Параметры.УникальныйИдентификаторФормы;
	
	ПереданныйКомпоновщикНастроек = ПолучитьИзВременногоХранилища(Параметры.АдресКомпоновщикаНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(ПереданныйКомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры
