Процедура ПередЗаписью(Отказ, Замещение)	//	LNK 27.07.2021 04:49:37

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)	//	LNK 27.07.2021 04:49:37

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ Количество() = 0 Тогда

		ТекстЗаписи = РегистрыСведений.УчетнаяПолитика.ПредставлениеЗаписи(ЭтотОбъект[0], Метаданные());
		ЖурналСобытий.Регистрация("ПОЛИТИКА", УровеньЖурналаРегистрации.Информация
			, Метаданные()
			,
			,
			, ТекстЗаписи
			, ТекстЗаписи
			, Ложь
			, Ложь
		);

	КонецЕсли;

КонецПроцедуры













