
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКПриемкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКПриемкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение КАК ДокументРаспоряжение,
		|	СУММА(РекламныеМатериалыКПриемкеОстатки.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКПриемке.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Магазин = &Магазин) КАК РекламныеМатериалыКПриемкеОстатки
		|ГДЕ
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаС <= &Период
		|	И РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаПо >= &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение,
		|	РекламныеМатериалыКПриемкеОстатки.РекламныйМатериал,
		|	РекламныеМатериалыКПриемкеОстатки.РекламнаяПлоскость";
	
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	
Объект.РекламныеМатериалы.Загрузить(РезультатЗапроса.Выгрузить())	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда 	
		Объект.Организация = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация; 
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Магазин) тогда 	
		Объект.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин; 
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ответственный) тогда 	
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;    	

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01
	
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыРекламныйМатериалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыРекламнаяПлоскостьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыРекламнаяПлоскостьОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыРекламнаяПлоскостьНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыРекламныйМатериалПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПросроченнымиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКПриемкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКПриемкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение КАК ДокументРаспоряжение,
		|	СУММА(РекламныеМатериалыКПриемкеОстатки.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКПриемке.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Магазин = &Магазин) КАК РекламныеМатериалыКПриемкеОстатки
		|ГДЕ
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаПо <= &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение,
		|	РекламныеМатериалыКПриемкеОстатки.РекламныйМатериал,
		|	РекламныеМатериалыКПриемкеОстатки.РекламнаяПлоскость";
	
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	
Объект.РекламныеМатериалы.Загрузить(РезультатЗапроса.Выгрузить())	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПросроченными(Команда)
	ЗаполнитьПросроченнымиНаСервере();
КонецПроцедуры
