//	LNK 20.02.2017 13:46:55
Функция ТекстОснованияХозяйственнойОперации(ХозяйственнаяОперация)	Экспорт

	СоставОснований = Новый Соответствие;
	СоставОснований.Вставить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзБанка, "Розмінна монета");
	СоставОснований.Вставить(Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ, "Торгова виручка, розмінна монета");

	ТекстОснования = СоставОснований.Получить(ХозяйственнаяОперация);

	Если ТекстОснования = Неопределено Тогда

		ТекстОснования = "";

	КонецЕсли;

	Возврат ТекстОснования;

КонецФункции // ТекстОснованияХозяйственнойОперации()
