//	LNK 02.06.2017 13:33:33
Функция ДанныеМагазинаЦенообразование(Магазин)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаВедущая.Ссылка КАК Магазин,
	|	ТаблицаВедущая.ВидМинимальныхЦенПродажи КАК ВидМинимальныхЦенПродажи,
	|	ТаблицаВедущая.ИспользоватьПрименениеЦен КАК ИспользоватьПрименениеЦен,
	|	ТаблицаВедущая.ПравилоЦенообразования КАК ПравилоЦенообразования,
	|	ТаблицаВедущая.ФорматМагазина КАК ФорматМагазина,
	|	ЕСТЬNULL(ТаблицаОрганизаций.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация
	|ИЗ
	|	Справочник.Магазины КАК ТаблицаВедущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииПодразделений.СрезПоследних(&Период, ) КАК ТаблицаОрганизаций
	|		ПО ТаблицаВедущая.Ссылка = ТаблицаОрганизаций.Владелец
	|ГДЕ
	|	ТаблицаВедущая.Ссылка = &Магазин"
	);
	Запрос.УстановитьПараметр("Период" , ТекущаяДата());	//	LNK 15.11.2023 16:52:55
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеМагазина = Новый Структура;
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(Результат, Выборка, ДанныеМагазина);

	Возврат ДанныеМагазина;

КонецФункции

//	LNK 02.06.2017 15:43:02
Функция ДанныеСклада(Склад)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаВедущая.Ссылка КАК Склад,
	|	ЕСТЬNULL(ТаблицаОрганизаций.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация
	|ИЗ
	|	Справочник.Склады КАК ТаблицаВедущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииПодразделений.СрезПоследних(&Период, ) КАК ТаблицаОрганизаций
	|		ПО ТаблицаВедущая.Магазин = ТаблицаОрганизаций.Владелец
	|ГДЕ
	|	ТаблицаВедущая.Ссылка = &Склад"
	);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());	//	LNK 15.11.2023 16:52:55
	Запрос.УстановитьПараметр("Склад" , Склад);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеСклада = Новый Структура;
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(Результат, Выборка, ДанныеСклада);

	Возврат ДанныеСклада;

КонецФункции // ДанныеСклада()

//	LNK 02.06.2017 13:52:44
Функция ДанныеНоменклатуры(Номенклатура, Упаковка = Неопределено)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаНоменклатура.Ссылка КАК Номенклатура,
	|	ТаблицаНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ТаблицаНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаНоменклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ТаблицаНоменклатура.ИспользоватьСерийныеНомера КАК ИспользоватьСерийныеНомера,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаУпаковки.Коэффициент, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаУпаковки.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ТаблицаНоменклатура.Номинал КАК Номинал
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК ТаблицаУпаковки
	|		ПО (ТаблицаУпаковки.Владелец ССЫЛКА Справочник.Номенклатура)
	|			И ТаблицаНоменклатура.Ссылка = ТаблицаУпаковки.Владелец
	|			И (ТаблицаУпаковки.Ссылка = &Упаковка)
	|ГДЕ
	|	ТаблицаНоменклатура.Ссылка = &Номенклатура"
	);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Упаковка"    , Упаковка);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеТовара = Новый Структура;
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(Результат, Выборка, ДанныеТовара);

	Возврат ДанныеТовара;

КонецФункции

//	LNK 16.06.2020 07:52:07
Функция ДанныеСерийногоНомера(СерийныйНомер)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСправочник.Ссылка КАК СерийныйНомер,
	|	ТаблицаВладельца.Ссылка КАК Номенклатура,
	|	ТаблицаВладельца.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаВладельца.ИспользоватьСерийныеНомера КАК ИспользоватьСерийныеНомера
	|ИЗ
	|	Справочник.СерийныеНомера КАК ТаблицаСправочник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаВладельца
	|		ПО ТаблицаСправочник.Владелец = ТаблицаВладельца.Ссылка
	|ГДЕ
	|	ТаблицаСправочник.Ссылка = &СерийныйНомер"
	);
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();

	ДанныеСерийногоНомера = Новый Структура;
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(Результат, Выборка, ДанныеСерийногоНомера);

	Возврат ДанныеСерийногоНомера;

КонецФункции

Функция ПолучитьКодыПроектов(ВернутьСоответствие = Ложь)	Экспорт

	Возврат Справочники.ВидыНоменклатуры.ПолучитьКодыПроектов(ВернутьСоответствие);

КонецФункции



