#Область ОбработчикиОсновныхСобытий

&НаСервере	//	LNK 15.11.2023 11:17:56
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	Если НЕ УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя("АдминистраторПолномочный", Ложь) = Истина Тогда

		ТолькоПросмотр = Истина;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("ЗаписьОрганизацииПодразделений"
		, Новый Структура(
			"Магазин, Организация"
			, Запись.Владелец
			, Запись.Организация
		)
	);

КонецПроцедуры

#КонецОбласти