
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем АдресВоВременномХранилище;
	// +HVOYA. 01.09.2016 14:53:06, Львова Е.А.
	Перем АдресВоВременномХранилищеНовыхАкций;
	// -HVOYA. 01.09.2016 14:53:10, Львова Е.А.
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресВоВременномХранилище", АдресВоВременномХранилище) Тогда
		
		ЗначениеВХранилище = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище);

		Если (ТипЗнч(ЗначениеВХранилище) = Тип("Структура") ИЛИ ТипЗнч(ЗначениеВХранилище) = Тип("Массив")) И НЕ ЗначениеВХранилище.Количество() = 0 Тогда

			Если ПолученыДанныеРасчетаСкидок(ЗначениеВХранилище) Тогда

				СписокСообщений.Очистить();

				Для каждого ЭлементМассива Из ЗначениеВХранилище Цикл

					Для каждого СтрокаТаблицы Из ЭлементМассива.Результаты.ТаблицаСообщений Цикл

						СписокСообщений.Добавить(СтрокаТаблицы.ТекстСообщения);

					КонецЦикла;

				КонецЦикла;

			ИначеЕсли ТипЗнч(ЗначениеВХранилище) = Тип("Массив") Тогда

				СписокСообщений.ЗагрузитьЗначения(ЗначениеВХранилище);

			Иначе

				СписокСообщений.ЗагрузитьЗначения(ЗначениеВХранилище.ТаблицаСообщений.ВыгрузитьКолонку("ТекстСообщения"));

			КонецЕсли;

		Иначе

			Отказ = Истина;

		КонецЕсли;
		
	// +HVOYA. 01.09.2016 14:43:17, Львова Е.А.
	ИначеЕсли  Параметры.Свойство("АдресВоВременномХранилищеНовыхАкций", АдресВоВременномХранилищеНовыхАкций) Тогда

		НовыеАкции = ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилищеНовыхАкций);
		ПереченьНовыхАкций = Строка("Добавлены новые акции:") + Символы.ПС;
		Для каждого Акция Из НовыеАкции Цикл
		     ПереченьНовыхАкций = ПереченьНовыхАкций + Строка(Акция.НаименованиеАкции) + ";" + Символы.ПС;
		КонецЦикла;
		МассивНовыхАкций = Новый Массив;
		МассивНовыхАкций.Добавить(ПереченьНовыхАкций);
		СписокСообщений.ЗагрузитьЗначения(МассивНовыхАкций);

	Иначе

		Отказ = Истина;

	КонецЕсли;
	
	// -HVOYA. 01.09.2016 14:43:20, Львова Е.А.
				
		Если СписокСообщений.Количество() = 0  Тогда
			Отказ = Истина;
		Иначе
			НомерТекущегоСообщения = 0;
            // +HVOYA. 20.02.2017 22:00:51, Львова Е.А.
            //ЭтоСообщениеДР = Найти(СписокСообщений[НомерТекущегоСообщения], "именинни");
            //Если НЕ ЭтоСообщениеДР=0 Тогда
            //    СписокСообщений[НомерТекущегоСообщения].Картинка = БиблиотекаКартинок.ДеньРождения;           	
            //    ЭтотОбъект.Элементы.Картинка.Видимость = Истина;
            //    ЭтотОбъект.Элементы.Картинка.Высота = 8;
            //    ЭтотОбъект.Элементы.ТекстСообщения.Высота = 8;
            //    Картинка = СписокСообщений[НомерТекущегоСообщения].Картинка;
            //КонецЕсли;
            // -HVOYA. 20.02.2017 22:00:55, Львова Е.А.
            
			ТекстСообщения = СписокСообщений[НомерТекущегоСообщения];
			Элементы.Назад.Доступность = Ложь;
			
			Если СписокСообщений.Количество() = 1 Тогда
				Элементы.Далее.Заголовок = "Закрыть"
			Иначе
				Элементы.Далее.Заголовок = "Далее >>"
			КонецЕсли;
		КонецЕсли;
		
	// +HVOYA. 01.09.2016 15:40:30, Львова Е.А.	
	//Иначе
	//	Отказ = Истина;
	//КонецЕсли;
	// -HVOYA. 01.09.2016 15:40:34, Львова Е.А.	
		
КонецПроцедуры


&НаКлиенте
Процедура ОбновлениеФормы()

	Элементы.Назад.Доступность = НомерТекущегоСообщения >= 1;
	
	Если (СписокСообщений.Количество() - 1) <= НомерТекущегоСообщения Тогда
		Элементы.Далее.Заголовок = "Закрыть";
		ТекстСообщения = СписокСообщений[СписокСообщений.Количество() - 1];
	Иначе
		Элементы.Далее.Заголовок = "Далее >>";
		ТекстСообщения = СписокСообщений[НомерТекущегоСообщения];
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура Назад(Команда)
	
	НомерТекущегоСообщения = НомерТекущегоСообщения - 1;
	ОбновлениеФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура Далее(Команда)
	// Вставить содержимое обработчика.
	
	Если Элементы.Далее.Заголовок = "Закрыть" Тогда
		Закрыть();
	Иначе
		НомерТекущегоСообщения = НомерТекущегоСообщения + 1;
		ОбновлениеФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста	//	LNK 22.01.2021 11:46:01
Функция ПолученыДанныеРасчетаСкидок(ЗначениеВХранилище)

	Соответствует = Ложь;

	Если ТипЗнч(ЗначениеВХранилище) = Тип("Массив") И НЕ ЗначениеВХранилище.Количество() = 0 Тогда

		Соответствует = Истина;

		Для каждого ЭлементМассива Из ЗначениеВХранилище Цикл

			Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда

				Если НЕ (ЭлементМассива.Свойство("Результаты") И ЭлементМассива.Свойство("СпособПрименения")) Тогда

					Соответствует = Ложь;
					Прервать;

				КонецЕсли;

			Иначе

				Соответствует = Ложь;
				Прервать;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Возврат Соответствует;

КонецФункции






