//	LNK 28.09.2021 06:41:26
Процедура ОбработчикСобытияСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ИменаКолонок, ПрефиксУдалить = "", Элементы)	Экспорт

	Если НЕ Элемент.ТекущиеДанные = Неопределено И ТипЗнч(ИменаКолонок) = Тип("Массив") Тогда

		Для каждого ИмяКолонки Из ИменаКолонок Цикл

			Если Поле = Элементы[ИмяКолонки] Тогда

				ИмяПоля = СтрЗаменить(ИмяКолонки, ПрефиксУдалить, "");

				Если НЕ (Элемент.ТекущиеДанные[ИмяПоля] = Неопределено ИЛИ ТипЗнч(Элемент.ТекущиеДанные[ИмяПоля]) = Тип("Строка")) Тогда

					Если ЗначениеЗаполнено(Элемент.ТекущиеДанные[ИмяПоля]) Тогда

						СтандартнаяОбработка = Ложь;
						ОткрытьЗначение(Элемент.ТекущиеДанные[ИмяПоля]);

					КонецЕсли;

					Прервать;

				КонецЕсли;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
