&НаСервере
Функция СформироватьЗапросПоТабелю(ПараметрыОтчета)
	
	СтрокаЧасы = "";
	СтрокаОтпуск = "";
	
	Для День = 1 По 31 Цикл
		СтрокаЧасы = СтрокаЧасы + " + ВЫБОР КОГДА ТЧ.Часов" + День+ " = 0 ТОГДА ТЧ.ЧасовФактАвто"+День+" ИНАЧЕ ТЧ.Часов" + День+ " КОНЕЦ";
		СтрокаОтпуск = СтрокаОтпуск + " + ВЫБОР КОГДА ТЧ.Комментарий" + День + " = ""отпуск"" ТОГДА 1 ИНАЧЕ 0 КОНЕЦ";
	КонецЦикла;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТЧ.Сотрудник КАК Сотрудник,
	|	ТЧ.Сотрудник.ИНН КАК ИНН,
	|	ТЧ.Должность КАК Должность,
	|	ТЧ.Ссылка.Магазин КАК Магазин,
	|	(" + Сред(СтрокаЧасы, 4) + ") КАК ЧасыСтроки,
	|	(" + Сред(СтрокаОтпуск, 4) + ") КАК ОтпускСтроки
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремени.ДанныеОВремени КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка.Проведен = ИСТИНА
	|	И ТЧ.Ссылка.ДатаНачалаПериода >= &НачалоПериода
	|	И ТЧ.Ссылка.ДатаОкончанияПериода <= &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Сотрудник КАК Сотрудник,
	|	ВТ.ИНН КАК ИНН,
	|	ВТ.Должность КАК Должность,
	|	ВТ.Магазин КАК Магазин,
	|	СУММА(ВТ.ЧасыСтроки) КАК ВсегоОтработаноЧасов,
	|	СУММА(ВТ.ОтпускСтроки) КАК ВсегоДнейВОтпуске
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Магазин,
	|	ВТ.ИНН,
	|	ВТ.Сотрудник,
	|	ВТ.Должность";
	
    //Сообщить(ТекстЗапроса);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",   ПараметрыОтчета.КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаРезультат = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаРезультат;
	
КонецФункции
&НаСервере

Функция СформироватьТабличныйДокумент2(ПараметрыОтчета)
	ТЗДанные = СформироватьЗапросПоТабелю(ПараметрыОтчета);
	Таб = Новый ТабличныйДокумент;

	ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 
	Макет = ОтчетОбъект.ПолучитьМакет("МакетПечати");
	Область_ = Макет.ПолучитьОбласть("Шапка");
	Если ПараметрыОтчета.НачалоПериода = НачалоМесяца(ПараметрыОтчета.НачалоПериода) И
		 ПараметрыОтчета.КонецПериода = КонецМесяца(ПараметрыОтчета.КонецПериода) Тогда
		 Если Месяц(ПараметрыОтчета.НачалоПериода) = Месяц(ПараметрыОтчета.КонецПериода)
		 И Год(ПараметрыОтчета.НачалоПериода) = Год(ПараметрыОтчета.КонецПериода) Тогда
		
			ПериодРегистрации =  Формат(ПараметрыОтчета.НачалоПериода,"ДФ='ММММ гггг'");
		Иначе
			ПериодРегистрации =  Формат(ПараметрыОтчета.НачалоПериода,"ДФ='ММММ гггг'")+" - "+Формат(ПараметрыОтчета.КонецПериода,"ДФ='ММММ гггг'");
		КонецЕсли;
	Иначе	
		ПериодРегистрации =  Формат(ПараметрыОтчета.НачалоПериода,"ДФ=dd.MM.yyyy")+" - "+Формат(ПараметрыОтчета.КонецПериода,"ДФ='dd.MM.yyyy'");
	КонецЕсли;
	Область_.Параметры.ПериодРегистрации = ПериодРегистрации;
	
	Таб.Вывести(Область_);
	Для Каждого Строка_ Из ТЗДанные Цикл
		Область_ = Макет.ПолучитьОбласть("Строка");
		Область_.Параметры.Магазин 		= Строка_.Магазин;
		Область_.Параметры.Сотрудник 	= Строка_.Сотрудник;
		Область_.Параметры.Должность 	= Строка_.Должность;
		Область_.Параметры.ИНН 			= Строка_.Сотрудник.ИНН;
		Область_.Параметры.КоличествоЧасов = Строка_.ВсегоОтработаноЧасов;
		Область_.Параметры.ДнейВОтпуске = Строка_.ВсегоДнейВОтпуске;
		Таб.Вывести(Область_);
	КонецЦикла;
	
	Результат.Очистить();
	Результат.Вывести(Таб);
	
	Возврат Таб;
	
КонецФункции

&НаКлиенте
Процедура КомандаСформировать(Команда)                 
	
	ЭтаФорма.АвтоОтображениеСостояния = РежимАвтоОтображенияСостояния.НеОтображать;
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	
	ВывестиНаПечать();
КонецПроцедуры

&НаСервере
Процедура ВывестиНаПечать()
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода",Период.ДатаНачала);
	ПараметрыОтчета.Вставить("КонецПериода",Период.ДатаОкончания);
	ПараметрыОтчета.Вставить("Магазин",Магазин);

	Таб = Отчеты.ОтчетПоФактическиОтработанномуВремени.СформироватьТабличныйДокумент(ПараметрыОтчета);
	
	Результат.Очистить();
	Результат.Вывести(Таб);
КонецПроцедуры
