
#Область ПрограммныйИнтерфейс

// Создает фоновые задания для выполнения обмена данными через шину в указанном направлении при отправке.
//
// Параметры:
//   НаправлениеОбмена - ПеречислениеСсылка.КафкаНаправлениеОбмена - направление обмена данными
Процедура ШинаДанных(НаправлениеОбмена) Экспорт
	
	Если НаправлениеОбмена = Перечисления.КафкаНаправлениеОбмена.Отправка Тогда
	
		КоличествоПотоков = Константы.КоличествоПотоковШина.Получить();
			
		Если КоличествоПотоков = 0 Тогда
			Возврат;
		КонецЕсли;
	
		Для НомерПотока = 1 По КоличествоПотоков Цикл
			
			НаименованиеПотокаОтправки = "ПотокОтправки" + НомерПотока;			
			Отбор = Новый Структура("Наименование", НаименованиеПотокаОтправки);
			ФоновыеЗаданияПотока = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			
			ЗаданиеСуществует = Ложь;
			Для Каждого ФоновоеЗадание Из ФоновыеЗаданияПотока Цикл
				Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
					ЗаданиеСуществует = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ЗаданиеСуществует Тогда
				
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(НомерПотока);
				
				ФоновыеЗадания.Выполнить(
					"ШинаОбмен.ЗаданиеВыполнитьОбменОтправка",
					ПараметрыЗадания,
					НаименованиеПотокаОтправки,
					НаименованиеПотокаОтправки);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет отправку сообщений из регистра сведений в Kafka через поток продюсера.
//
// Параметры:
//   НомерПотока - Число - номер потока для формирования имени продюсера и отбора сообщений
Процедура ЗаданиеВыполнитьОбменОтправка(НомерПотока) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВсегоВыполнения = 0;
	ПустыхВыполнений = 0;
	
	ИмяПродюсера = "ExchangeStream" + Формат(НомерПотока, "ЧЦ=3; ЧВН=; ЧГ=0;");
	Продюсер = Справочники.КафкаПродюсеры.НайтиПоНаименованию(ИмяПродюсера);
	
	Если Продюсер.Пустая() Тогда
		ВызватьИсключение СтрШаблон("Не найден продюсер с именем: %1", ИмяПродюсера);
	КонецЕсли;
	
	ИмяТопика = "ExchangeStream";
	Сессии = Новый Соответствие();

	Пока Истина Цикл

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КафкаИсходящиеСообщения.ВремяСоздания КАК ВремяСоздания,
			|	КафкаИсходящиеСообщения.УникальныйИдентификатор КАК УникальныйИдентификатор,
			|	КафкаИсходящиеСообщения.НомерПотока КАК НомерПотока,
			|	КафкаИсходящиеСообщения.СсылкаДляВыгрузки КАК СсылкаДляВыгрузки,
			|	КафкаИсходящиеСообщения.ОтборДляВыгрузки КАК ОтборДляВыгрузки,
			|	КафкаИсходящиеСообщения.ПолноеНаименованиеОбъектаВыгрузки КАК ПолноеНаименованиеОбъектаВыгрузки,
			|	КафкаИсходящиеСообщения.ДанныеВыгрузки КАК ДанныеВыгрузки,
			|	КафкаИсходящиеСообщения.СтатусВыгрузки КАК СтатусВыгрузки
			|ИЗ
			|	РегистрСведений.КафкаИсходящиеСообщения КАК КафкаИсходящиеСообщения
			|ГДЕ
			|	КафкаИсходящиеСообщения.НомерПотока = &НомерПотока
			|	И КафкаИсходящиеСообщения.СтатусВыгрузки = ЗНАЧЕНИЕ(Перечисление.КафкаСтатус.Новый)";
		
		Запрос.УстановитьПараметр("НомерПотока", НомерПотока);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			ПустыхВыполнений = ПустыхВыполнений + 1;
		Иначе
			ПустыхВыполнений = 0;
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураЗаписи = РегистрыСведений.КафкаИсходящиеСообщения.СтруктураЗаписи();
			ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Выборка);
			
			Сообщение = КафкаИнтеграция.ПараметрыСообщения(Выборка.ДанныеВыгрузки
				, Строка(Выборка.УникальныйИдентификатор));

			РезультатОтправки = КафкаИнтеграцияСлужебный.Отправить(Продюсер
				, ИмяТопика
				, Сообщение
				, НомерПотока - 1
				, Сессии);
				
			Если РезультатОтправки.Успешно Тогда
				
				СтруктураЗаписи.СтатусВыгрузки = Перечисления.КафкаСтатус.Выгружен;
				
			Иначе
				
				СтруктураЗаписи.ТекстОшибки = РезультатОтправки.ТекстОшибки;
				СтруктураЗаписи.СтатусВыгрузки = Перечисления.КафкаСтатус.Ошибка;
				
			КонецЕсли;
			
			РегистрыСведений.КафкаИсходящиеСообщения.ЗаписатьИзменениеСтатуса(СтруктураЗаписи);

		КонецЦикла;

		ВсегоВыполнения = ВсегоВыполнения + 1;
		
		Если ВсегоВыполнения >= 100 Или ПустыхВыполнений >= 5 Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;
	
	КафкаИнтеграцияСлужебный.ЗакрытьСессииПродюсера(Сессии);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПоШинеЗарегистрироватьИзменениеПриЗаписи(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеДокументаПриЗаписи(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеКонстантыПриЗаписи(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник, Ложь);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник, Ложь);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьИзмененияДанных(Источник, Объект = Истина)
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяИсточника = Метаданные.НайтиПоТипу(ТипЗнч(Источник)).ПолноеИмя();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КафкаНастройки.Ссылка КАК Ссылка,
		|	КафкаНастройкиТопики.Топик КАК Топик,
		|	КафкаТопики.Партиции КАК Партиции
		|ИЗ
		|	Справочник.КафкаНастройки.Топики КАК КафкаНастройкиТопики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаНастройки КАК КафкаНастройки
		|		ПО КафкаНастройкиТопики.Ссылка = КафкаНастройки.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаТопики КАК КафкаТопики
		|		ПО КафкаНастройкиТопики.Топик = КафкаТопики.Ссылка
		|ГДЕ
		|	КафкаНастройки.Наименование = &Наименование
		|	И НЕ КафкаТопики.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", ПолноеИмяИсточника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		КоличествоПотоков = Выборка.Партиции;
		
		Если КоличествоПотоков = 0 Тогда
			Возврат;
		КонецЕсли;

		ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
		НомерПотока = ГСЧ.СлучайноеЧисло(1, КоличествоПотоков);

		Если Объект Тогда

			ОтборДляВыгрузкиХранилище = "";
			СсылкаНаОбъект = Источник.Ссылка;
			УникальныйИдентификатор = СсылкаНаОбъект.УникальныйИдентификатор();

		Иначе
			
			СсылкаНаОбъект = Неопределено;
			ОтборДляВыгрузки = Новый Структура;
			Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
				ОтборДляВыгрузки.Вставить(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
			КонецЦикла;
			ОтборДляВыгрузкиХранилище = Новый ХранилищеЗначения(ОтборДляВыгрузки, Новый СжатиеДанных(9));
			УникальныйИдентификатор = Новый УникальныйИдентификатор;

		КонецЕсли;
		
		ИсходящиеДанные = РегистрыСведений.КафкаИсходящиеСообщения.СтруктураЗаписи();
		ИсходящиеДанные.УникальныйИдентификатор = УникальныйИдентификатор;
		ИсходящиеДанные.ВремяСоздания = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ИсходящиеДанные.НомерПотока = НомерПотока;
		ИсходящиеДанные.Топик = Выборка.Топик;
		ИсходящиеДанные.СсылкаДляВыгрузки = СсылкаНаОбъект;
		ИсходящиеДанные.ОтборДляВыгрузки = ОтборДляВыгрузкиХранилище;
		ИсходящиеДанные.ПолноеНаименованиеОбъектаВыгрузки = ПолноеИмяИсточника;
		ИсходящиеДанные.СтатусВыгрузки = Перечисления.КафкаСтатус.Новый;
		КафкаИнтеграция.ПодготовитьСообщение(Источник, ИсходящиеДанные);
		РегистрыСведений.КафкаИсходящиеСообщения.ДобавитьЗаписьРегистра(ИсходящиеДанные);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

