
#Область ПрограммныйИнтерфейс

// Создает фоновые задания для выполнения обмена данными через шину в указанном направлении при отправке.
//
// Параметры:
//   Брокер - Строка - наименование брокера
//   НаправлениеОбмена - Строка - направление обмена данными
Процедура ШинаДанных(Брокер, НаправлениеОбмена) Экспорт
	
	Если ВРег(НаправлениеОбмена) = ВРег("Отправка") Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КафкаПродюсеры.Ссылка КАК Продюсер,
			|	КафкаПродюсерыТопики.Топик КАК Топик,
			|	КафкаПродюсерыТопики.Порция КАК Порция,
			|	КафкаТопики.Партиции КАК Партиции,
			|	КафкаТопики.Наименование КАК ИмяТопика,
			|	КафкаПродюсеры.Наименование КАК НаименованиеПродюсера
			|ИЗ
			|	Справочник.КафкаПродюсеры.Топики КАК КафкаПродюсерыТопики
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаПродюсеры КАК КафкаПродюсеры
			|		ПО КафкаПродюсерыТопики.Ссылка = КафкаПродюсеры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаТопики КАК КафкаТопики
			|		ПО КафкаПродюсерыТопики.Топик = КафкаТопики.Ссылка
			|ГДЕ
			|	НЕ КафкаПродюсеры.ПометкаУдаления
			|	И КафкаПродюсеры.Брокер = &Брокер
			|	И НЕ КафкаТопики.ПометкаУдаления
			|	И КафкаТопики.Брокер = &Брокер";
		
		Запрос.УстановитьПараметр("Брокер", Справочники.КафкаБрокеры.НайтиПоНаименованию(Брокер));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Для НомерПотока = 1 По Выборка.Партиции Цикл

				НаименованиеОтправки = СтрШаблон("ПотокОтправки_%1_%2"
					, СокрЛП(Выборка.НаименованиеПродюсера)
					, НомерПотока);				
				Отбор = Новый Структура("Наименование", НаименованиеОтправки);
				ФоновыеЗаданияПотока = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
				
				ЗаданиеСуществует = Ложь;
				Для Каждого ФоновоеЗадание Из ФоновыеЗаданияПотока Цикл
					Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
						ЗаданиеСуществует = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЗаданиеСуществует Тогда
					
					ДанныеЗадания = Новый Структура;
					ДанныеЗадания.Вставить("Топик", Выборка.Топик);
					ДанныеЗадания.Вставить("ИмяТопика", Выборка.ИмяТопика);
					ДанныеЗадания.Вставить("Продюсер", Выборка.Продюсер);
					ДанныеЗадания.Вставить("НомерПотока", НомерПотока);
					ДанныеЗадания.Вставить("Порция", Выборка.Порция);
					ПараметрыЗадания = Новый Массив;
					ПараметрыЗадания.Добавить(ДанныеЗадания);
					
					ФоновыеЗадания.Выполнить(
						"ШинаОбмен.ЗаданиеВыполнитьОбменОтправка",
						ПараметрыЗадания,
						НаименованиеОтправки,
						НаименованиеОтправки);
					
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЦикла;
		
	ИначеЕсли ВРег(НаправлениеОбмена) = ВРег("Очистка") Тогда
		
		ОчисткаРегистраИсходящихСообщений();
		
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КафкаКонсьюмеры.Ссылка КАК Консьюмер,
			|	КафкаКонсьюмерыТопики.Топик КАК Топик,
			|	КафкаКонсьюмерыТопики.КоличествоПотоков КАК КоличествоПотоков,
			|	КафкаТопики.Наименование КАК ИмяТопика,
			|	КафкаКонсьюмеры.Наименование КАК НаименованиеКонсьюмера
			|ИЗ
			|	Справочник.КафкаКонсьюмеры.Топики КАК КафкаКонсьюмерыТопики
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаКонсьюмеры КАК КафкаКонсьюмеры
			|		ПО КафкаКонсьюмерыТопики.Ссылка = КафкаКонсьюмеры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаТопики КАК КафкаТопики
			|		ПО КафкаКонсьюмерыТопики.Топик = КафкаТопики.Ссылка
			|ГДЕ
			|	НЕ КафкаКонсьюмеры.ПометкаУдаления
			|	И КафкаКонсьюмеры.Брокер = &Брокер
			|	И НЕ КафкаТопики.ПометкаУдаления
			|	И КафкаТопики.Брокер = &Брокер";
		
		Запрос.УстановитьПараметр("Брокер", Справочники.КафкаБрокеры.НайтиПоНаименованию(Брокер));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Для НомерПотока = 1 По Выборка.КоличествоПотоков Цикл

				НаименованиеОтправки = СтрШаблон("ПотокПолучения_%1_%2"
					, СокрЛП(Выборка.НаименованиеКонсьюмера)
					, НомерПотока);
				
				Отбор = Новый Структура("Наименование", НаименованиеОтправки);
				ФоновыеЗаданияПотока = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
				
				ЗаданиеСуществует = Ложь;
				Для Каждого ФоновоеЗадание Из ФоновыеЗаданияПотока Цикл
					Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
						ЗаданиеСуществует = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ЗаданиеСуществует Тогда

					ПараметрыЗадания = Новый Массив;
					ПараметрыЗадания.Добавить(Выборка.Консьюмер);
					
					ФоновыеЗадания.Выполнить(
						"ШинаОбмен.ЗаданиеВыполнитьОбменПолучение",
						ПараметрыЗадания,
						НаименованиеОтправки,
						НаименованиеОтправки);
					
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет отправку сообщений из регистра сведений в Kafka через поток продюсера в бесконечном цикле. 
// Обрабатывает сообщения с статусом "Новый", обновляет статус на "Выгружен" или "Ошибка".
//
// Параметры:
//   ДанныеЗадания - Структура:
//     * Порция - Число - количество сообщений, обрабатываемых за одну итерацию
//     * НомерПотока - Число - номер потока для отбора сообщений в регистре
//     * Топик - Строка - наименование топика Kafka для отбора сообщений
//     * Продюсер - СправочникСсылка.КафкаПродюсеры - объект продюсера Kafka
//     * ИмяТопика - Строка - наименование топика для отправки сообщений
Процедура ЗаданиеВыполнитьОбменОтправка(ДанныеЗадания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ПустыхВыполнений = 0;

	Сессии = Новый Соответствие();

	Пока Истина Цикл

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КафкаИсходящиеСообщения.ВремяСоздания КАК ВремяСоздания,
			|	КафкаИсходящиеСообщения.УникальныйИдентификатор КАК УникальныйИдентификатор,
			|	КафкаИсходящиеСообщения.НомерПотока КАК НомерПотока,
			|	КафкаИсходящиеСообщения.СсылкаДляВыгрузки КАК СсылкаДляВыгрузки,
			|	КафкаИсходящиеСообщения.ОтборДляВыгрузки КАК ОтборДляВыгрузки,
			|	КафкаИсходящиеСообщения.ПолноеНаименованиеОбъектаВыгрузки КАК ПолноеНаименованиеОбъектаВыгрузки,
			|	КафкаИсходящиеСообщения.ДанныеВыгрузки КАК ДанныеВыгрузки,
			|	КафкаИсходящиеСообщения.СтатусВыгрузки КАК СтатусВыгрузки,
			|	КафкаИсходящиеСообщения.Топик КАК Топик,
			|	КафкаИсходящиеСообщения.ХешДанных КАК ХешДанных,
			|	КафкаИсходящиеСообщения.Получатели КАК Получатели
			|ИЗ
			|	РегистрСведений.КафкаИсходящиеСообщения КАК КафкаИсходящиеСообщения
			|ГДЕ
			|	КафкаИсходящиеСообщения.НомерПотока = &НомерПотока
			|	И НЕ КафкаИсходящиеСообщения.СтатусВыгрузки = ЗНАЧЕНИЕ(Перечисление.КафкаСтатус.Выгружен)
			|	И КафкаИсходящиеСообщения.Топик = &Топик
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВремяСоздания";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + Формат(ДанныеЗадания.Порция, "ЧГ=0;"));

		Запрос.УстановитьПараметр("НомерПотока", ДанныеЗадания.НомерПотока);
		Запрос.УстановитьПараметр("Топик", ДанныеЗадания.Топик);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			ПустыхВыполнений = ПустыхВыполнений + 1;
		Иначе
			ПустыхВыполнений = 0;
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураЗаписи = РегистрыСведений.КафкаИсходящиеСообщения.СтруктураЗаписи();
			ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Выборка);
			
			Сообщение = КафкаИнтеграция.ПараметрыСообщения(Выборка.ДанныеВыгрузки
				, Строка(Выборка.УникальныйИдентификатор));

			РезультатОтправки = КафкаИнтеграцияСлужебный.Отправить(ДанныеЗадания.Продюсер
				, ДанныеЗадания.ИмяТопика
				, Сообщение
				, ДанныеЗадания.НомерПотока - 1
				, Сессии);
				
			Если РезультатОтправки.Успешно Тогда
				
				СтруктураЗаписи.СтатусВыгрузки = Перечисления.КафкаСтатус.Выгружен;
				РегистрыСведений.КафкаИсходящиеСообщения.ЗаписатьИзменениеСтатуса(СтруктураЗаписи);
				
			Иначе
				
				СтруктураЗаписи.ТекстОшибки = РезультатОтправки.ТекстОшибки;
				СтруктураЗаписи.СтатусВыгрузки = Перечисления.КафкаСтатус.Ошибка;
				РегистрыСведений.КафкаИсходящиеСообщения.ЗаписатьИзменениеСтатуса(СтруктураЗаписи);
				Прервать;
				
			КонецЕсли;

		КонецЦикла;

		Если ПустыхВыполнений >= 5 Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;
	
	КафкаИнтеграцияСлужебный.ЗакрытьСессииПродюсера(Сессии);

КонецПроцедуры

// Выполняет загрузку входящих сообщений через консьюмеры в параллельном потоке.
//
// Параметры:
//   Консьюмер - СправочникСсылка.КафкаКонсьюмеры - консьюмер для загрузки сообщений
Процедура ЗаданиеВыполнитьОбменПолучение(Консьюмер) Экспорт

	Сессии = Новый Соответствие;

	БлокироватьЗавершенияДо = ТекущаяУниверсальнаяДата() + 60; // первую минуту блокируем завершение
	ВремяЗавершенияЗадания = ТекущаяУниверсальнаяДата() + 300; // задание длиттся 5 минут

	Попытка
	
		Пока БлокироватьЗавершенияДо > ТекущаяУниверсальнаяДата()
				И ВремяЗавершенияЗадания > ТекущаяУниверсальнаяДата() Цикл
			Загружено = Ложь;
			КафкаИнтеграцияСлужебный.ОбработчикЗагрузкиСообщений(Консьюмер, Сессии, Загружено);
			Если Загружено Тогда
				БлокироватьЗавершенияДо = ТекущаяУниверсальнаяДата() + 60; // ототдвегаем закрытие на минуту
			КонецЕсли;;
	
		КонецЦикла;
	
	Исключение

		Инфо = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Инфо);
		СобытиеОповещения = Перечисления.ТипыСобытийОповещений.ОповещениеРазработчикаОбОшибках;	
		
		ТелоСообщения = СтрШаблон("Ошибка загрузки сообщения!!! Причина ошибки: %1."
			, СокрЛП(ТекстОшибки));

		НастройкиОповещения = Новый Структура;
		НастройкиОповещения.Вставить("СпособОповещения", Перечисления.СпособыОповещения.Telegram);
		НастройкиОповещения.Вставить("ТелоСообщения"   , ТелоСообщения);
		
		ОповещенияПользователей.ВыполнитьОповещениеПользователей(СобытиеОповещения, НастройкиОповещения);
		
	КонецПопытки;

	КафкаИнтеграцияСлужебный.ЗакрытьСессииКонсьюмера(Сессии);
	
КонецПроцедуры

// Удаляет записи регистра сведений исходящих сообщений, срок хранения которых превысил 7 дней.
Процедура ОчисткаРегистраИсходящихСообщений() Экспорт
	
	МилисекундыЧисло = ТекущаяУниверсальнаяДатаВМиллисекундах() - 1000*60*60*24*7;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КафкаИсходящиеСообщения.ВремяСоздания КАК ВремяСоздания
	|ИЗ
	|	РегистрСведений.КафкаИсходящиеСообщения КАК КафкаИсходящиеСообщения
	|ГДЕ
	|	КафкаИсходящиеСообщения.ВремяСоздания <= &ВремяСоздания";
	
	Запрос.УстановитьПараметр("ВремяСоздания", МилисекундыЧисло);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.КафкаИсходящиеСообщения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВремяСоздания.Установить(Выборка.ВремяСоздания);
		НаборЗаписей.Записать();
	
	КонецЦикла;

Конецпроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПоШинеЗарегистрироватьИзменениеПриЗаписи(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеДокументаПриЗаписи(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеКонстантыПриЗаписи(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник, Ложь);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник, Ложь);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьИзмененияДанных(Источник, Объект = Истина)
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяИсточника = Метаданные.НайтиПоТипу(ТипЗнч(Источник)).ПолноеИмя();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КафкаНастройки.Ссылка КАК Ссылка,
		|	КафкаНастройкиТопики.Топик КАК Топик,
		|	КафкаТопики.Партиции КАК Партиции,
		|	КафкаНастройкиТопики.ЗапросНаПолучателей КАК ЗапросНаПолучателей,
		|	КафкаНастройкиТопики.ПропускаемыеРеквизиты КАК ПропускаемыеРеквизиты,
		|	КафкаНастройкиТопики.НужноВыполнятьКод КАК НужноВыполнятьКод
		|ИЗ
		|	Справочник.КафкаНастройки.Топики КАК КафкаНастройкиТопики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаНастройки КАК КафкаНастройки
		|		ПО КафкаНастройкиТопики.Ссылка = КафкаНастройки.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КафкаТопики КАК КафкаТопики
		|		ПО КафкаНастройкиТопики.Топик = КафкаТопики.Ссылка
		|ГДЕ
		|	КафкаНастройки.Наименование = &Наименование
		|	И НЕ КафкаТопики.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", ПолноеИмяИсточника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		КоличествоПотоков = Выборка.Партиции;
		
		Если КоличествоПотоков = 0 Тогда
			Возврат;
		КонецЕсли;

		ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
		НомерПотока = ГСЧ.СлучайноеЧисло(1, КоличествоПотоков);

		СтрокаПолучателей = "";
		МассивПолучателей = Новый Массив;
		ЗапросНаПолучателей = Новый Запрос(Выборка.ЗапросНаПолучателей);

		Если Объект Тогда

			ОтборДляВыгрузкиХранилище = "";
			СсылкаНаОбъект = Источник.Ссылка;
			УникальныйИдентификатор = Строка(СсылкаНаОбъект.УникальныйИдентификатор());
			ЗапросНаПолучателей.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
			

		Иначе
			
			СсылкаНаОбъект = Неопределено;
			ОтборДляВыгрузки = Новый Структура;
			Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
				ОтборДляВыгрузки.Вставить(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
				ЗапросНаПолучателей.УстановитьПараметр(ЭлементОтбора.Имя, ЭлементОтбора.Значение);
			КонецЦикла;
			
			Если Не Источник.Количество() = 0 И Не ПустаяСтрока(Выборка.ЗапросНаПолучателей) Тогда
				
				КоллекцияПараметров = ЗапросНаПолучателей.НайтиПараметры();

				Для Каждого ПараметрЗапроса Из КоллекцияПараметров Цикл
					ЗапросНаПолучателей.УстановитьПараметр(ПараметрЗапроса.Имя, Источник[0][ПараметрЗапроса.Имя]);
				КонецЦикла;
				
			КонецЕсли;

			ОтборДляВыгрузкиХранилище = Новый ХранилищеЗначения(ОтборДляВыгрузки, Новый СжатиеДанных(9));
			УникальныйИдентификатор = "";

		КонецЕсли;
		
		Если Не ПустаяСтрока(Выборка.ЗапросНаПолучателей) Тогда
			
			Если Выборка.НужноВыполнятьКод Тогда

				Выполнить(Выборка.ЗапросНаПолучателей);
			
			Иначе

				ЗапросНаПолучателей.Текст = Выборка.ЗапросНаПолучателей;
				РезультатЗапросаНаПолучателей = ЗапросНаПолучателей.Выполнить();
				ВыборкаНаПолучателей = РезультатЗапросаНаПолучателей.Выбрать();
				Пока ВыборкаНаПолучателей.Следующий() Цикл
					МассивПолучателей.Добавить(ВыборкаНаПолучателей.Получатель);
				КонецЦикла;
				
				
			КонецЕсли;

		КонецЕсли;

		СтрокаПолучателей = СтрСоединить(МассивПолучателей, ",");


		ИсходящиеДанные = РегистрыСведений.КафкаИсходящиеСообщения.СтруктураЗаписи();
		ИсходящиеДанные.УникальныйИдентификатор = УникальныйИдентификатор;
		ИсходящиеДанные.ВремяСоздания = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ИсходящиеДанные.НомерПотока = НомерПотока;
		ИсходящиеДанные.Топик = Выборка.Топик;
		ИсходящиеДанные.СсылкаДляВыгрузки = СсылкаНаОбъект;
		ИсходящиеДанные.ОтборДляВыгрузки = ОтборДляВыгрузкиХранилище;
		ИсходящиеДанные.ПолноеНаименованиеОбъектаВыгрузки = ПолноеИмяИсточника;
		ИсходящиеДанные.СтатусВыгрузки = Перечисления.КафкаСтатус.Новый;
		ИсходящиеДанные.Получатели = СтрокаПолучателей;
		ИсходящиеДанные.ПропускаемыеРеквизиты = Выборка.ПропускаемыеРеквизиты;
		КафкаИнтеграция.ПодготовитьСообщение(Источник, ИсходящиеДанные);
		РегистрыСведений.КафкаИсходящиеСообщения.ДобавитьЗаписьРегистра(ИсходящиеДанные);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти 

