
#Область ПрограммныйИнтерфейс

// Выполняет запуск обмена с сайтом из регламентного задания.
//
// Параметры:
//   КодУзлаОбмена - Строка - строка с кодом узла плана обмена.
Процедура ЗаданиеВыполнитьОбмен(КодУзлаОбмена) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	УзелОбмена = ПланыОбмена.Шина.НайтиПоКоду(КодУзлаОбмена);
	
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обмен с Шиной'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			УзелОбмена.Метаданные(),
			УзелОбмена,
			НСтр("ru = 'Не найден узел обмена с кодом'") + " " + КодУзлаОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелОбмена, "ПометкаУдаления") Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Обмен с Шиной'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация,
			УзелОбмена.Метаданные(),
			УзелОбмена,
			НСтр("ru = 'Настройка обмена помечена на удаление. Обмен отменен.'"));
		
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОбмен(УзелОбмена);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ШинаДанных(ЗапускИнтеграции, КодУзлаОбмена = "") Экспорт
	
	Если ЗапускИнтеграции Тогда
		
		СервисыИнтеграции.ВыполнитьОбработку();
		
	Иначе
		
		ЗаданиеВыполнитьОбмен(КодУзлаОбмена);
		
	КонецЕсли;

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеПередЗаписью(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеКонстантыПередЗаписью(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

Процедура ПоШинеЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	
	ЗарегистрироватьИзмененияДанных(Источник);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьОбмен(УзелОбмена)
	
	УстановитьПривилегированныйРежим(Истина);

	ВыбПланОбмена = Метаданные.ПланыОбмена.Шина;
	
	Для Каждого ЭлементПланаОбмена Из ВыбПланОбмена.Состав Цикл
		
		СписокОбъектов = Новый Массив;
		ПолноеИмяМетаданных = ЭлементПланаОбмена.Метаданные.ПолноеИмя();
		ИмяТаблицы = СтрЗаменить(ПолноеИмяМетаданных, ".", "");
		Менеджер = Новый (СтрЗаменить(ПолноеИмяМетаданных, ".", "Менеджер."));

		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 100 * ИЗ " + ПолноеИмяМетаданных + ".Изменения КАК " + ИмяТаблицы + " Где " + ИмяТаблицы + ".Узел = &Узел");
		Запрос.УстановитьПараметр("Узел", УзелОбмена);
		
		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл
		
			Попытка
				
				НаборЗаписей =  Менеджер.СоздатьНаборЗаписей();
				Для каждого Элемент Из НаборЗаписей.Отбор Цикл
					
					Попытка
						Элемент.Установить(Выборка[Элемент.Имя]);
					Исключение
						ТекстОшибки = ОписаниеОшибки();
					КонецПопытки;
	
				КонецЦикла;
				
				СписокОбъектов.Добавить(НаборЗаписей);
				
			Исключение
				
				Попытка
					
					СписокОбъектов.Добавить(Выборка.Ссылка);
					
				Исключение
					
					СписокОбъектов = ЭлементПланаОбмена.Метаданные;
					Прервать;
				
				КонецПопытки;
				
				
				
			КонецПопытки
		
		КонецЦикла;
		
		Выборка = ПланыОбмена.ВыбратьИзменения(УзелОбмена, 1, СписокОбъектов);
	
		Пока Выборка.Следующий() Цикл
	
			ДанныеДляОтправки = Выборка.Получить();
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ДанныеДляОтправки, НазначениеТипаXML.Явное);
			JSONСтрока = ЗаписьJSON.Закрыть();
			
			Сообщение = СервисыИнтеграции.ПродТест.СоздатьСообщение();
			
			ТипЗначения = ТипЗнч(ДанныеДляОтправки);
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
			Если ОбъектМетаданных = Неопределено Тогда
				ВидОбъекта = "Прочее";
			ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
				ВидОбъекта = "Справочник";
			ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
				ВидОбъекта = "Документ";
			ИначеЕсли Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
				ВидОбъекта = "РегистрыСведений";
			ИначеЕсли Метаданные.РегистрыНакопления.Содержит(ОбъектМетаданных) Тогда
				ВидОбъекта = "РегистрыНакопления";
			Иначе
				ВидОбъекта = "Прочее";
			КонецЕсли;		
	
			Сообщение.Параметры.Вставить("ВидОбъекта", ВидОбъекта);
			Тело = Сообщение.ПолучитьТелоКакПоток();
			
			Буфер = ПолучитьБуферДвоичныхДанныхИзСтроки(JSONСтрока);
			Тело.Записать(Буфер, 0, Буфер.Размер);
			Тело.Закрыть();
	
			СервисыИнтеграции.ПродТест.ANTOSHKA_ProdTest_Основной_ПродТест_ПродИсточник.ОтправитьСообщение(Сообщение);
			
			Попытка 
				
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ДанныеДляОтправки);
				
			Исключение
				
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, ДанныеДляОтправки.Ссылка);
				
			КонецПопытки;
	
		КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры

Процедура ЗарегистрироватьИзмененияДанных(Источник)
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДаннымиПовтИсп.ПланОбменаСодержитОбъект("Шина", Источник.Метаданные().ПолноеИмя()) Тогда
		Выборка = ПланыОбмена.Шина.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ЭтотУзел Тогда
				Источник.ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

