////////////////////////////////////////////////////////////////////////////////
// Варианты отчетов - Форма отчета (клиент, переопределяемый)
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Обработчик расшифровки табличного документа формы отчета.
//
// Параметры:
//   Форма (УправляемаяФорма)
//   Элемент  (ПолеФормы)
//   Остальные параметры передаются из параметров обработчика "как есть",
//       см. события для "Расширение поля формы для поля табличного документа" в справке.
//
Процедура ОбработкаРасшифровки(Форма, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик дополнительной расшифровки (меню табличного документа формы отчета).
//
// Параметры:
//   Форма (УправляемаяФорма)
//   Элемент  (ПолеФормы)
//   Остальные параметры передаются из параметров обработчика "как есть",
//       см. события для "Расширение поля формы для поля табличного документа" в справке.
//
Процедура ОбработкаДополнительнойРасшифровки(Форма, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик команд, добавленных динамически.
//
// Параметры:
//   Форма  (УправляемаяФорма) Форма отчета.
//   Команда   (КомандаФормы)     Команда, которая была вызвана.
//   Результат (Булево)           Истина, если вызов команды обработан.
//
Процедура ОбработчикКоманды(Форма, Команда, Результат) Экспорт
	
КонецПроцедуры

// Обработчик результата выбора подчиненной формы.
//
// Параметры:
//   Форма          (УправляемаяФорма) Форма отчета.
//   ВыбранноеЗначение (*)                Результат выбора в подчиненной форме.
//   ИсточникВыбора    (УправляемаяФорма) Форма, где осуществлен выбор. 
//   Результат         (Булево)           Истина, если результат выбора обработан.
//
Процедура ОбработкаВыбора(Форма,ВыбранноеЗначение, ИсточникВыбора, Результат) Экспорт
	
КонецПроцедуры

