Процедура ПередЗаписью(Отказ, Замещение)

	Если Отбор.Период.Значение = '00010101' Тогда

		Отбор.Период.Значение = ТекущаяДата();

	КонецЕсли;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		Если НЕ ЗаписьНабора.Период = Отбор.Период.Значение Тогда

			ЗаписьНабора.Период = Отбор.Период.Значение;

		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.Идентификатор) Тогда

			ЗаписьНабора.Идентификатор = Новый УникальныйИдентификатор;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
