#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ЧекДляПросмотра", ЧекДляПросмотра);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Цена КАК Цена,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	ТаблицаТовары.КоличествоУпаковок КАК Количество,
	|	ТаблицаТовары.СуммаРучнойСкидки + ТаблицаТовары.СуммаАвтоматическойСкидки КАК Скидка
	|ИЗ
	|	Документ.ЧекККМ.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка"
	);
	Запрос.УстановитьПараметр("Ссылка", ЧекДляПросмотра);

	ТаблицаЧека.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НапечататьДокумент(Команда)
	
	МассивСсылокЧеков = Новый Массив;
	МассивСсылокЧеков.Добавить(ЧекДляПросмотра);
	
	ВладелецФормы.НапечататьЧекиККМ(МассивСсылокЧеков);

	Закрыть();	//	LNK 07.02.2023 14:25:33

КонецПроцедуры

#КонецОбласти

























