&НаСервере
Функция ПолучитьМодульФормы()
	Возврат РеквизитФормыВЗначение("Объект");
КонецФункции

&НаСервере
Функция ПолучитьМакетПоУмолчанию()
	Возврат ПолучитьМодульФормы().ПолучитьМакет("ТестовыйТабличныйДокумент");
КонецФункции

&НаСервере
Функция СформироватьРисунокНаСервере()
	Обработка=ПолучитьМодульФормы();
	к=Обработка.ПолучитьКартинкуЛинейногоШК(ТекстКода,ФорматКода,Вычислить("ФорматКартинки."+ФорматКартинкиЗн),ВключатьТекст,,,,,1);
	Если к=Неопределено тогда
		Возврат Неопределено;
	Иначе
		адр=ПоместитьВоВременноеХранилище(к,ЭтаФорма.УникальныйИдентификатор);
		АдресКартинки=адр;
		Возврат адр;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура СформироватьРисунок(Команда)
	к=СформироватьРисунокНаСервере();
	Если к<>Неопределено тогда
//		ЭтаФорма.Элементы.Декорация1.Картинка=к;
	Иначе
		Сообщить("Не удалось получить изображение");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СформироватьТестЛистНаСервере()
	Обработка=ПолучитьМодульФормы();
	Т=Новый ТабличныйДокумент();
	текст="1234567890123";
	текст8="12345678";
	Н=0;
	СписокКодов=ЭтаФорма.Элементы.ПолеФорматКода.СписокВыбора;
	для Каждого типкода из СписокКодов цикл
		тк=?(типкода.Значение="EAN8",текст8,текст);
		кр=Обработка.ПолучитьКартинкуЛинейногоШК(тк,типкода.Значение,ФорматКартинки.BMP,Истина,,,,,1);
		кв=Обработка.ПолучитьКартинкуЛинейногоШК(тк,типкода.Значение,ФорматКартинки.WMF,Истина);
		
		к=т.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
		к.Лево=5;
		к.Верх=5+Н*30;
		к.Ширина=170;
		к.Высота=5;
		к.Текст=типкода.Значение;
		к=т.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
		к.Имя="КР"+Н;
		к.Лево=5;
		к.Верх=10+Н*30;
		к.Ширина=50;
		к.Высота=20;
//		к.ГраницаСлева=Ложь;к.ГраницаСправа=Ложь;
		к.Линия=Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии,0);
		к.Картинка=кр;
		к=т.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
		к.Имя="КВ"+Н;
		к.Лево=5+55+10;
		к.Верх=10+Н*30;
		к.Ширина=50;
		к.Высота=20;
//		к.ГраницаСлева=Ложь;к.ГраницаСправа=Ложь;
		к.Линия=Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии,0);
		к.Картинка=кв;
		Обработка.ВставитьВТабличныйДокументЛинейныйШККоординаты(т,5+50+10+50+10,10+Н*30,50,20,тк,типкода.Значение,Истина);
		Н=Н+1;
	КонецЦикла;
	Возврат Т;
КонецФункции

&НаКлиенте
Процедура СформироватьТестЛист(Команда)
	т=СформироватьТестЛистНаСервере();
	ТабличныйДокумент=т;
	т.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ФорматКартинкиЗн="WMF";
	ФорматКода="CODE128";
	ТабличныйДокумент=ПолучитьМакетПоУмолчанию();
	ТекстКода="1234567";
КонецПроцедуры

&НаСервере
Функция СформироватьБольшойШтрихВТаблицеНаСервере()
	Обработка=ПолучитьМодульФормы();
	Т=Новый ТабличныйДокумент();
	текст="1234567890123";
	Обработка.ВставитьВТабличныйДокументЛинейныйШККоординаты(т,10,10,200,80,текст,"CODE128",Истина);
	Возврат Т;
КонецФункции

&НаКлиенте
Процедура СформироватьБольшойШтрихВТаблице(Команда)
	т=СформироватьБольшойШтрихВТаблицеНаСервере();
	ТабличныйДокумент=т;
	т.Показать();
КонецПроцедуры

&НаСервере
Функция ЗамерПроизводительностиНаСервере(Метод,Длительность);
	// Вставить содержимое обработчика.
	т1=ТекущаяДата()+1;
	Пока ТекущаяДата()<т1 цикл
	КонецЦикла;
	Н=0;
	Обработка=ПолучитьМодульФормы();
	текст="1234567890123";
	
	Пока ТекущаяДата()<т1+Длительность цикл
		Если Метод=1 тогда
			кр=Обработка.ПолучитьКартинкуЛинейногоШК(текст,"CODE128",ФорматКартинки.BMP,Истина,,,,,1);
		ИначеЕсли Метод=2 тогда
			кр=Обработка.ПолучитьКартинкуЛинейногоШК(текст,"CODE128",ФорматКартинки.BMP,Ложь,,,,,1);
		ИначеЕсли Метод=3 тогда
			кв=Обработка.ПолучитьКартинкуЛинейногоШК(текст,"CODE128",ФорматКартинки.WMF,Истина);
		Иначе
			Т=Новый ТабличныйДокумент();
			Обработка.ВставитьВТабличныйДокументЛинейныйШККоординаты(т,10,10,250,100,текст,"CODE128",Истина);
		КонецЕсли;
		Н=Н+1;
	КонецЦикла;                               
	Возврат Н;
КонецФункции

&НаКлиенте
Процедура ЗамерПроизводительности(Команда)
	Время=20;
	с1=ЗамерПроизводительностиНаСервере(1,Время);
	Сообщить("BMP+подпись: "+с1+"шт, "+Окр(с1/Время,3)+"шт/с");
	с2=ЗамерПроизводительностиНаСервере(2,Время);
	Сообщить("BMP: "+с2+"шт, "+Окр(с2/Время,3)+"шт/с");
	с3=ЗамерПроизводительностиНаСервере(3,Время);
	Сообщить("WMF: "+с3+"шт, "+Окр(с3/Время,3)+"шт/с");
	с4=ЗамерПроизводительностиНаСервере(4,Время);
	Сообщить("Табличный рисунок: "+с4+"шт, "+Окр(с4/Время,3)+"шт/с");
КонецПроцедуры
