//	LNK 28.08.2016 09:45:17
Процедура ОбменNavisionРозницаЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	Если ВнешниеИсточникиСобытия.ПередачаNavision(Источник.Ссылка, Ложь) = Перечисления.ВидыПередачиNavision.ПереданВNavision
	И НЕ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(Источник.ДополнительныеСвойства, "НеПроверятьРегистрациюВОбменNavision", Ложь) = Истина
	ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПокупателя")	
	ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ЗапросДоступностиТоваров")	Тогда

	//	Для нового объекта регистрация проходить не будет. Но вместе с этим объектом происходит
	//	запись набора записей регистра сведений "ОбъектУчтенВNavision". А в модуле набора как
	//	раз и будет проведена регистрация в узел. А здесь далеко не всегда актуально, так как, например,
	//	при установке флага учёта в Navision, в этом обработчике ещё нельзя поймать существование
	//	набора записей "ОбъектУчтенВNavision".
		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменNavisionРозница", Источник, Отказ, РежимЗаписи, РежимПроведения);

	КонецЕсли;

КонецПроцедуры

//	LNK 07.10.2020 10:40:44
Процедура ОбменNavisionРозницаЗарегистрироватьИзменениеДокументаПриЗаписи(Источник, Отказ) Экспорт

	ВнешниеИсточникиСверка.РегистрацияДокументаПриЗаписи(Источник, Отказ);

КонецПроцедуры

//	LNK 28.08.2016 09:45:58
Процедура ОбменNavisionРозницаЗарегистрироватьУдаление(Источник, Отказ) Экспорт

	Если НЕ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(Источник.ДополнительныеСвойства, "НеПроверятьРегистрациюВОбменNavision", Ложь) = Истина
		 И  ВнешниеИсточникиСобытия.ПередачаNavision(Источник.Ссылка, Ложь) = Перечисления.ВидыПередачиNavision.ПереданВNavision Тогда

		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменNavisionРозница", Источник, Отказ);

	КонецЕсли;

КонецПроцедуры

//	LNK 02.10.2016 11:32:45
Процедура ОбменNavisionРозницаЗарегистрироватьИзменение(Источник, Отказ) Экспорт

	Если НЕ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(Источник.ДополнительныеСвойства, "НеПроверятьРегистрациюВОбменNavision", Ложь) = Истина Тогда

		ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменNavisionРозница", Источник, Отказ);

	КонецЕсли;

КонецПроцедуры
