
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка ИЛИ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "СлужебныйРежимЗаписи", Ложь) = Истина Тогда

		Возврат;

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "СлужебныйРежимЗаписи", Ложь) = Истина Тогда

		Возврат;

	КонецЕсли;

	ПроверитьДопустимостьЗаписиОбъекта(Отказ);

КонецПроцедуры


Функция ПроверитьДопустимостьЗаписиОбъекта(Отказ)


		ЕстьРазрешениеИзменения = ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() = Истина ИЛИ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел();

		Если НЕ ЕстьРазрешениеИзменения Тогда

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отказано. Изменения справочника «Производители рекламных материалов» запрещены!",,,, Отказ);

		КонецЕсли;


	Возврат НЕ Отказ;

КонецФункции // ПроверитьДопустимостьЗаписиОбъекта()

