

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСправочник(Команда)
	ОбновитьСправочникНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСправочникНаСервере()
	
	ТаблицаМетодов = Неопределено;
	ОбменНПСервер.ЗаполнитьСправочникиНП(ТаблицаМетодов, "getMessageCodeText");
	
КонецПроцедуры

#КонецОбласти
