#Область ОбработчикиОсновныхСобытий

&НаСервере	//	LNK 29.09.2023 05:41:09
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	РазрешитьПередачуБонусныхБалловНаБлаготворительныйФонд = УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПредопределенноеЗначение("ПланВидовХарактеристик.ПраваПользователей.РазрешитьПередачуБонусныхБалловНаБлаготворительныйФонд"), Ложь);
	РаботаетАдминистратор = РольДоступна(Метаданные.Роли.АдминистраторСистемы);

	Если РазрешитьПередачуБонусныхБалловНаБлаготворительныйФонд И НЕ РаботаетАдминистратор Тогда

	//	Право разрешения в данном случае используем, как ограничивающее!
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"ВидОперации", 
			Перечисления.ВидыОперацийНачислениеИСписаниеБонусныхБаллов.ПередачаНаБлаготворительныйФонд, 
			Истина
		);

	КонецЕсли;

КонецПроцедуры


#КонецОбласти