//	LNK 04.01.2019 06:49:21
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		ЗаписьНабора.ВремяИзменения = ТекущаяДата();

	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Попытка
		
			УзелПолучатель = ПланыОбмена.ТранспортТерминалов.ПолучитьУзел_TSD_DEPOT();
			
			Если Не УзелПолучатель.Пустая() Тогда
					СписокТоваров = Новый Соответствие;
					
					// А. Собираем товары из строк (если это новая запись или изменение)
					Для Каждого Запись Из ЭтотОбъект Цикл
						Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
							СписокТоваров.Вставить(Запись.Номенклатура, Истина);
						КонецЕсли;
					КонецЦикла;
					
					// Б. Собираем товары из ОТБОРА (если это УДАЛЕНИЕ)
					// При удалении строки набора пусты, но в Отборе указано, кого удаляем.
					Если ЭтотОбъект.Отбор.Номенклатура.Использование Тогда
						СписокТоваров.Вставить(ЭтотОбъект.Отбор.Номенклатура.Значение, Истина);
					КонецЕсли;
					
					// 2. Регистрируем все найденное
					МассивДляРегистрации = New Массив;
					
					// Перекладываем из Соответствия в Массив
					Для Каждого ЭлементКлюч Из СписокТоваров Цикл
						МассивДляРегистрации.Добавить(ЭлементКлюч.Ключ);
					КонецЦикла;
					
					Если МассивДляРегистрации.Количество() > 0 Тогда
						ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, МассивДляРегистрации);
					КонецЕсли;
					
				КонецЕсли;   
			Исключение
			КонецПопытки;
			
		КонецЕсли;		
КонецПроцедуры
