Функция ТипыСертификатов(ВернутьМассив = Ложь)	Экспорт

	ШаблонТипов = Новый Массив;
	ШаблонТипов.Добавить("PL");
	ШаблонТипов.Добавить("PM");	//	LNK 09.04.2021 13:16:31 - для памперсов
	ШаблонТипов.Добавить("EL");
	ШаблонТипов.Добавить("FR");
	ШаблонТипов.Добавить("PT");
//	... добавляем то, что хочется.

	Если ВернутьМассив = Истина Тогда

		СписокТипов = Новый Массив;

	Иначе

		СписокТипов = Новый Соответствие;

	КонецЕсли;

	Для каждого Имя Из ШаблонТипов Цикл

		Если ВернутьМассив = Истина Тогда

			СписокТипов.Добавить(Имя);

		Иначе

			СписокТипов.Вставить(Имя, Истина);

		КонецЕсли;

	КонецЦикла;

	Возврат СписокТипов;

КонецФункции

Функция СимволыИсключитьИзПароля(ВернутьСтроку = Ложь)	Экспорт

	СтрокаСимволов = ":<=>?@;[\]^_`0";

	Если ВернутьСтроку = Истина Тогда

		СписокСимволов = СтрокаСимволов;

	Иначе

		СписокСимволов = Новый Соответствие;

		Для Позиция = 1 По СтрДлина(СтрокаСимволов) Цикл

			СписокСимволов.Вставить(Сред(СтрокаСимволов, Позиция, 1), Истина);

		КонецЦикла;

	КонецЕсли;

	Возврат СписокСимволов;

КонецФункции

Функция МаскиСертификатов()	Экспорт

	СписокМасок = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВладельцы.Ссылка КАК Владелец,
	|	ТаблицаВладельцы.Номинал КАК Номинал,
	|	ПОДСТРОКА(ТаблицаСерийныеНомера.КодСерийногоНомера, 1, 2) КАК ТипСертификата
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаВладельцы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СерийныеНомера КАК ТаблицаСерийныеНомера
	|		ПО ТаблицаВладельцы.Ссылка = ТаблицаСерийныеНомера.Владелец
	|ГДЕ
	|	ТаблицаВладельцы.ИспользоватьСерийныеНомера
	|	И ТаблицаВладельцы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)"
	);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		СписокМасок.Вставить(ПодарочныеСертификатыСервер.МаскаТипНоминал(Выборка.ТипСертификата, Выборка.Номинал), Истина);

	КонецЦикла;

	Возврат СписокМасок;

КонецФункции

Функция ДлинаМаски()	Экспорт

	Возврат 7;	//	2 символа "Тип" + 5 символов "Номинал"

КонецФункции






