#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ РольДоступна(Метаданные.Роли.АдминистраторСистемы) Тогда

		Отказ = Истина;

	Иначе

		Если ТехническаяПоддержкаПовтИсп.ОтладочныйРежимРаботы() Тогда

			Элементы.УчтеноNavision.ТолькоПросмотр = Ложь;

		КонецЕсли;

		Элементы.ФормаКомандаУстановитьВерсиюОбъекта.Доступность = НЕ Запись.Объект = Неопределено;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)


КонецПроцедуры

#КонецОбласти

&НаСервере	//	LNK 12.04.2022 05:58:30
Функция КомандаУстановитьВерсиюОбъектаНаСервере()

	Установлено	  = Ложь;
	ВерсияОбъекта = РегистрыСведений.ОбъектУчтенВNavision.ПолучитьВерсиюДанных(Запись.Объект);

	Если НЕ (ПустаяСтрока(ВерсияОбъекта) ИЛИ ВерсияОбъекта = Запись.ВерсияОбъекта) Тогда

		Запись.ВерсияОбъекта = ВерсияОбъекта;
		Установлено = Истина;

	КонецЕсли;

	Возврат Установлено;

КонецФункции

&НаКлиенте
Процедура КомандаУстановитьВерсиюОбъекта(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьВерсиюОбъектаНаКлиенте", ЭтотОбъект);

	ПоказатьВопрос(ОписаниеОповещения
		, "Версия объекта в текущей записи будет актуализирована!"
		, РежимДиалогаВопрос.ОКОтмена
		, 30
		, КодВозвратаДиалога.ОК
		, "Версия объекта"
		, КодВозвратаДиалога.Отмена
	);

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВерсиюОбъектаНаКлиенте(КодВозврата, ДополнительныеПараметры)	Экспорт

	Если КодВозврата = КодВозвратаДиалога.ОК Тогда

		Если КомандаУстановитьВерсиюОбъектаНаСервере() Тогда

			ПоказатьОповещениеПользователя("Выполнено!",, "Версия объекта установлена!", БиблиотекаКартинок.Информация32);
			Модифицированность = Истина;

		Иначе

			ПоказатьОповещениеПользователя("Отказано!",, "Версия объекта не отличается от текущей!", БиблиотекаКартинок.Предупреждение32);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры










