&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	УстановитьЗначенияРеквизитовФормы();

	Элементы.Список.ТекущаяСтрока = ТекущийУзел;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "СтруктураУзлов.ЗаписанЭлемент"
	ИЛИ	 ИмяСобытия = "УчетнаяПолитика.Изменение"
	Тогда

		УстановитьЗначенияРеквизитовФормы();
		ОбновитьОтображениеДанных();

	КонецЕсли;

КонецПроцедуры

//	---------------------------------------------------------------------------------------

&НаСервере
Процедура УстановитьЗначенияРеквизитовФормы()

	ТекущийУзел = ОбменДаннымиПовтИсп.ПолучитьТекущийЭлементСтруктурыУзлов();
	ИнтервалОграниченияВыгрузкиСообщенияОбмена = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ИнтервалОграниченияВыгрузкиСообщенияОбмена;

КонецПроцедуры


