&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьЗначениеТекущегоУзла();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "СтруктураУзлов.ЗаписанЭлемент" Тогда

		УстановитьЗначениеТекущегоУзла();
		ОбновитьОтображениеДанных();

	КонецЕсли;

КонецПроцедуры

//	---------------------------------------------------------------------------------------

&НаСервере
Процедура УстановитьЗначениеТекущегоУзла()

	ТекущийУзел = ОбменДаннымиПовтИсп.ПолучитьТекущийЭлементСтруктурыУзлов();

КонецПроцедуры


