#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = СокрЛП(Адрес);
	Код = СокрЛП(Идентификатор);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	МассивНепроверяемыхРеквизитов.Добавить("ИДУлицы");
	
	Если ИДУлицы.Пустая() Тогда

		ТекстОшибки = НСтр("ru = 'Не указана улица';uk = 'Не вказана вулиця'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ИДУлицы",
			,
			Отказ
			);
	
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ГородаДоставки.Ссылка
			|ИЗ
			|	Справочник.Улицы КАК Улицы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГородаДоставки КАК ГородаДоставки
			|		ПО Улицы.Город = ГородаДоставки.Ссылка
			|ГДЕ
			|	ГородаДоставки.Ссылка = &Город
			|	И Улицы.Ссылка = &Улица";
		
		Запрос.УстановитьПараметр("Улица", ИДУлицы);
		Запрос.УстановитьПараметр("Город", ИДГорода);
		
		Если Запрос.Выполнить().Пустой() Тогда

			ТекстОшибки = НСтр("ru = 'Улица не соответствует городу';uk = 'Вулиця не відповідає місту'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект,
				"ИДУлицы",
				,
				Отказ
				);
	
		КонецЕсли;

	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	Идентификатор = "";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли