
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	МассивНепроведенныхДокументов = Новый Массив;
	

	Если МассивНепроведенныхДокументов.Количество() = 0 Тогда

		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.РеализацияТоваров",
				"НН",
				ПараметрКоманды,
				ПараметрыВыполненияКоманды.Источник,
				Неопределено);

	КонецЕсли;

КонецПроцедуры








&НаСервере
Процедура ПечатьНННаСервере(ссылка)
	//СхемаКомпоновкиДанных = Документы.РеализацияТоваров.ПолучитьМакет("СКД_НН");

	////создадим компоновщик настроек и загрузим настройки по умолчанию, вместо настроек по умолчанию можно использовать восстановленные настройки
	//КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	//КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	//КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	//Настройки = КомпоновщикНастроек.Настройки;
	//
	//    //установка параметров отчета, без КомпоновщикНастроекКомпоновкиДанных делать это гораздо сложнее
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ссылка",         ссылка);
	//
	//    //Помещаем в переменную данные о расшифровке данных - здесь ненужный пункт, но пусть будет.
	//ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	////Формируем макет, с помощью компоновщика макета
	//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	////Передаем в макет компоновки схему, настройки и данные расшифровки
	//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);

	////Выполним компоновку с помощью процессора компоновки
	//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);

	////Очищаем поле табличного документа
	//Результат = Новый ТабличныйДокумент();
	////Выводим результат в табличный документ
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(Результат);

	//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	//
	//Результат.ОтображатьЗаголовки = Ложь;
	//Результат.ОтображатьСетку = Ложь;
	//Результат.Показать();
	

КонецПроцедуры
