Функция ТипыДанныхРазрешеноУдалить()	Экспорт

	СоставТипов = Новый Соответствие;
	СоставТипов.Вставить(Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных"), Истина);
	СоставТипов.Вставить(Тип("СправочникОбъект.ИдентификаторыОбъектовМетаданных"), Истина);

	Возврат СоставТипов;

КонецФункции // ТипыДанныхРазрешеноУдалить()

Функция ПолучитьРежимФункционала(Имя)	Экспорт	//	LNK 30.09.2020 08:18:49

	Возврат ТехническаяПоддержка.ПолучитьРежимФункционала(Имя);

КонецФункции

#Область ПолучениеФлаговРежимаРаботыСеанса

//	LNK 09.02.2017 14:16:30
Функция ИсключительныйРежим()	Экспорт

	Возврат ТехническаяПоддержкаВызовСервера.ИсключительныйРежим();

КонецФункции

//	LNK 09.10.2020 04:45:41
Функция ВыполняютсяСлужебныеДействия()	Экспорт

	Возврат ТехническаяПоддержкаВызовСервера.ВыполняютсяСлужебныеДействия();

КонецФункции

//	LNK 12.10.2020 07:54:07
Функция ОтладочныйРежимРаботы()	Экспорт

	Возврат ТехническаяПоддержкаВызовСервера.ОтладочныйРежимРаботы();

КонецФункции

#КонецОбласти
