////////////////////////////////////////////////////////////////////////////////
// Подсистема "Префиксация объектов"
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает таблицу префиксообразующих реквизитов, заданных в переопределяемом модуле.
//
Функция ПрефиксообразующиеРеквизиты() Экспорт
	
	Объекты = Новый ТаблицаЗначений;
	Объекты.Колонки.Добавить("Объект");
	Объекты.Колонки.Добавить("Реквизит");
	
	ПрефиксацияОбъектовПереопределяемый.ПолучитьПрефиксообразующиеРеквизиты(Объекты);
	
	РеквизитыОбъектов = Новый Соответствие;
	
	Для каждого Строка Из Объекты Цикл

		РеквизитыОбъектов.Вставить(Строка.Объект.ПолноеИмя(), Строка.Реквизит);

	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(РеквизитыОбъектов);
	
КонецФункции

//	LNK 06.05.2017 07:15:54
Функция ПрефиксообразованиеДляПеремещения(ПолноеИмя)	Экспорт

	ИменаМетаданных = Новый Соответствие;
	ИменаМетаданных.Вставить("Документ.ПеремещениеТоваров", Истина);
	ИменаМетаданных.Вставить("Документ.КорректировкаПеремещения", Истина);

	Возврат ИменаМетаданных.Получить(ПолноеИмя) = Истина;

КонецФункции // ПрефиксообразованиеДляПеремещения()

//	LNK 07.04.2017 16:44:10
Функция ИспользоватьНомерМагазинаКакПрефикс()	Экспорт

	Возврат Константы.ИспользоватьНомерМагазинаКакПрефикс.Получить();

КонецФункции // ИспользоватьНомерМагазинаКакПрефикс()
