//	LNK 05.04.2017 12:07:13
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ЗапроситьСверкуИнформативныеОстаткиТоваровПоМагазинам.Видимость = НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел();

КонецПроцедуры

//	LNK 05.04.2017 12:07:13
&НаСервереБезКонтекста
Процедура ЗапроситьСверкуИнформативныеОстаткиТоваровПоМагазинамНаСервере()

	РегистрыСведений.ИнформативныеОстаткиТоваровПоМагазинам.ЗапроситьСверкуИнформативныеОстаткиТоваровПоМагазинам();

КонецПроцедуры

//	LNK 05.04.2017 12:07:13
&НаКлиенте
Процедура ЗапроситьСверкуИнформативныеОстаткиТоваровПоМагазинам(Команда)

	ЗапроситьСверкуИнформативныеОстаткиТоваровПоМагазинамНаСервере();

КонецПроцедуры
