&НаСервере
Процедура ЗанестиДанныеВРегистр(КодМагазина,ГИГИЕНА,ПИТАНИЕ,ИГРУШКИ,МЕБЕЛЬ,ОБУВЬ,ОДЕЖДА,УСЛУГИ,ГИГИЕНА_инт,ПИТАНИЕ_инт,ИГРУШКИ_инт,МЕБЕЛЬ_инт,ОБУВЬ_инт,ОДЕЖДА_инт)
	
	
	КодМагазина = Число(КодМагазина);
	Магазин =  Справочники.Магазины.НайтиПоРеквизиту("НомерМагазина",КодМагазина); 
	Если не Магазин=Справочники.Магазины.ПустаяСсылка() Тогда
		СуммаПлана=0;
		НовыйПлан = РегистрыСведений.ПланыПродаж.СоздатьНаборЗаписей();
		//НовыйПлан.Период=НачалоМесяца(ДатаЗагрузки);
		НовыйПлан.Отбор.Магазин.Установить(Магазин);  
		НовыйПлан.Отбор.Период.Установить(НачалоМесяца(ДатаЗагрузки));
		//НовыйПлан.Магазин=Магазин;
		
		ПроектГигиена = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ГИГИЕНА",Истина);
		Если ГИГИЕНА<>"" и  Лев(ГИГИЕНА,1)<>"-" и ПроектГигиена<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьГигиена =  НовыйПлан.Добавить();
				ЗаписьГигиена.Магазин = Магазин;
				ЗаписьГигиена.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьГигиена.Проект = ПроектГигиена;
				ЗаписьГигиена.Сумма=Число(ГИГИЕНА);
				Если ГИГИЕНА_инт<>"" и  Лев(ГИГИЕНА_инт,1)<>"-" Тогда
					ЗаписьГигиена.СуммаИнтернет = Число(ГИГИЕНА_инт);	
				Иначе
					ЗаписьГигиена.СуммаИнтернет = 0;	
				КонецЕсли;	
				//СуммаПлана=СуммаПлана+Число(ГИГИЕНА);
				ЗаписьГигиена.Активность = Истина;
			Исключение
				Сообщить("ОШИБКА Гигиена "+ГИГИЕНА+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектПитание = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ПИТАНИЕ",Истина);
		Если ПИТАНИЕ<>"" и  Лев(ПИТАНИЕ,1)<>"-" и ПроектПитание<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьПитание =  НовыйПлан.Добавить();
				ЗаписьПитание.Магазин = Магазин;
				ЗаписьПитание.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьПитание.Проект = ПроектПитание;
				ЗаписьПитание.Сумма=Число(ПИТАНИЕ);
				Если ПИТАНИЕ_инт<>"" и  Лев(ПИТАНИЕ_инт,1)<>"-" Тогда
					ЗаписьПитание.СуммаИнтернет = Число(ПИТАНИЕ_инт);
			    Иначе
					ЗаписьПитание.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьПитание.Активность = Истина;
				//СуммаПлана=СуммаПлана+Число(ПИТАНИЕ);
			Исключение
				Сообщить("ОШИБКА ПИТАНИЕ "+ПИТАНИЕ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектИгрушка = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ИГРУШКА",Истина);
		Если ИГРУШКИ<>"" и  Лев(ИГРУШКИ,1)<>"-" и ПроектИгрушка<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьИгрушка =  НовыйПлан.Добавить();
				ЗаписьИгрушка.Магазин = Магазин;
				ЗаписьИгрушка.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьИгрушка.Проект = ПроектИгрушка;
				ЗаписьИгрушка.Сумма=Число(ИГРУШКИ);
				Если ИГРУШКИ_инт<>"" и  Лев(ИГРУШКИ_инт,1)<>"-" Тогда
					ЗаписьИгрушка.СуммаИнтернет = Число(ИГРУШКИ_инт);
			    Иначе
					ЗаписьИгрушка.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьИгрушка.Активность = Истина;

			Исключение
				Сообщить("ОШИБКА ИГРУШКИ "+ИГРУШКИ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектМебель = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("МЕБЕЛЬ",Истина);
		Если МЕБЕЛЬ<>"" и  Лев(МЕБЕЛЬ,1)<>"-" и ПроектМебель<>Справочники.ВидыНоменклатуры.ПустаяСсылка()  Тогда
			попытка
				ЗаписьМебель =  НовыйПлан.Добавить();
				ЗаписьМебель.Магазин = Магазин;
				ЗаписьМебель.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьМебель.Проект = ПроектМебель;
				ЗаписьМебель.Сумма=Число(МЕБЕЛЬ);
				Если МЕБЕЛЬ_инт<>"" и  Лев(МЕБЕЛЬ_инт,1)<>"-" Тогда
					ЗаписьМебель.СуммаИнтернет = Число(МЕБЕЛЬ_инт);
			    Иначе
					ЗаписьМебель.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьМебель.Активность = Истина;
			Исключение
				Сообщить("ОШИБКА МЕБЕЛЬ "+МЕБЕЛЬ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектОбувь = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ОБУВЬ",Истина);
		Если ОБУВЬ<>"" и  Лев(ОБУВЬ,1)<>"-" и ПроектОбувь<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьОбувь =  НовыйПлан.Добавить();
				ЗаписьОбувь.Магазин = Магазин;
				ЗаписьОбувь.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьОбувь.Проект = ПроектОбувь;
				ЗаписьОбувь.Сумма=Число(ОБУВЬ);
				Если ОБУВЬ_инт<>"" и  Лев(ОБУВЬ_инт,1)<>"-" Тогда
					ЗаписьОбувь.СуммаИнтернет = Число(ОБУВЬ_инт);
			    Иначе
					ЗаписьОбувь.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьОбувь.Активность = Истина;

			Исключение
				Сообщить("ОШИБКА ОБУВЬ "+ОБУВЬ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектОдежда = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("ОДЕЖДА",Истина);
		Если ОДЕЖДА<>"" и  Лев(ОДЕЖДА,1)<>"-" и ПроектОдежда<>Справочники.ВидыНоменклатуры.ПустаяСсылка() Тогда
			попытка
				ЗаписьОдежда =  НовыйПлан.Добавить();
				ЗаписьОдежда.Магазин = Магазин;
				ЗаписьОдежда.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьОдежда.Проект = ПроектОдежда;
				ЗаписьОдежда.Сумма=Число(ОДЕЖДА);
				Если ОДЕЖДА_инт<>"" и  Лев(ОДЕЖДА_инт,1)<>"-" Тогда
					ЗаписьОдежда.СуммаИнтернет = Число(ОДЕЖДА_инт);
			    Иначе
					ЗаписьОдежда.СуммаИнтернет = 0;
				КонецЕсли;	
				ЗаписьОдежда.Активность = Истина;

			Исключение
				Сообщить("ОШИБКА ОДЕЖДА "+ОДЕЖДА+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		ПроектУслуги = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Продажа услуг",Истина);
		Если УСЛУГИ<>"" и  Лев(УСЛУГИ,1)<>"-" Тогда
			попытка
				ЗаписьУслуги =  НовыйПлан.Добавить();
				ЗаписьУслуги.Магазин = Магазин;
				ЗаписьУслуги.Период = НачалоМесяца(ДатаЗагрузки);
				ЗаписьУслуги.Проект = ПроектУслуги;
				ЗаписьУслуги.Сумма=Число(УСЛУГИ);
				ЗаписьУслуги.Активность = Истина;

			Исключение
				Сообщить("ОШИБКА УСЛУГИ "+УСЛУГИ+" "+КодМагазина);
			КонецПопытки
		Конецесли;
		
		
			//попытка
			//	НовыйПлан.Сумма=Число(СуммаПлана);
			//Исключение
			//	Сообщить("ОШИБКА СуммаПлана "+Строка(СуммаПлана)+" "+КодМагазина);
			//КонецПопытки;
			попытка		
				НовыйПлан.Записать(Истина);
			исключение
				Сообщить("не удалось записать магазин - "+ КодМагазина);

			КонецПопытки
	Иначе
		Сообщить("не найден магазин - "+ КодМагазина);
	Конецесли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьТаблицу(Команда)
	ошибка=ложь;
	НомерСтроки=3;
	
		

	КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
	

	пока  КодМагазина<>"" цикл
				
		//НомерСтроки=НомерСтроки+1;
		КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
		ГИГИЕНА = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(3,"ЧГ=")).Текст)," ","");
		ПИТАНИЕ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(4,"ЧГ=")).Текст)," ","");
		ИГРУШКИ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(5,"ЧГ=")).Текст)," ","");
		МЕБЕЛЬ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(6,"ЧГ=")).Текст)," ","");
		ОБУВЬ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(7,"ЧГ=")).Текст)," ","");
		ОДЕЖДА = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(8,"ЧГ=")).Текст)," ","");
		УСЛУГИ = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(9,"ЧГ=")).Текст)," ","");
		
		ГИГИЕНА_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(10,"ЧГ=")).Текст)," ","");
		ПИТАНИЕ_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(11,"ЧГ=")).Текст)," ","");
		ИГРУШКИ_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(12,"ЧГ=")).Текст)," ","");
		МЕБЕЛЬ_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(13,"ЧГ=")).Текст)," ","");
		ОБУВЬ_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(14,"ЧГ=")).Текст)," ","");
		ОДЕЖДА_инт = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(15,"ЧГ=")).Текст)," ","");
		
		Если КодМагазина<>"END" Тогда
			ЗанестиДанныеВРегистр(КодМагазина,ГИГИЕНА,ПИТАНИЕ,ИГРУШКИ,МЕБЕЛЬ,ОБУВЬ,ОДЕЖДА,УСЛУГИ,ГИГИЕНА_инт,ПИТАНИЕ_инт,ИГРУШКИ_инт,МЕБЕЛЬ_инт,ОБУВЬ_инт,ОДЕЖДА_инт);
			Состояние(Строка(НомерСтроки));	
		конецесли;
		
		НомерСтроки=НомерСтроки+1;
		КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
		обработкапрерыванияпользователя();
		
	конеццикла;
    ПоказатьПредупреждение(, "Данные загружены");	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаЗагрузки = НачалоМесяца(текущаядата());
КонецПроцедуры


