
&НаСервере
Процедура АктивныеТревогиНаСервере()

	ОбменДаннымиСервисТревог.ОбновитьКартуТревог();

КонецПроцедуры

&НаКлиенте
Процедура АктивныеТревоги(Команда)
	АктивныеТревогиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсторияТревогНаСервере()
	ОбменДаннымиСервисТревог.ПолучитьИсториюТревогЗаМесяц();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияТревог(Команда)
	ИсторияТревогНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗагрузитьКартуТревог(Команда)
	ОткрытьФорму("РегистрСведений.КартаТревог.Форма.ФормаЗагрузкиТревог",Новый Структура,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
