///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБЩЕГО НАЗНАЧЕНИЯ 

#Если НЕ Клиент И НЕ ВнешнееСоединение Тогда
	
// Функция возвращает значение экспортных переменных модуля приложений из параметра сеанса
// Необходмо для возможности создания объектов на сервере
Функция глЗначениеПеременной(Имя) Экспорт
	
	Кэш = ПараметрыСеанса.ОбщиеЗначения.Получить();
	КэшИзменен = Ложь;
	ПолученноеЗначение = ОбщегоНазначенияРТ.ПолучитьЗначениеПеременной(Имя, Кэш, КэшИзменен);
	
	Если КэшИзменен Тогда
		ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Кэш);
	КонецЕсли;
	
	Возврат ПолученноеЗначение;
	
КонецФункции

// Процедура установки значения экспортных переменных модуля приложения
//
// Параметры
//  Имя - строка, содержит имя переменной целиком
// 	Значение - значение переменной
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	Кэш = ПараметрыСеанса.ОбщиеЗначения.Получить();
	ОбщегоНазначенияРТ.УстановитьЗначениеПеременной(Имя, Кэш, Значение);
	ПараметрыСеанса.ОбщиеЗначения = Новый ХранилищеЗначения(Кэш);
	
КонецПроцедуры

#КонецЕсли

#Если Клиент ИЛИ ТонкийКлиент ИЛИ ВебКлиент Тогда

//	LNK 03.03.2024 07:13:30
Процедура ПроверитьОповещенияПользователя()	Экспорт

	ВыполнитьОчистку = Ложь;
	СписокОповещений = ТехническаяПоддержкаВызовСервера.ПолучитьОповещенияПользователя();

	Для каждого СоставОповещения Из СписокОповещений Цикл

		Если СоставОповещения.Оповестить = Истина Тогда

			Оповестить(СоставОповещения.ИмяСобытия, СоставОповещения.Параметр, "ГлобальныйМодуль.ПроверитьОповещенияПользователя");

		КонецЕсли;

		СоставОповещения.Выполнено = Истина;
		ВыполнитьОчистку = Истина;

	КонецЦикла;

	Если ВыполнитьОчистку Тогда

		ТехническаяПоддержкаВызовСервера.УдалитьОповещенияПользователя(СписокОповещений);

	КонецЕсли;

КонецПроцедуры

#КонецЕсли


