#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗаписьСуществует(КлючиЗаписи)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ОбъектыПроблемныеДоВыяснения КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Объект = &Объект
	|	И ТаблицаРегистра.Магазин = &Магазин
	|	И ТаблицаРегистра.Статус = &Статус
	|	И ТаблицаРегистра.Источник = &Источник
	|	И (ВЫРАЗИТЬ(ТаблицаРегистра.Комментарий КАК СТРОКА(800))) = (ВЫРАЗИТЬ(&Комментарий КАК СТРОКА(800)))"
	);
	Запрос.УстановитьПараметр("Объект"		, КлючиЗаписи.Объект);
	Запрос.УстановитьПараметр("Магазин"		, КлючиЗаписи.Магазин);
	Запрос.УстановитьПараметр("Статус"		, КлючиЗаписи.Статус);
	Запрос.УстановитьПараметр("Источник"	, КлючиЗаписи.Источник);
	Запрос.УстановитьПараметр("Комментарий"	, КлючиЗаписи.Комментарий);

	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
