//	LNK 29.01.2019 14:33:14
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		Если ЗаписьНабора.Автор.Пустая() Тогда

			ЗаписьНабора.Автор = ?(ПараметрыСеанса.ТекущийПользователь.Пустая()
				, Справочники.Пользователи.АдминистраторАвтоматов
				, ПараметрыСеанса.ТекущийПользователь
			);

		КонецЕсли;

		Если ЗаписьНабора.Магазин.Пустая() Тогда

			ЗаписьНабора.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
