#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)	//	LNK 07.10.2020 13:04:42

	Если ОбменДанными.Загрузка Тогда

		Если НЕ ЭтоНовый() И ОбменДаннымиПовтИсп.ЭтоТестовыйУзел() Тогда

			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ТаблицаСправочник.Интеграция КАК Интеграция,
			|	ТаблицаСправочник.ТипИнтернетБанкинга КАК ТипИнтернетБанкинга,
			|	ТаблицаСправочник.СуммаМинимальногоКредита КАК СуммаМинимальногоКредита,
			|	ТаблицаСправочник.АдресацияAPI.(
			|		НомерСтроки КАК НомерСтроки,
			|		Адрес КАК Адрес,
			|		Активен КАК Активен,
			|		Идентификатор КАК Идентификатор,
			|		Ключ КАК Ключ,
			|		Комментарий КАК Комментарий,
			|		ТипУслуги КАК ТипУслуги
			|	) КАК АдресацияAPI
			|ИЗ
			|	Справочник.КлассификаторБанков КАК ТаблицаСправочник
			|ГДЕ
			|	ТаблицаСправочник.Ссылка = &ТекущаяСсылка"
			);
			Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
			
			ДанныеСсылки = Запрос.Выполнить().Выбрать();
			
			Если ДанныеСсылки.Следующий() Тогда

				Интеграция = ДанныеСсылки.Интеграция;
				ТипИнтернетБанкинга = ДанныеСсылки.ТипИнтернетБанкинга;
				СуммаМинимальногоКредита = ДанныеСсылки.СуммаМинимальногоКредита;

				АдресацияAPI.Загрузить(ДанныеСсылки.АдресацияAPI.Выгрузить());

			КонецЕсли;

		КонецЕсли;

		Возврат;

	КонецЕсли;

//	=======================================================================================


КонецПроцедуры

#КонецЕсли




