
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СотрудникКоллЦентра") Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("СотрудникКоллЦентра", Параметры.СотрудникКоллЦентра);
	Иначе 
		Список.Параметры.УстановитьЗначениеПараметра("СотрудникКоллЦентра", "");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("ОбщаяФорма.ФормаВходящегоЗвонкаКлиента", Новый Структура("Объект", Элемент.ТекущиеДанные.Контрагент), ЭтаФорма); 
	
КонецПроцедуры
