//	LNK 30.01.2019 14:27:07
Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел()
	И НЕ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "СлужебнаяЗапись", Ложь) = Истина Тогда

		Если НЕ Количество() = 0 Тогда

			Если НЕ ПустаяСтрока(ЭтотОбъект[0].Имя) И Справочники.ИменаЛюдей.ИмяКорректно(ЭтотОбъект[0].Имя,, ЭтотОбъект[0].ФизЛицо) Тогда

			//	пока неясно, чё делать

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
