
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

//Формируются списки доступных операндов, операторов
//Возвращает дерево операторов, возможных для ввода в формулах
//
Функция ПостроитьДеревоОператоров() Экспорт
	
	Дерево = РаботаСФормулами.ПолучитьПустоеДеревоОператоров();
	
	ГруппаОператоров = РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, "Операторы");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "+", " + ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "-", " - ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "*", " * ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "/", " / ");
	
	ГруппаОператоров = РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, "Логические операторы и константы");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "<", " < ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, ">", " > ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "<=", " <= ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, ">=", " >= ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "=", " = ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "<>", " <> ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "И", " И ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "ИЛИ", " ИЛИ ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "НЕ", " НЕ ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "ИСТИНА", " ИСТИНА ");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "ЛОЖЬ", " ЛОЖЬ ");
	
	ГруппаОператоров = РаботаСФормулами.ДобавитьГруппуОператоров(Дерево, "Функции");
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "Максимум", "Макс(,)", 2);
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "Минимум", "Мин(,)", 2);
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "Округление", "Окр(,)", 2);
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "Целая часть", "Цел()", 1);
	РаботаСФормулами.ДобавитьОператор(Дерево, ГруппаОператоров, "Условие", "?(,,)", 3);
	
	Возврат Дерево;
		
КонецФункции // ПостроитьДеревоОператоров()
