&НаКлиенте
Перем СтарыйМагазин;

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
	ОбщегоНазначенияРТ.ЗаполнитьШапкуДокумента(Объект,КартинкаСостоянияДокумента,СостояниеДокумента,РазрешеноПроведение);
	
	НастроитьФормуПоДополнительнымПравам();
	
	ЗаполнитьСуммыСервер();

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	ОбщегоНазначенияРТКлиентСервер.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	
	НастроитьФормуПоДополнительнымПравам();
	
	ЗаполнитьСуммыСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщегоНазначенияРТКлиентСервер.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	НастроитьФормуПоДополнительнымПравам();
	
	ЗаполнитьСуммыСервер();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	
	Если Объект.ОтчетыОРозничныхПродажах.Количество() > 0  Тогда
	
		ТекстаВопроса = НСтр("ru = 'Очистить табличную часть?'");
		Ответ = Вопрос(ТекстаВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.ОтчетыОРозничныхПродажах.Очистить();
		Иначе
			Объект.Магазин = СтарыйМагазин;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МагазинНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтарыйМагазин = Объект.Магазин;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ОткрытьФормуРедактированияКомментария(Элемент.ТекстРедактирования, Объект.Комментарий, Модифицированность);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ "ОтчетыОРозничныхПродажах"

&НаКлиенте
Процедура ОтчетыОРозничныхПродажахОтчетОРозничныхПродажахПриИзменении(Элемент)
	
	СтрокаТаблицы = Элементы.ОтчетыОРозничныхПродажах.ТекущиеДанные;
	
	Если НЕ СтрокаТаблицы = Неопределено Тогда
		СтруктураСумм = СтруктураСуммВСтроке(СтрокаТаблицы.ОтчетОРозничныхПродажах);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураСумм);
		ЗаполнитьПодвалКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыОРозничныхПродажахПослеУдаления(Элемент)
	
	ЗаполнитьПодвалКлиент();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧасть(Команда)
	// Вставить содержимое обработчика.
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Сообщить(НСтр("ru = 'Не выбрана организация!'"),СтатусСообщения.Внимание);
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Магазин) Тогда
		
		Сообщить(НСтр("ru = 'Не выбран магазин'"),СтатусСообщения.Внимание);
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ОтчетыОРозничныхПродажах.Количество() > 0 Тогда
		Результат = Вопрос(НСтр("ru = 'Перед заполнением табличная часть будет очищена. Продолжить?'"),
									РежимДиалогаВопрос.ДаНет);
		
		Если Результат = КодВозвратаДиалога.Да Тогда
			Объект.ОтчетыОРозничныхПродажах.Очистить();
		Иначе
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьТабличнуюЧастьНаСервере();
	
	Если Объект.ОтчетыОРозничныхПродажах.Количество() = 0 Тогда
		Сообщить(НСтр("ru = 'Все отчеты о розничных продажах включены в сводные отчеты'"),СтатусСообщения.Внимание);
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьСуммыСервер()
	
	Для каждого СтрокаТаблицы Из Объект.ОтчетыОРозничныхПродажах Цикл
		
		СтруктураСумм = СтруктураСуммВСтроке(СтрокаТаблицы.ОтчетОРозничныхПродажах);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураСумм);
		
	КонецЦикла;
	
	ЗаполнитьПодвалСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьНаСервере()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументСсылка", Объект.Ссылка);
	СтруктураПараметров.Вставить("Дата"          , Объект.Дата);
	СтруктураПараметров.Вставить("Организация"   , Объект.Организация);
	СтруктураПараметров.Вставить("Магазин"       , Объект.Магазин);
	
	ДеревоОтчетов = РозничныеПродажиСервер.ПолучитьОтчетыОРозничныхПродажахДляСводногоОтчета(СтруктураПараметров);
	
	Если ДеревоОтчетов.Строки.Количество() > 0 Тогда
		
		Для каждого СтрокаОрганизации Из ДеревоОтчетов.Строки[0].Строки Цикл
			
			СтрокаТаблицы = Объект.ОтчетыОРозничныхПродажах.Добавить();
			
			СтрокаТаблицы.ОтчетОРозничныхПродажах = СтрокаОрганизации.ОтчетОРозничныхПродажах;
			СтруктураСумм = СтруктураСуммВСтроке(СтрокаТаблицы.ОтчетОРозничныхПродажах);
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураСумм);
			
		КонецЦикла;
		ЗаполнитьПодвалСервер();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоДополнительнымПравам()

	УправлениеПользователями.УстановитьТолькоПросмотрДляРеквизитовТабличнойЧасти(Элементы.Дата.ТолькоПросмотр, 
																				 ПланыВидовХарактеристик.ПраваПользователей.ИзменятьДату);
//	LNK 04.01.2017 13:54:53
	УправлениеПользователями.УстановитьТолькоПросмотрДляРеквизитовТабличнойЧасти(Элементы.Номер.ТолькоПросмотр,
																				 ПланыВидовХарактеристик.ПраваПользователей.ИзменятьНомерДокумента);

КонецПроцедуры

&НаСервере
Функция СтруктураСуммВСтроке(ОтчетОРозничныхПродажах)
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("СуммаДокумента", ОтчетОРозничныхПродажах.СуммаДокумента);
	СтруктураРезультат.Вставить("СуммаВозвратов", ОтчетОРозничныхПродажах.СуммаВозвратов);
	СтруктураРезультат.Вставить("СуммаПродажи",   СтруктураРезультат.СуммаДокумента + СтруктураРезультат.СуммаВозвратов);
	
	Возврат СтруктураРезультат;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПодвалКлиент()
	
	СуммаПоДокументам = Объект.ОтчетыОРозничныхПродажах.Итог("СуммаДокумента");
	СуммаПродаж       = Объект.ОтчетыОРозничныхПродажах.Итог("СуммаПродажи");
	СуммаВозвратов    = Объект.ОтчетыОРозничныхПродажах.Итог("СуммаВозвратов");
	
	Элементы.ОтчетыОРозничныхПродажахСуммаДокумента.ТекстПодвала = Формат(Объект.ОтчетыОРозничныхПродажах.Итог("СуммаДокумента"), "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
	Элементы.ОтчетыОРозничныхПродажахСуммаВозвратов.ТекстПодвала = Формат(Объект.ОтчетыОРозничныхПродажах.Итог("СуммаВозвратов"), "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
	Элементы.ОтчетыОРозничныхПродажахСуммаПродажи.ТекстПодвала   = Формат(Объект.ОтчетыОРозничныхПродажах.Итог("СуммаПродажи"), "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодвалСервер()
	
	СуммаПоДокументам = Объект.ОтчетыОРозничныхПродажах.Итог("СуммаДокумента");
	СуммаПродаж       = Объект.ОтчетыОРозничныхПродажах.Итог("СуммаПродажи");
	СуммаВозвратов    = Объект.ОтчетыОРозничныхПродажах.Итог("СуммаВозвратов");
	
	Элементы.ОтчетыОРозничныхПродажахСуммаДокумента.ТекстПодвала = Формат(СуммаПоДокументам, "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
	Элементы.ОтчетыОРозничныхПродажахСуммаВозвратов.ТекстПодвала = Формат(СуммаВозвратов   , "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
	Элементы.ОтчетыОРозничныхПродажахСуммаПродажи.ТекстПодвала   = Формат(СуммаПродаж      , "ЧЦ=15; ЧДЦ=2; ЧГ=3,0");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
