//	LNK 28.12.2016 13:48:16
Функция ДоступныДокументыИнвентаризации(Отказ, ПроверитьОснование = Ложь, ДокументОснование = Неопределено, ДополнительноеРазрешение = Ложь, СообщитьОбОшибке = Истина)	Экспорт

	ЕстьДоступ = РольДоступна("ДобавлениеИзменениеПриказНаПроведениеИнвентаризацииТоваров")
			ИЛИ  РольДоступна("АдминистраторСистемы") И УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя(ПланыВидовХарактеристик.ПраваПользователей.ДоступностьПодсистемыДокументыИнвентаризации, Ложь)
			ИЛИ  ДополнительноеРазрешение = Истина;

	Если ПроверитьОснование = Истина Тогда

	//	Некоторые документы (например "ОприходованиеТоваров", "СписаниеТоваров") могут быть введены на основании приказа.
	//	А могут и не быть на основании приказа. Поэтому все пользователи имеют к таким документам доступ,
	//	если у них есть соответствующие роли (условие выше) либо когда основание определённого типа не указано.
		ЕстьДоступ = ЕстьДоступ ИЛИ НЕ ОбщегоНазначенияКлиентСервер.АтрибутТипаУказан(ДокументОснование, Тип("ДокументСсылка.ПриказНаПроведениеИнвентаризацииТоваров"));

	КонецЕсли;

	Если НЕ ЕстьДоступ Тогда

		Отказ = Истина;

		Если СообщитьОбОшибке = Истина Тогда

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отказано. Не предоставлена роль «Добавление / Изменение Приказов На Проведение Инвентаризации Товаров»");

		КонецЕсли;

	КонецЕсли;

	Возврат НЕ Отказ;

КонецФункции // ДоступныДокументыИнвентаризации()

//	LNK 17.10.2019 14:28:56
Процедура ПриСозданииФормыНаСервере(Форма)	Экспорт

	Для каждого Элемент Из Форма.Элементы Цикл

		ТипЭлемента = ТипЗнч(Элемент);

		Если ТипЭлемента = Тип("ГруппаФормы") Тогда

			а = 22;

		ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда

			Если Элемент.Вид = ВидПоляФормы.ПолеВвода Тогда

				СвойствоУстановитьПриУсловии("ИсторияВыбораПриВводе", NULL, ИсторияВыбораПриВводе.НеИспользовать, Элемент);
				СвойствоУстановитьПриУсловии("КнопкаСоздания", Истина, Ложь, Элемент);

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

//	LNK 17.10.2019 14:59:12
Процедура СвойствоУстановитьПриУсловии(ИмяСвойства, Условие, Значение, Элемент)

	Попытка

		Если Элемент[ИмяСвойства] = Условие ИЛИ Условие = NULL Тогда

			Элемент[ИмяСвойства] = Значение;

		КонецЕсли;

	Исключение

		ТекстОшибки = ОписаниеОшибки();

	КонецПопытки;

КонецПроцедуры
