//	LNK 22.11.2020 12:37:03
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел()  Тогда

		Если НЕ Отбор.Объект.Значение = Неопределено
			И ОбменДаннымиПовтИсп.ПланОбменаСодержитОбъект("ОбменNavisionРозница", Отбор.Объект.Значение.Метаданные().ПолноеИмя())	Тогда

			Если ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "НеПроверятьРегистрациюВОбменNavision", Ложь) = Ложь
				И НЕ Количество() = 0	Тогда

				Если ЭтотОбъект[0].ОбменNavision Тогда

					ПланыОбмена.ЗарегистрироватьИзменения(ВнешниеИсточникиПовтИсп.СписокУзловNavision(Истина), ЭтотОбъект);

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
