#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПосылкаВДороге(ДокументЭН) Экспорт
	
	Возврат Не (ПустаяСтрока(ДокументЭН.Номер)
		Или ОбменНПСервер.ПроверитьРедактирование(ДокументЭН.Номер, ДокументЭН.ТелефонПолучатель) = 1);
		
КонецФункции

Процедура ОтменитьПосылку(ДокументЭН) Экспорт
	
	Если Не ПосылкаВДороге(ДокументЭН) Тогда
		
		СтатусТТН = Справочники.КодыСтатусовТТН.НайтиПоРеквизиту("СтатусПосылки", Перечисления.СтатусыПосылокСлужбыДоставки.Отменена);

		ТекДата = ТекущаяДатаСеанса();	
		НаборЗаписей = СоздатьНаборЗаписей(); 
	
		НаборЗаписей.Отбор.ДокументРегистратор.Установить(ДокументЭН.Ссылка); 
		НаборЗаписей.Отбор.Период.Установить(ТекДата); 

		НоваяЗапись 					= НаборЗаписей.Добавить();
		НоваяЗапись.ДокументРегистратор	= ДокументЭН.Ссылка; 
		НоваяЗапись.Период 				= ТекДата;
		НоваяЗапись.СтатусЭН   			= СтатусТТН; 
		НаборЗаписей.Записать();  

	КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли