
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры 

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;
	
//	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
//
//		СтатусПосылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьНабора.СтатусЭН, "СтатусПосылки");
//		Запрос = Новый Запрос;
//		Запрос.Текст =
//			"ВЫБРАТЬ
//			|	ВозвратИнтернетЗаказа.Ссылка
//			|ИЗ
//			|	Документ.ВозвратИнтернетЗаказа КАК ВозвратИнтернетЗаказа
//			|ГДЕ
//			|	ВозвратИнтернетЗаказа.ЭлектроннаяНакладная = &ЭлектроннаяНакладная";
//		
//		Запрос.УстановитьПараметр("ЭлектроннаяНакладная", ЗаписьНабора.ДокументРегистратор);
//		
//		РезультатЗапроса = Запрос.Выполнить();
//		
//		Выборка = РезультатЗапроса.Выбрать();
//		
//		Пока Выборка.Следующий() Цикл
//			
//			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
//			ДокументИзменен = Ложь;
//			
//			Если СтатусПосылки = Перечисления.СтатусыПосылокСлужбыДоставки.ВДороге Тогда
//				
//				ДокументОбъект.Статус = Перечисления.СтатусыВозвратаЗаказаПокупателя.Отправлен;
//				ДокументИзменен = Истина;
//				
//			ИначеЕсли СтатусПосылки = Перечисления.СтатусыПосылокСлужбыДоставки.Доставлена Тогда
//				
//				ДокументОбъект.Статус = Перечисления.СтатусыВозвратаЗаказаПокупателя.Доставлен;
//				ДокументИзменен = Истина;
//				
//			ИначеЕсли СтатусПосылки = Перечисления.СтатусыПосылокСлужбыДоставки.Получена Тогда
//				
//				ДокументОбъект.Статус = Перечисления.СтатусыВозвратаЗаказаПокупателя.Чек;
//				ДокументИзменен = Истина;
//				
//			КонецЕсли;
//			
//			Если ДокументИзменен Тогда
//				
//				ДокументОбъект.Записать();
//				
//			КонецЕсли;
//
//		КонецЦикла;
//
//	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
