#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьИсториюРеквизита(Номенклатура, Реквизит, Значение,РежимОбменДанными=ЛОЖЬ,ЗначенияПолей = ЛОЖЬ)	Экспорт

	
//	А++ 20240919 по задаче национального КЭШБЭКА
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияИзмененияРеквизитовНоменклатурыСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ИсторияИзмененияРеквизитовНоменклатуры.СрезПоследних(
		|			,
		|			Номенклатура = &Номенклатура
		|				И Реквизит = &Реквизит) КАК ИсторияИзмененияРеквизитовНоменклатурыСрезПоследних";
	
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Реквизит", Реквизит);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Значение = Значение Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПривилегированныйРежим() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИсторияИзмененияРеквизитовНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата());
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	НаборЗаписей.Отбор.Реквизит.Установить(Реквизит);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Период  = НаборЗаписей.Отбор.Период.Значение;
	ЗаписьНабора.Номенклатура = НаборЗаписей.Отбор.Номенклатура.Значение;
	ЗаписьНабора.Реквизит  = НаборЗаписей.Отбор.Реквизит.Значение;
	
	Если ЗначенияПолей Тогда
		ЗаписьНабора.ЗначенияПолей  = Значение;
	Иначе
		
		ЗаписьНабора.Значение  = Значение;
	КонецЕсли;
	
	ЗаписьНабора.Пользователь  = Пользователи.ТекущийПользователь();
	
	
	
	НаборЗаписей.Записать();
	
	Если ПривилегированныйРежим() и не РежимОбменДанными Тогда
		
		УстановитьПривилегированныйРежим(ЛОЖЬ);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецЕсли
