//	LNK 23.07.2018 11:58:35
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;
	
	//2026-02-09 sa теперь приняли решение, что сопоставление с должностями ЗУП производится только по УИД ЗУПа
	//сопоставление с должностями Табельной базы (retail) больше не производится.
	Возврат;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДолжностиОрганизаций.Представление КАК Представление
	|ИЗ
	|	Справочник.ДолжностиОрганизаций КАК ДолжностиОрганизаций
	|ГДЕ
	|	НЕ ДолжностиОрганизаций.Ссылка = &ТекущаяСсылка
	|	И ДолжностиОрганизаций.КодКП = &КодКП"
	);
	Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
	Запрос.УстановитьПараметр("КодКП", КодКП);
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда

		Сообщить("Отказано! Указанный 'Код КП' = " + КодКП + " уже используется.");

		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл

			Сообщить(Выборка.Представление);

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
