
// Функция получает значение функциональной опции "КонтролироватьАссортимент"
// Параметры: 
//		Магазин - СправочникСсылка.Магазины - магазин, для которого определяется контроль ассортимента.
// Возвращаемое значение: 
// 		Результат - Булево - значение функицональной опции "КонтролироватьАссортимент"
Функция КонтролироватьАссортимент(Магазин) Экспорт
	
	Результат = Ложь;
	ИспользоватьАссортимент = ИспользоватьАссортимент();
	Если ИспользоватьАссортимент Тогда
		Результат = ПолучитьФункциональнуюОпцию("КонтролироватьАссортимент", Новый Структура("Магазин", Магазин));
		Если Результат <> Истина Тогда
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция получает значение функциональной опции "ИспользоватьАссортимент"
// Возвращаемое значение: 
// 		Результат - Булево - значение функицональной опции "ИспользоватьАссортимент"
Функция ИспользоватьАссортимент() Экспорт
	
	Результат = ПолучитьФункциональнуюОпцию("ИспользоватьАссортимент");
	Если Результат <> Истина Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция получает значение функциональной опции "ИспользоватьАссортимент"
// Возвращаемое значение: 
// 		Результат - Булево - значение функицональной опции "ИспользоватьАссортимент"
Функция ПолучитьФункциональнуюОпциюИспользованияАссортимента() Экспорт

	Возврат АссортиментСервер.ПолучитьФункциональнуюОпциюИспользованияАссортимента();

КонецФункции

