#Область ОбработчикиСобытийТабличногоПоляСписок

&НаКлиенте	//	LNK 22.10.2022 06:02:35
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ИменаКолонок = Новый Массив;
	ИменаКолонок.Добавить("Организация");
	ИменаКолонок.Добавить("Сотрудник");
	ИменаКолонок.Добавить("Магазин");
	ИменаКолонок.Добавить("ОтделМагазина");
	ИменаКолонок.Добавить("Должность");

	РаботаСФормамиКлиент.ОбработчикСобытияСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ИменаКолонок,, Элементы);

КонецПроцедуры

#КонецОбласти
