#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//	LNK 01.02.2023 09:57:13
Функция ПолучитьПараметрыПечати(СписокДокументов, РабочееМесто)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокумента.КассаККМ КАК КассаККМ
	|ПОМЕСТИТЬ ТаблицаКасс
	|ИЗ
	|	Документ.ЧекККМ КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка В(&СписокДокументов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КассаККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСправочник.Ссылка КАК КассаККМ,
	|	ТаблицаСправочник.ПодключаемоеОборудование КАК ИдентификаторУстройства,
	|	ТаблицаСправочник.ШиринаЛенты КАК ШиринаЛенты,
	|	ВЫБОР
	|		КОГДА ТаблицаСправочник.Ссылка В
	|				(ВЫБРАТЬ
	|					ТаблицаКасс.КассаККМ
	|				ИЗ
	|					ТаблицаКасс КАК ТаблицаКасс)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КассаИзДокументов
	|ИЗ
	|	Справочник.КассыККМ КАК ТаблицаСправочник
	|ГДЕ
	|	ТаблицаСправочник.РабочееМесто = &РабочееМесто
	|	И ТаблицаСправочник.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ФискальныйРегистратор)
	|	И НЕ ТаблицаСправочник.ПометкаУдаления
	|	И НЕ ТаблицаСправочник.ШиринаЛенты = 0
	|	И НЕ ТаблицаСправочник.ПодключаемоеОборудование = ЗНАЧЕНИЕ(Справочник.ПодключаемоеОборудование.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассаИзДокументов,
	|	КассаККМ
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаКасс"
	);
	Запрос.Параметры.Вставить("СписокДокументов", СписокДокументов);
	Запрос.Параметры.Вставить("РабочееМесто"    , РабочееМесто);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда

		Возврат Неопределено;

	Иначе

		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("ИдентификаторУстройства", Выборка.ИдентификаторУстройства);
		СтруктураОтвета.Вставить("ШиринаЛенты"            , Выборка.ШиринаЛенты);
		
		Возврат СтруктураОтвета;

	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли













