&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	Если Параметры.Свойство("Отбор") Тогда

		Если Параметры.Отбор.Свойство("СсылкаНеВСписке") Тогда

			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
				Список, 
				"Ссылка", 
				Параметры.Отбор.СсылкаНеВСписке, 
				Истина,
				ВидСравненияКомпоновкиДанных.НеВСписке
			);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры



