
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//
//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
//			Список, "Завершен", Ложь)
//	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидВозвратаФильтрПриИзменении(Элемент)
	УстановитьОтборДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ТипВозвратаФильтрПриИзменении(Элемент)
	УстановитьОтборДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура СтатусВозвратаФильтрПриИзменении(Элемент)
	УстановитьОтборДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура ТипОплатыФильтрПриИзменении(Элемент)
	УстановитьОтборДинамическихСписков();
КонецПроцедуры

&НаКлиенте
Процедура СтатусОплатыФильтрПриИзменении(Элемент)
	УстановитьОтборДинамическихСписков();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПолучитьМассивДинамическихСписковНаСервере()

	МассивСписков = Новый Массив;
	МассивСписков.Добавить(Список);
	
	Возврат МассивСписков;

КонецФункции

&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	Для Каждого ДинамическийСписок Из ПолучитьМассивДинамическихСписковНаСервере() Цикл

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок,
					"ВидВозврата",
					ВидВозвратаФильтр,
					ЗначениеЗаполнено(ВидВозвратаФильтр),
					ВидСравненияКомпоновкиДанных.Равно);

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок,
					"ТипВозврата",
					ТипВозвратаФильтр,
					ЗначениеЗаполнено(ТипВозвратаФильтр),
					ВидСравненияКомпоновкиДанных.Равно);

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок,
					"Статус",
					СтатусВозвратаФильтр,
					ЗначениеЗаполнено(СтатусВозвратаФильтр),
					ВидСравненияКомпоновкиДанных.Равно);

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок,
					"ТипОплаты",
					ТипОплатыФильтр,
					ЗначениеЗаполнено(ТипОплатыФильтр),
					ВидСравненияКомпоновкиДанных.Равно);

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок,
					"СтатусОплаты",
					СтатусОплатыФильтр,
					ЗначениеЗаполнено(СтатусОплатыФильтр),
					ВидСравненияКомпоновкиДанных.Равно);

	КонецЦикла; 

КонецПроцедуры
#КонецОбласти

