
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НастройкиФормированияОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ЗначениеПараметраПериод = НастройкиФормированияОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ЗначениеПараметраПериод <> Неопределено Тогда
		ЗначениеПараметраКонецПериода  = ЗначениеПараметраПериод.Значение.ДатаОкончания;
		Если НЕ ЗначениеЗаполнено(Дата(ЗначениеПараметраКонецПериода)) Тогда
			ДатаОкончания = КонецДня(ТекущаяДата());
			ЗначениеПараметраПериод.Значение.ДатаОкончания = ДатаОкончания;
			НастройкиФормированияОтчета.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"), ДатаОкончания);
			КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиФормированияОтчета);
			КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры