#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//	LNK 25.09.2023 16:17:51
Процедура Регистрация(Контрагент, ВидОповещения, ДанныеОповещения, Знач Период = '00010101')	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если Период = '00010101' Тогда

		Период = ТекущаяДата();

	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ОповещенияКонтрагентов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписей.Отбор.ВидОповещения.Установить(ВидОповещения);

	ЗаписьНабора = НаборЗаписей.Добавить();

	ЗаписьНабора.Период		= НаборЗаписей.Отбор.Период.Значение;
	ЗаписьНабора.Контрагент	= НаборЗаписей.Отбор.Контрагент.Значение;
	ЗаписьНабора.ВидОповещения	= НаборЗаписей.Отбор.ВидОповещения.Значение;

	ЗаписьНабора.НомерТелефона = ДанныеОповещения.НомерТелефона;
	ЗаписьНабора.ДатаАннуляции = ДанныеОповещения.ДатаАннуляции;

	ЗаписьНабора.ДатаИзменения = ТекущаяДата();
	ЗаписьНабора.Сообщение	   = ДанныеОповещения.ТекстСообщения;
	ЗаписьНабора.Хранилище	   = Новый ХранилищеЗначения(ДанныеОповещения.ТекстСообщения, Новый СжатиеДанных(9));

	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
