#Область ОбработчикиСобытийФормы

&НаСервере	//	LNK 21.08.2023 18:21:40
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)


КонецПроцедуры

&НаКлиенте	//	LNK 26.08.2023 04:59:56
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда

		Если ИмяСобытия = "ScanData" Тогда
			
			КодСерийногоНомера = "";

			Если Параметр[1] = Неопределено Тогда
				Штрихкод = Параметр[0];
			Иначе
				Штрихкод = Параметр[1][1];
			КонецЕсли;             			

			Если ПроверитьМаскуСерийногоНомера(Штрихкод) Тогда

				КодСерийногоНомера = Штрихкод;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры

#КонецОбласти

&НаКлиенте	//	LNK 29.08.2023 05:07:39
Функция ПроверитьМаскуСерийногоНомера(Штрихкод)

	Отказ = Истина;

	МаскаСертификата = Лев(Штрихкод, ПодарочныеСертификатыПовтИсп.ДлинаМаски());

	Если ПодарочныеСертификатыПовтИсп.МаскиСертификатов().Получить(МаскаСертификата) = Истина Тогда

		Отказ = Ложь;

	Иначе

		ПоказатьОповещениеПользователя("Проверка номера сертификата"
			,
			, "Структура номера сертификата не соответствует требуемой!"
			, БиблиотекаКартинок.Ошибка32
		);

	КонецЕсли;

	Возврат НЕ Отказ;

КонецФункции

&НаСервере
Процедура КомандаПолучитьДанныеСертификатаНаСервере()

	ТекстИнформации = "";

	Если РозничныеПродажиСлужебный.РесурсWebRetailДоступен() Тогда

		СоставОбъекта = ПодарочныеСертификатыСервер.ПолучитьСостояниеПодарочногоСертификатаКод(КодСерийногоНомера, РозничныеПродажиСлужебный.РесурсWebRetailДоступен());

		Если СоставОбъекта.Найден Тогда

			ТекстИнформации = "Подарочный сертификат «" + КодСерийногоНомера + "»" + Символы.ПС
			+ "1. Состояние «" + СоставОбъекта.Состояние + "»" + Символы.ПС
			+ "2. Действует до '" + Формат(СоставОбъекта.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy") + "' (исключая эту дату)";

		Иначе

			ТекстИнформации = "НЕ обнаружен подарочный сертификат «" + КодСерийногоНомера + "»!";

		КонецЕсли;

	Иначе

		Сообщить("Отказано. Недоступен web-ресурс центрального сервера.");

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаПолучитьДанныеСертификата(Команда)

	Если ПроверитьМаскуСерийногоНомера(КодСерийногоНомера) Тогда

		КомандаПолучитьДанныеСертификатаНаСервере();

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КодСерийногоНомераПриИзменении(Элемент)

	Если ПроверитьМаскуСерийногоНомера(КодСерийногоНомера) Тогда

		КомандаПолучитьДанныеСертификатаНаСервере();

	КонецЕсли;

КонецПроцедуры













