
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("АдресИнд", ТекущийОбъект.Идентификатор);
	ПараметрыАдреса.Вставить("Контрагент", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Контрагент, "Идентификатор"));
	ПараметрыАдреса.Вставить("ИДУлицы", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.ИДУлицы, "Идентификатор"));
	ПараметрыАдреса.Вставить("Дом", ТекущийОбъект.Дом);
	ПараметрыАдреса.Вставить("Квартира", ТекущийОбъект.Квартира);
	ПараметрыАдреса.Вставить("Примечание", ТекущийОбъект.Примечание);
	
	СтруктураОтвета = ОбменНПСервер.АдресКонтрагентаЗаписать(ПараметрыАдреса);
	
	Если СтруктураОтвета.Ошибка Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураОтвета.ТектОшибки, , , , Отказ);
		
	Иначе
		
		ТекущийОбъект.Идентификатор = СтруктураОтвета.АдресИнд;
		ТекущийОбъект.Адрес = СтруктураОтвета.Адрес;
		
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИДГородаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;
    ДанныеВыбора = ГородАвтоПодборНаСервере(Текст);

КонецПроцедуры


&НаКлиенте
Процедура ИДУлицыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;
    ДанныеВыбора = УлицаАвтоПодборНаСервере(Текст, Объект.ИДГорода);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ГородАвтоПодборНаСервере(Текст)
	
	Возврат ОбменНПСервер.ГородАвтоПодбор(Текст);

КонецФункции

&НаСервереБезКонтекста
Функция УлицаАвтоПодборНаСервере(Текст, Город)
	
	Возврат ОбменНПСервер.УлицаАвтоПодбор(Текст, Город);

КонецФункции

#КонецОбласти
