
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ОтправкаSMSСервер.НастройкаОтправкиSMSРазрешена() Тогда

		ПараметрыФормы = Новый Структура;
		ОткрытьФорму("ОбщаяФорма.НастройкаОтправкиSMS"
			, ПараметрыФормы
			, ПараметрыВыполненияКоманды.Источник
			, ПараметрыВыполненияКоманды.Уникальность
			, ПараметрыВыполненияКоманды.Окно
			, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

	Иначе

		ПоказатьОповещениеПользователя("Изменение параметров запрещено!"
		,, "Настройка параметров SMS-провайдера допускается только в центральном узле."
		, БиблиотекаКартинок.Ошибка32);

	КонецЕсли;

КонецПроцедуры
