Функция ПолучитьСтатус(СтруктураСтатуса) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыСтатусовТТН.Ссылка
		|ИЗ
		|	Справочник.КодыСтатусовТТН КАК КодыСтатусовТТН
		|ГДЕ
		|	КодыСтатусовТТН.Код = &КодСтатуса
		|	И КодыСтатусовТТН.ОператорДоставки = &ОператорДоставки";
	
	Запрос.УстановитьПараметр("КодСтатуса", СтруктураСтатуса.КодСтатуса);
	Запрос.УстановитьПараметр("ОператорДоставки", СтруктураСтатуса.ОператорДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		НовыйЭлемент = СоздатьЭлемент();
		НовыйЭлемент.Код = СтруктураСтатуса.КодСтатуса;
		НовыйЭлемент.Наименование = СтруктураСтатуса.Наименование;
		НовыйЭлемент.НаименованиеСтатуса = СтруктураСтатуса.Наименование;
		НовыйЭлемент.ОператорДоставки = СтруктураСтатуса.ОператорДоставки;
		НовыйЭлемент.СтатусПосылки = Перечисления.СтатусыПосылокСлужбыДоставки.ВДороге;
		НовыйЭлемент.Записать();
		Результат = НовыйЭлемент.Ссылка;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции