#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//	LNK 14.08.2017 09:15:31
Процедура ЗаполнитьПредопределённыеЭлементы()	Экспорт

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		УстановитьПривилегированныйРежим(Истина);

		УстановитьРеквизиты("94090", "МАРКЕТИНГ_ИВЕНТЫ"	, Справочники.СтатьиРасходов.МаркетингИвенты);
		УстановитьРеквизиты("94091", "ПОВР_ТОРГ_ЗАЛ"	, Справочники.СтатьиРасходов.ПовреждениеВТорговомЗале);
		УстановитьРеквизиты("94092", "ОКОНЧ_СРОК_РЕАЛИЗ", Справочники.СтатьиРасходов.ОкончаниеСроковРеализации);
		УстановитьРеквизиты("94093", "БРАК_ПРИХОД_СКЛАД", Справочники.СтатьиРасходов.БракПоПриходуСоСклада);
		УстановитьРеквизиты("94094", "БРАК_ПОСТАВЩИК"	, Справочники.СтатьиРасходов.БракОтПоставщика);
		УстановитьРеквизиты("94095", "ЕСТЕСТВ_ПОРЧА"	, Справочники.СтатьиРасходов.ЕстественнаяПорчаТовара);
		УстановитьРеквизиты("94096", "ВОЗВРАТ_ГАРАНТИЯ"	, Справочники.СтатьиРасходов.ВозвратОтПокупателяПоГарантии);
		УстановитьРеквизиты("94097", "СПИСАНИЕ_КРАЖ"	, Справочники.СтатьиРасходов.КражиСНомеромДела);
		УстановитьРеквизиты("94070", "ИНВ_АНТ"			, Справочники.СтатьиРасходов.Инвентаризация);

	КонецЕсли;

КонецПроцедуры

Процедура УстановитьРеквизиты(КорреспондирующийСчет, ОбщаяБизнесГруппа, Элемент)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСправочник.Ссылка
	|ИЗ
	|	Справочник.СтатьиРасходов КАК ТаблицаСправочник
	|ГДЕ
	|	ТаблицаСправочник.Ссылка = &Элемент
	|	И ТаблицаСправочник.КорреспондирующийСчет = &КорреспондирующийСчет
	|	И ТаблицаСправочник.ОбщаяБизнесГруппа = &ОбщаяБизнесГруппа"
	);
	Запрос.УстановитьПараметр("Элемент", Элемент);
	Запрос.УстановитьПараметр("КорреспондирующийСчет", КорреспондирующийСчет);
	Запрос.УстановитьПараметр("ОбщаяБизнесГруппа", ОбщаяБизнесГруппа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда

		СтатьяОбъект = Элемент.ПолучитьОбъект();
		СтатьяОбъект.КорреспондирующийСчет = КорреспондирующийСчет;
		СтатьяОбъект.ОбщаяБизнесГруппа = ОбщаяБизнесГруппа;

		СтатьяОбъект.ОбменДанными.Загрузка = Истина;
		СтатьяОбъект.Записать();

	КонецЕсли;

КонецПроцедуры

//Фин счет	Описание фин счета				Общая бизнес Группа
//94090		Маркетинг ивенты				МАРКЕТИНГ_ИВЕНТЫ
//94091		Повреждение в торговом зале		ПОВР_ТОРГ_ЗАЛ
//94092		Окончание сроков реализации		ОКОНЧ_СРОК_РЕАЛИЗ
//94093		Брак по приходу со склада		БРАК_ПРИХОД_СКЛАД
//94094		Брак от поставщика				БРАК_ПОСТАВЩИК
//94095		Естественная порча товара		ЕСТЕСТВ_ПОРЧА
//94096		Возврат от покупателя по гарантии	ВОЗВРАТ_ГАРАНТИЯ
//94097		Кражи с номером дела			СПИСАНИЕ_КРАЖ
//94070		Инвентаризация					ИНВ_АНТ

#КонецЕсли
