//	LNK 12.08.2019 11:30:27
Функция ВнешнийРесурсДоступен(ТекстОшибки)

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	РесурсДоступен = Ложь;

	Попытка

		Подключение    = СервисыСервер.Подключение("RetailPack");
		РесурсДоступен = Подключение.Ping();

		Если НЕ РесурсДоступен Тогда

			ТекстОшибки = "Отключено по команде центрального узла";

		КонецЕсли;

	Исключение

		ТекстОшибки = ОписаниеОшибки();

	КонецПопытки;

	Возврат РесурсДоступен;

КонецФункции

//	LNK 12.08.2019 11:23:31
Процедура ПроверкаДоступностиWebRetail(УчитыватьСчётчик) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Если НЕ Константы.РесурсWebRetailСчётчик.Получить() = 0 Тогда

			Константы.РесурсWebRetailСчётчик.Установить(0);

		КонецЕсли;

		Если Константы.РесурсWebRetailДоступен.Получить() = Ложь Тогда

			Константы.РесурсWebRetailДоступен.Установить(Истина);

		КонецЕсли;

	Иначе

		Если Константы.РесурсWebRetailРучноеОтключение.Получить() = Истина Тогда

		//	Контроль доступности отключен.
			Возврат;

		КонецЕсли;

		ТекстОшибки = "";

		Если ВнешнийРесурсДоступен(ТекстОшибки) Тогда

			Если НЕ Константы.РесурсWebRetailСчётчик.Получить() = 0 Тогда

				Константы.РесурсWebRetailСчётчик.Установить(0);

			КонецЕсли;

			Если Константы.РесурсWebRetailДоступен.Получить() = Ложь Тогда

				МенеджерКонстанты = Константы.РесурсWebRetailДоступен.СоздатьМенеджерЗначения();
				МенеджерКонстанты.ДополнительныеСвойства.Вставить("СлужебнаяЗапись", Истина);
				МенеджерКонстанты.Значение = Истина;
				МенеджерКонстанты.Записать();

				ЖурналСобытий.Регистрация("WEBRT.Доступность", УровеньЖурналаРегистрации.Примечание
					, Метаданные.Константы.РесурсWebRetailДоступен
					, Истина
					,
					, "Работа с ресурсом разрешена"
					,
					, Истина
				);

			КонецЕсли;

		Иначе

			КоличествоПопыток = Константы.РесурсWebRetailСчётчик.Получить();

			Если НЕ УчитыватьСчётчик = Истина ИЛИ КоличествоПопыток >= 2 Тогда	//	это уже ТРЕТЬЯ попытка

				Если Константы.РесурсWebRetailДоступен.Получить() = Истина Тогда

					МенеджерКонстанты = Константы.РесурсWebRetailДоступен.СоздатьМенеджерЗначения();
					МенеджерКонстанты.ДополнительныеСвойства.Вставить("СлужебнаяЗапись", Истина);
					МенеджерКонстанты.Значение = Ложь;
					МенеджерКонстанты.Записать();

					Константы.РесурсWebRetailСчётчик.Установить(0);

					ЖурналСобытий.Регистрация("WEBRT.Доступность", УровеньЖурналаРегистрации.Предупреждение
						, Метаданные.Константы.РесурсWebRetailДоступен
						, Ложь
						,
						, "Работа с ресурсом запрещена" + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС + ТекстОшибки)
						,
						, Истина
					);

				КонецЕсли;

			Иначе

				Константы.РесурсWebRetailСчётчик.Установить(КоличествоПопыток + 1);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры








