////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ЗакрыватьФормуПослеСканированияСерии Тогда
		ЗакрыватьФормуПослеСканированияСерии = 1;
	Иначе
		ЗакрыватьФормуПослеСканированияСерии = 0;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	Если ЗакрыватьФормуПослеСканированияСерии = 1 Тогда
		Закрыть(Истина);
	Иначе
		Закрыть(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
