
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Документ = ПараметрКоманды;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		ЗаказПоставщику = ОбщегоНазначенияРТСервер.ЗначениеРеквизитаОбъекта(Документ, "ЗаказПоставщику");
		Документ = ?(ЗначениеЗаполнено(ЗаказПоставщику), ЗаказПоставщику, Документ);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Документ", Документ);
	ОткрытьФорму("Обработка.ПомощникЗачетаОплат.Форма.Форма",
	ПараметрыФормы,
	ПараметрыВыполненияКоманды.Источник,
	ПараметрыВыполненияКоманды.Уникальность,
	ПараметрыВыполненияКоманды.Окно
	);
	
КонецПроцедуры
