#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Перем ЗначениеИзСтруктуры;
	
	Если Не Параметры.Свойство("Номенклатура", ЗначениеИзСтруктуры) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Если Не ОбработкаТабличнойЧастиТоварыСервер.ПроверитьИспользованиеХарактеристикИПолучитьСписокДляВыбора(ЗначениеИзСтруктуры,
	   ДанныеВыбора, Параметры.СтрокаПоиска) Тогда
		ДанныеВыбора = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
