#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

///////////////////////////////////////////////////////////////////////////////
// Проведение

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТаблицаДенежныхСредств.Касса КАК Касса,
	|	ТаблицаДенежныхСредств.Касса.Владелец КАК Организация,
	|	ТаблицаДенежныхСредств.Сумма КАК Сумма,
	|	ТаблицаДенежныхСредств.Дата КАК Период
	|ИЗ
	|	Документ.ВводОстатковДенежныхСредств КАК ТаблицаДенежныхСредств
	|ГДЕ
	|	ТаблицаДенежныхСредств.Ссылка = &Ссылка
	|	И (НЕ ТаблицаДенежныхСредств.Касса.КассаУправляющейСистемы)");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваНаличные", Результат[0].Выгрузить());
	
КонецПроцедуры

#КонецЕсли
