////////////////////////////////////////////////////////////////////////////////
// НАЛОГООБЛОЖЕНИЕ НДС

// Возвращает являеться ли поставщик(организация или контрагент) неплательщиком НДС
//
// Параметры:
// Организация - СправочникСсылка.Организации
// Контрагент - СправочникСсылка.Контрагент
//
// Возвращаемое значение:
// ПеречислениеСсылка.ТипыНалогообложенияНДС
//
Функция ОрганизацияКонтрагентПлательщикНДС(ОрганизацияКонтрагент, Дата = Неопределено) Экспорт

	Если ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Организации") Тогда

		Плательщик = Справочники.Организации.ПлательщикНДСУкр(ОрганизацияКонтрагент, Дата);

	ИначеЕсли ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Контрагенты") Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Контрагенты.ПлательщикНДС, Ведущая.ПлательщикНДС) КАК ПлательщикНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		&Контрагент КАК Контрагент,
		|		ЛОЖЬ КАК ПлательщикНДС) КАК Ведущая
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО Ведущая.Контрагент = Контрагенты.Ссылка"
		);
		Запрос.УстановитьПараметр("Контрагент", ОрганизацияКонтрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		Плательщик = Выборка.ПлательщикНДС;

	Иначе

		Плательщик = Ложь;

	КонецЕсли;
	
	Возврат Плательщик;
	
КонецФункции

// Возвращает являеться ли поставщик(организация или контрагент) неплательщиком НДС
//
// Параметры:
// Организация - СправочникСсылка.Организации
// Контрагент - СправочникСсылка.Контрагент
//
// Возвращаемое значение:
// ПеречислениеСсылка.ТипыНалогообложенияНДС
//
Функция ПоставщикНеплательщикНДС(Организация, Контрагент, Дата = Неопределено, ЭтоПродажа = Истина) Экспорт
	
	Если ЭтоПродажа Тогда
		Если (НЕ ЗначениеЗаполнено(Организация)) ИЛИ ОрганизацияКонтрагентПлательщикНДС(Организация, Дата) Тогда
			Неплательщик = Ложь;
		Иначе
			Неплательщик = Истина;
		КонецЕсли;
	Иначе
		Если (НЕ ЗначениеЗаполнено(Контрагент)) ИЛИ ОрганизацияКонтрагентПлательщикНДС(Контрагент, Дата) Тогда
			Неплательщик = Ложь;
		Иначе
			Неплательщик = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Неплательщик;
	
КонецФункции


// Устанавливает значение свойства элементов формы, если находит элемент на форме
//
// Параметры
//  ЭлементыФормы       - ВсеЭлементыФормы - элементы формы, среди которых содержится искомый элемент.
//  МассивИменЭлементов - Массив - массив имен искомых элементов.
//  ИмяСвойства         - Строка - имя свойства, для которого будет устанавливаться значение.
//  Значение            - Произвольный - значение, которое будет установлено
//
Функция ПолучитьИОбработатьДоступностьНалогообложениеНДС(Организация, Контрагент, Дата = Неопределено, ЭтоПродажа = Истина, ЭлементыФормы, МассивИменЭлементов) Экспорт

	Неплательщик = ПоставщикНеплательщикНДС(Организация, Контрагент, Дата, ЭтоПродажа);

	ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭлементыФормы, МассивИменЭлементов, "Доступность", НЕ Неплательщик);
	
	Возврат (НЕ Неплательщик);

КонецФункции

// Устанавливает значение свойства элементов формы, если находит элемент на форме
//
// Параметры
//  ЭлементыФормы       - ВсеЭлементыФормы - элементы формы, среди которых содержится искомый элемент.
//  МассивИменЭлементов - Массив - массив имен искомых элементов.
//  ИмяСвойства         - Строка - имя свойства, для которого будет устанавливаться значение.
//  Значение            - Произвольный - значение, которое будет установлено
//
Функция НужноОбработатьНовоеНалогообложениеНДС(СтароеНалогообложение, НовоеНалогообложение) Экспорт
	
//	LNK 04.05.2018 11:12:42
	НужноИзменить = НЕ СтароеНалогообложение = НовоеНалогообложение;
	
	Возврат НужноИзменить;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СТАВКИ НДС

// Возвращает числовое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС
//
// Возвращаемое значение:
// 		Число - Значение ставки НДС числом
//
Функция ПолучитьСтавкуНДСЧислом(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		
		Возврат 0.2;
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС14") Тогда
		
		Возврат 0.14;
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7") Тогда
		
		Возврат 0.07;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСтавкуНДСПоЗначению(Знач ЗначениеСтавки)	Экспорт	//	LNK 08.06.2021 13:20:52

	Если ЗначениеСтавки < 1 Тогда

		ЗначениеСтавки = ЗначениеСтавки * 100;

	КонецЕсли;

	Если ЗначениеСтавки = 20 Тогда

		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");

	ИначеЕсли ЗначениеСтавки = 14 Тогда

		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС14");

	ИначеЕсли ЗначениеСтавки = 7 Тогда

		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7");

	ИначеЕсли ЗначениеСтавки = 0 Тогда

		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");

	Иначе

		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");

	КонецЕсли;

КонецФункции

Функция ОпределитьСтавкуНДС(ТекущаяСтрока, СтруктураПараметровДействия) Экспорт

	Если СтруктураПараметровДействия.Свойство("ОрганизацияПоСкладу") Тогда

		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Склад, "Организация", Ложь);

	Иначе

		Организация = СтруктураПараметровДействия.Организация;

	КонецЕсли;
	
	НалогообложениеНДС = Неопределено;
	
	Если СтруктураПараметровДействия.Свойство("НалогообложениеНДС", НалогообложениеНДС) = Ложь Тогда
		
		НалогообложениеНДС = ОрганизацияКонтрагентПлательщикНДС(Организация, СтруктураПараметровДействия.Дата);
		
	КонецЕсли;
	
	СтавкаНДС = ОпределитьСтавкуНДСИзНалогообложенияНДС(НалогообложениеНДС, ТекущаяСтрока.Номенклатура);
	
	Возврат СтавкаНДС;
	
КонецФункции

Функция ОпределитьСтавкуНДСИзНалогообложенияНДС(НалогообложениеНДС, Номенклатура) Экспорт
	
	Если НалогообложениеНДС = Истина Тогда
		СтавкаНДС = Справочники.Номенклатура.ПолучитьРеквизитыНоменклатуры(Номенклатура).СтавкаНДС;
	ИначеЕсли НалогообложениеНДС = Ложь Тогда
		СтавкаНДС = Перечисления.СтавкиНДС.НеНДС;
	Иначе
		СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
	КонецЕсли;
		
	Возврат СтавкаНДС;
	
КонецФункции

