&НаСервереБезКонтекста
Процедура ВыполнитьАлгоритмНаСервере(ТекстДляВыполнения)

	Если НЕ ПустаяСтрока(ТекстДляВыполнения) Тогда

		Выполнить(ТекстДляВыполнения);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАлгоритм(Команда)

	ТекстДляВыполнения = Элементы.ТекстПрограммы.ВыделенныйТекст;

	Если ПустаяСтрока(ТекстДляВыполнения) Тогда

		ТекстДляВыполнения = Объект.ТекстПрограммы;

	КонецЕсли;

	ВыполнитьАлгоритмНаСервере(ТекстДляВыполнения);

КонецПроцедуры
