Процедура ЗагрузкаДанныхСчетчиковПодсчетаПосетителей(ЭлементНастройки, КоличествоДнейЗагрузкиСчётчиковПосетителей) Экспорт	//	LNK 09.07.2021 11:56:27

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если ЭлементНастройки = Перечисления.ВнешниеИсточники.CountersMotion Тогда

	//	LNK 06.01.2020 09:40:05
		ВнешниеИсточникиСчетчикиПосетителей.ПолучитьДанныеСчетчиковПосетителей(
			ТекущаяДата(),
			?(ТипЗнч(КоличествоДнейЗагрузкиСчётчиковПосетителей) = Тип("Число")
				, Макс(1, КоличествоДнейЗагрузкиСчётчиковПосетителей)
				, 3
			)
		);

	ИначеЕсли ТипЗнч(ЭлементНастройки) = Тип("СправочникСсылка.НастройкиЗагрузкиДанныхСчетчиковПодсчетаПосетителей") Тогда

		ВнешниеИсточникиСчетчикиПосетителей.ЗагрузитьВнешниеДанные(ЭлементНастройки, Макс(1, КоличествоДнейЗагрузкиСчётчиковПосетителей));

	КонецЕсли;

КонецПроцедуры
