
&НаСервере
Процедура РедактируемыйДокументПриИзмененииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛистыЖеланийОстатки.Магазин,
	|	ЛистыЖеланийОстатки.ЛистЖеланий,
	|	ЛистыЖеланийОстатки.Корзина,
	|	ЛистыЖеланийОстатки.Номенклатура,
	|	ЛистыЖеланийОстатки.Характеристика,
	|	ЛистыЖеланийОстатки.КоличествоОстаток как Количество
	|ИЗ
	|	РегистрНакопления.ЛистыЖеланий.Остатки(, ЛистЖеланий = &ЛистЖеланий) КАК ЛистыЖеланийОстатки";
	
	Запрос.УстановитьПараметр("ЛистЖеланий", Объект.РедактируемыйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемыйДокументПриИзменении(Элемент)
	РедактируемыйДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01

КонецПроцедуры
