#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Найти город по имени.
// 
// Параметры:
//  НаименованиеГорода - Строка - Наименование города в виде строки
//  ОператорДоставки - ПеречислениеСсылка.ОператорыДоставки - Оператор доставки
// 
// Возвращаемое значение:
// СправочникСсылка.ГородаДоставки, Строка - Ссылка на город доставки
//  
Функция НайтиГород(НаименованиеГорода, ОператорДоставки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ГородаДоставки.Ссылка
		|ИЗ
		|	Справочник.ГородаДоставки КАК ГородаДоставки
		|ГДЕ
		|	ГородаДоставки.ОператорДоставки = &ОператорДоставки
		|	И (ГородаДоставки.НаименованиеRU = &НаименованиеГорода
		|	ИЛИ ГородаДоставки.Наименование = &НаименованиеГорода)";
	
	Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
	Запрос.УстановитьПараметр("НаименованиеГорода", СокрЛП(НаименованиеГорода));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		Результат = НаименованиеГорода;

	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Найти город ref.
// 
// Параметры:
//  ГородRef - Строка - Город ref
//  ОператорДоставки - ПеречислениеСсылка.ОператорыДоставки - Оператор доставки
// 
// Возвращаемое значение:
// СправочникСсылка.ГородаДоставки, Неопределено - Ссылка на город доставки
//  
Функция НайтиГородRef(ГородRef, ОператорДоставки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ГородаДоставки.Ссылка
		|ИЗ
		|	Справочник.ГородаДоставки КАК ГородаДоставки
		|ГДЕ
		|	ГородаДоставки.ОператорДоставки = &ОператорДоставки
		|	И (ГородаДоставки.ИдентификаторSettlement = &ГородRef
		|	ИЛИ ГородаДоставки.Идентификатор = &ГородRef)";
	
	Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
	Запрос.УстановитьПараметр("ГородRef", СокрЛП(ГородRef));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		Результат = Неопределено;

	КонецЕсли;
	
	Возврат Результат;

КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли