Процедура НазначитьОтложенноеПроведение(ДокументСсылка, ДатаДокумента = '00010101')	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ДатаДокумента = '00010101' Тогда

		ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата");

	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.ОтложенныеДвиженияДокументов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ         = ДокументСсылка;
	МенеджерЗаписи.ЭлементСтруктуры = ОбменДаннымиПовтИсп.ПолучитьТекущийЭлементСтруктурыУзлов();

	МенеджерЗаписи.Прочитать();

	Если МенеджерЗаписи.Документ = Неопределено Тогда

		МенеджерЗаписи.Документ         = ДокументСсылка;
		МенеджерЗаписи.ЭлементСтруктуры = ОбменДаннымиПовтИсп.ПолучитьТекущийЭлементСтруктурыУзлов();
		МенеджерЗаписи.ДатаДокумента    = ДатаДокумента;

		МенеджерЗаписи.Записать(Истина);

	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
