
#Область ОбработчикиОсновныхСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ДатаНачала"   , ДатаНачала);
	Параметры.Свойство("ДатаОкончания", ДатаОкончания);
	Параметры.Свойство("Касса"        , Касса);

КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ДатаНачала", ДатаНачала);
	ПараметрыОтчета.Вставить("ДатаОкончания", ДатаОкончания);
	ПараметрыОтчета.Вставить("Касса", Касса);
	ПараметрыОтчета.Вставить("СформироватьОбложку", Истина);

	ЖурналыДокументов.КассовыеДокументы.СформироватьЖурналРегистрацииРасходныхИПриходных(ПараметрыОтчета, ТабличныйДокумент);

КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	СформироватьОтчетНаСервере();
КонецПроцедуры
	
#КонецОбласти