&НаСервере
Процедура ЗанестиДанныеВРегистр(КодМагазина,Сумма)
		Организация = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин,"Организация");	
	КодМагазина = Число(КодМагазина);
	Магазин =  Справочники.Магазины.НайтиПоРеквизиту("НомерМагазина",КодМагазина); 
	Если не Магазин=Справочники.Магазины.ПустаяСсылка() Тогда
		НовыйПлан = РегистрыСведений.РекомендуемыПоказателиSPH.СоздатьНаборЗаписей();
		НовыйПлан.Отбор.Магазин.Установить(Магазин);  
		НовыйПлан.Отбор.Организация.Установить(Организация);
		//НовыйПлан.Магазин=Магазин;
		НовыйПлан.Отбор.Период.Установить(НачалоЧаса(ДатаЗагрузки));
			попытка
				ЗаписьГигиена =  НовыйПлан.Добавить();
				ЗаписьГигиена.Магазин = Магазин;
				ЗаписьГигиена.Период = ДатаЗагрузки;
				ЗаписьГигиена.Организация = Организация;
				ЗаписьГигиена.SPH=Сумма;
				ЗаписьГигиена.Активность = Истина;
			Исключение
				Сообщить("ОШИБКА Код магазина "+КодМагазина);
			КонецПопытки;
		
			попытка		
				НовыйПлан.Записать(Истина);
			исключение
				Сообщить("не удалось записать магазин - "+ КодМагазина);

			КонецПопытки
	Иначе
		Сообщить("не найден магазин - "+ КодМагазина);
	Конецесли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьТаблицу(Команда)
	ошибка=ложь;
	НомерСтроки=2;
	
		
	КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(1,"ЧГ=")).Текст);
	Сумма = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(Формат(НомерСтроки,"ЧГ="),"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст)," ","");
//пока ЗначениеЗаполнено(КодМагазина) цикл
пока  КодМагазина<>"" И  Сумма<>"" И ЗначениеЗаполнено(ДатаЗагрузки) цикл 
	//НомерСтроки=НомерСтроки+1;
		КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(1,"ЧГ=")).Текст);
		Сумма = СтрЗаменить(СокрЛП(ТабличныйДокумент.Область("R"+Формат(Формат(НомерСтроки,"ЧГ="),"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст)," ","");
		Если ЗначениеЗаполнено(КодМагазина) Тогда
			ЗанестиДанныеВРегистр(КодМагазина,Число(Сумма));
			Состояние(Строка(НомерСтроки));	
		конецесли;
		
		НомерСтроки=НомерСтроки+1;
		
		//КодМагазина = СокрЛП(ТабличныйДокумент.Область("R"+Формат(НомерСтроки,"ЧГ=")+"C"+Формат(2,"ЧГ=")).Текст);
		обработкапрерыванияпользователя();
		
	конеццикла;
    ПоказатьПредупреждение(, "Данные загружены");	

КонецПроцедуры

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	ДатаЗагрузки = НачалоМесяца(текущаядата());
//КонецПроцедуры


&НаСервере
Функция ПривестиКТипуДата(СтрДата)
    День = Сред(СтрДата, 1, 2);
    Месяц = Сред(СтрДата, 4, 2);
    Год = Сред(СтрДата, 7, 4);
	Если СтрДлина(СтрДата) = 18 тогда 
		Часы = "0"+ Сред(СтрДата, 12, 1);
		Минуты =  Сред(СтрДата, 14, 2);
	ИНаче
		Часы =  Сред(СтрДата, 12, 2);
		Минуты =  Сред(СтрДата, 15, 2);
	КонецЕсли;
    Возврат(Дата(Год+Месяц+День+Часы+Минуты));
КонецФункции

&НаКлиенте
Процедура ВзешенныйПриИзменении(Элемент)
	ВзешенныйПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВзешенныйПриИзмененииНаСервере()
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ВставитьОбласть(ТабличныйДокумент.Область("ОбластьШапка"));
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.ВставитьОбласть(ТабДок.Область("ОбластьШапка"),ТабличныйДокумент.Область(1,1));
КонецПроцедуры
