&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьОтборДинамическихСписков();

КонецПроцедуры

&НаКлиенте	//	LNK 20.10.2017 15:54:18
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Запись.Нормальный = НЕ Запись.Событие = ПредопределенноеЗначение("Перечисление.СобытияВерификацииПокупателей.ОтказПокупателя");

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	УстановитьОтборДинамическихСписков();

КонецПроцедуры

&НаСервере	//	LNK 08.02.2019 15:22:07
Процедура УстановитьОтборДинамическихСписков()

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		ИнформационныеКарты, 
		"ВладелецКарты", 
		Запись.Контрагент, 
		ЗначениеЗаполнено(Запись.Контрагент));

КонецПроцедуры
