//	LNK 18.10.2017 14:48:47
Функция КодыRFC2616(КодСостояния)	Экспорт

	МакетОписаний = ПолучитьОбщийМакет("КодыRFC2616");
	ИмяОбласти    = "R_" + Формат(КодСостояния, "ЧЦ=3; ЧН=000; ЧГ=");

	Попытка

		Область = МакетОписаний.ПолучитьОбласть(ИмяОбласти);
		Область.УдалитьСтроку(1);
		Область.УдалитьСтроку(Область.КоличествоСтрок());

		Результат = Новый Структура(
			"Описание, Ошибка", Область.ПолучитьТекст(), КодСостояния >= 300)

	Исключение

		Результат = Новый Структура(
			"Описание, Ошибка", "", Ложь);

	КонецПопытки; 

	Возврат Результат;

КонецФункции // КодыRFC2616()
