
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

//	ПараметрКоманды - массив документов. Нужно проверить, что ни один из них не помечен на удаление.
//	Примечание: текущий документ проводиться не может.

	Если Истина Тогда

		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.ПереоценкаТоваровНаСкладах",
			"АктПереоценкиТоваровНаСкладах",
			ПараметрКоманды,
			ПараметрыВыполненияКоманды.Источник,
			"Вниз"
		);

	КонецЕсли;

КонецПроцедуры
