
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Объект.ТЧ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение КАК Док,
		|	РекламныеМатериалыКПриемкеОстатки.Магазин КАК Магазин,
		|	РекламныеМатериалыКПриемкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКПриемкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	РекламныеМатериалыКПриемкеОстатки.КоличествоОстаток КАК Количество,
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.Поставщик КАК Поставщик,
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаС КАК ДатаС,
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаПо КАК ДатаПо
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКПриемке.Остатки КАК РекламныеМатериалыКПриемкеОстатки
		|ГДЕ
		|	РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаПо < &ТекДата
		|	И НЕ РекламныеМатериалыКПриемкеОстатки.ДокументРаспоряжение.ДатаПо = ДАТАВРЕМЯ(1, 1, 1)
		|	И РекламныеМатериалыКПриемкеОстатки.КоличествоОстаток > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПо,
		|	Док";
	
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ТЧ.Загрузить(РезультатЗапроса.Выгрузить());
	
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьНаСервере()
	Для Каждого Строка из Объект.ТЧ цикл
		Если Строка.Выбран тогда 
			УдалитьСтрокуТЧ(Строка.Док,Строка.РекламныйМатериал,Строка.РекламнаяПлоскость);
		КонецЕсли;
	КонецЦикла;
	Объект.ТЧ.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокуТЧ(Док,РекламныйМатериал,РекламнаяПлоскость)
	Записывать = Ложь;
	ТекДок = Док.ПолучитьОбъект();
	ПараметрыОтбора = Новый Структура;
    ТабличнаяЧастьДок = ТекДок.РекламныеМатериалы; 	
	ПараметрыОтбора.Вставить("РекламныйМатериал", РекламныйМатериал);
	ПараметрыОтбора.Вставить("РекламнаяПлоскость", РекламнаяПлоскость);
	СтрокиТЧ =  ТабличнаяЧастьДок.НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрокаРМ Из СтрокиТЧ Цикл
		ТабличнаяЧастьДок.Удалить(СтрокаРМ);
		Записывать = Истина;
	КонецЦикла;
	Если Записывать тогда 
		Попытка
			ТекДок.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		 	Сообщить("При записи документа "+Док+ " произошла ошибка!" );
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьНаСервере();
КонецПроцедуры
