
#Область СлужебныеПроцедурыИФункции

Функция СоответствиеНациональногоАлфавитаИЛатиницы()	Экспорт

	Соответствие = Новый Соответствие;

	Если Истина Тогда

	//	Паспортна (КМУ 2010) - офіційна транслітерація, затверджена Кабінетом Міністрів України 27 січня 2010 р.
	//	Використовується для оформлення паспорта громадянина України на виїзд за кордон, банківських карток тощо.
	//	---------------------------------------------------------------------------------------
	//		*	Другий варіант вживається на початку слова.
	//		**	Після літери "з" вживається "gh". В інших випадках - "h".
		Соответствие.Вставить("а","a");
		Соответствие.Вставить("б","b");
		Соответствие.Вставить("в","v");
		Соответствие.Вставить("г","h");		//	"h, gh" **
		Соответствие.Вставить("ґ","g");
		Соответствие.Вставить("д","d");
		Соответствие.Вставить("е","e");
		Соответствие.Вставить("є","ye");	//	"ie, ye" *
		Соответствие.Вставить("ж","zh");
		Соответствие.Вставить("з","z");
		Соответствие.Вставить("и","y");
		Соответствие.Вставить("і","i");
		Соответствие.Вставить("ї","yi");	//	"i, yi" *
		Соответствие.Вставить("й","y");		//	"i, y" *
		Соответствие.Вставить("к","k");
		Соответствие.Вставить("л","l");
		Соответствие.Вставить("м","m");
		Соответствие.Вставить("н","n");
		Соответствие.Вставить("о","o");
		Соответствие.Вставить("п","p");
		Соответствие.Вставить("р","r");
		Соответствие.Вставить("с","s");
		Соответствие.Вставить("т","t");
		Соответствие.Вставить("у","u");
		Соответствие.Вставить("ф","f");
		Соответствие.Вставить("х","kh");
		Соответствие.Вставить("ц","ts");
		Соответствие.Вставить("ч","ch");
		Соответствие.Вставить("ш","sh");
		Соответствие.Вставить("щ","shch");
		Соответствие.Вставить("ь","");		// пропускается
		Соответствие.Вставить("ю","yu");	//	"iu, yu" *
		Соответствие.Вставить("я","ya");	//	"ia, ya" *
		Соответствие.Вставить("`","");		// пропускается
	//	русская специфика
		Соответствие.Вставить("ё","e");
		Соответствие.Вставить("ъ","");		// пропускается
		Соответствие.Вставить("ы","y");
		Соответствие.Вставить("э","e");

	Иначе

	//	Транслитерация, используемая в загранпаспортах 1997-2010.
		Соответствие.Вставить("а","a");
		Соответствие.Вставить("б","b");
		Соответствие.Вставить("в","v");
		Соответствие.Вставить("г","g");
		Соответствие.Вставить("д","d");
		Соответствие.Вставить("е","e");
		Соответствие.Вставить("ё","e");
		Соответствие.Вставить("ж","zh");
		Соответствие.Вставить("з","z");
		Соответствие.Вставить("и","i");
		Соответствие.Вставить("й","y");
		Соответствие.Вставить("к","k");
		Соответствие.Вставить("л","l");
		Соответствие.Вставить("м","m");
		Соответствие.Вставить("н","n");
		Соответствие.Вставить("о","o");
		Соответствие.Вставить("п","p");
		Соответствие.Вставить("р","r");
		Соответствие.Вставить("с","s");
		Соответствие.Вставить("т","t");
		Соответствие.Вставить("у","u");
		Соответствие.Вставить("ф","f");
		Соответствие.Вставить("х","kh");
		Соответствие.Вставить("ц","ts");
		Соответствие.Вставить("ч","ch");
		Соответствие.Вставить("ш","sh");
		Соответствие.Вставить("щ","shch");
		Соответствие.Вставить("ъ",""); // пропускается
		Соответствие.Вставить("ы","y");
		Соответствие.Вставить("ь",""); // пропускается
		Соответствие.Вставить("э","e");
		Соответствие.Вставить("ю","yu");
		Соответствие.Вставить("я","ya");

	КонецЕсли;

	Возврат Соответствие;

КонецФункции

//	LNK 18.01.2019 09:46:58
Функция Кириллица(ВерхнийРегистр = 0, ДопустимыВНаименовании = Ложь, Дополнительно = "")	Экспорт

//	ВерхнийРегистр = 0	нижний регистр
//	ВерхнийРегистр = 1	ВЕРХНИЙ регистр
//	ВерхнийРегистр = 2	нижний и ВЕРХНИЙ регистр

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("а", Истина);
	Соответствие.Вставить("б", Истина);
	Соответствие.Вставить("в", Истина);
	Соответствие.Вставить("г", Истина);
	Соответствие.Вставить("д", Истина);
	Соответствие.Вставить("е", Истина);
	Соответствие.Вставить("ё", Истина);
	Соответствие.Вставить("ж", Истина);
	Соответствие.Вставить("з", Истина);
	Соответствие.Вставить("и", Истина);
	Соответствие.Вставить("й", Истина);
	Соответствие.Вставить("к", Истина);
	Соответствие.Вставить("л", Истина);
	Соответствие.Вставить("м", Истина);
	Соответствие.Вставить("н", Истина);
	Соответствие.Вставить("о", Истина);
	Соответствие.Вставить("п", Истина);
	Соответствие.Вставить("р", Истина);
	Соответствие.Вставить("с", Истина);
	Соответствие.Вставить("т", Истина);
	Соответствие.Вставить("у", Истина);
	Соответствие.Вставить("ф", Истина);
	Соответствие.Вставить("х", Истина);
	Соответствие.Вставить("ц", Истина);
	Соответствие.Вставить("ч", Истина);
	Соответствие.Вставить("ш", Истина);
	Соответствие.Вставить("щ", Истина);
	Соответствие.Вставить("ъ", Истина);
	Соответствие.Вставить("ы", Истина);
	Соответствие.Вставить("ь", Истина);
	Соответствие.Вставить("э", Истина);
	Соответствие.Вставить("ю", Истина);
	Соответствие.Вставить("я", Истина);
//	украинская специфика
	Соответствие.Вставить("є", Истина);
	Соответствие.Вставить("ї", Истина);
	Соответствие.Вставить("і", Истина);
	Соответствие.Вставить("ґ", Истина);
	Соответствие.Вставить("`", Истина);

	Если НЕ ПустаяСтрока(Дополнительно) Тогда

		Для Позиция = 1 По СтрДлина(Дополнительно) Цикл

			Соответствие.Вставить(Сред(Дополнительно, Позиция, 1), Истина);

		КонецЦикла;

	КонецЕсли;

	Если ВерхнийРегистр = 1 ИЛИ ВерхнийРегистр = 2 Тогда

		Для каждого КлючЗначение Из Соответствие Цикл

			Соответствие.Вставить(ВРег(КлючЗначение.Ключ), Истина);

			Если ВерхнийРегистр = 1 Тогда

				Соответствие.Удалить(КлючЗначение.Ключ);

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Если ДопустимыВНаименовании = Истина Тогда

		Соответствие.Вставить(" ", Истина);
		Соответствие.Вставить("-", Истина);

	КонецЕсли;

	Возврат Соответствие;

КонецФункции

#КонецОбласти
