
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если Не ВебКлиент Тогда
	мИмяКомпьютера = ИмяКомпьютера();
	#КонецЕсли
	
	ОтборыСписковКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Компьютер", мИмяКомпьютера, Истина);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюНастройкуРМК(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
	
		НастройкаРМК = ТекущаяСтрока;
		Если ЗначениеЗаполнено(НастройкаРМК) Тогда
			
			УстановитьТекущуюНастройкуРМКСервер(НастройкаРМК);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Устанавливает текущую настройку для текущего компьютера.
//
// Параметры:
//  НастройкаРМК - Настройка РМК, которая будет установлена как текущая
//
&НаСервере
Процедура УстановитьТекущуюНастройкуРМКСервер(НастройкаРМК)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкаРМКРегистр.Компьютер,
	|	НастройкаРМКРегистр.НастройкаРМК
	|ИЗ
	|	РегистрСведений.НастройкаРМК КАК НастройкаРМКРегистр
	|ГДЕ
	|	НастройкаРМКРегистр.Компьютер = &Компьютер
	|	И НастройкаРМКРегистр.НастройкаРМК = &НастройкаРМК";
	
	Запрос.УстановитьПараметр("Компьютер"   , мИмяКомпьютера);
	Запрос.УстановитьПараметр("НастройкаРМК", НастройкаРМК);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МенеджерРегистраНастройкаРМК           = РегистрыСведений.НастройкаРМК.СоздатьМенеджерЗаписи();
	МенеджерРегистраНастройкаРМК.Компьютер = мИмяКомпьютера;
	
	Если НЕ Выборка.Следующий() Тогда
		МенеджерРегистраНастройкаРМК.НастройкаРМК = НастройкаРМК;
	КонецЕсли;
	
	МенеджерРегистраНастройкаРМК.Записать(Истина);
	
	Элементы.Список.Обновить();
КонецПроцедуры
