


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЭН


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПереносВДругойРеестр(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Вы хотите перенести эти накладные в другой реестр?'"), Режим, 0);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
   
    Если Результат = КодВозвратаДиалога.Да Тогда
    	МассивДокументов = Новый Массив();
    	Для Каждого ТекущаяВыделеннаяСтрока Из Элементы.СписокЭН.ВыделенныеСтроки Цикл
    		ВыделеннаяСтрока = Объект.СписокЭН.НайтиПоИдентификатору(ТекущаяВыделеннаяСтрока);
    		МассивДокументов.Добавить(ВыделеннаяСтрока.ЭлектронныеНакладные);
    	КонецЦикла;

   		ПеренестиВРеестр(МассивДокументов, Объект.Ссылка);
   		
   		ОбновитьОтображениеДанных();
		Прочитать();

    КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПеренестиВРеестр(МассивДокументовРеестра, ТекущийРеестр)

	РеестрДляЗаписи = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РеестрЭН.Ссылка,
		|	РеестрЭН.ВнешняяСсылка
		|ИЗ
		|	Документ.РеестрЭН КАК РеестрЭН
		|ГДЕ
		|	НЕ РеестрЭН.Напечатан
		|	И НЕ РеестрЭН.Ссылка = &Ссылка
		|	И РеестрЭН.МагазинСклад = &МагазинСклад";
		
	Запрос.УстановитьПараметр("Ссылка", ТекущийРеестр);
	Запрос.УстановитьПараметр("МагазинСклад", ТекущийРеестр.МагазинСклад);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		РеестрДляЗаписи = Выборка.ВнешняяСсылка;
		
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭлектроннаяНакладная.Ссылка,
		|	ЭлектроннаяНакладная.ВнешняяСсылка
		|ИЗ
		|	Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
		|ГДЕ
		|	ЭлектроннаяНакладная.Ссылка В (&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивДокументовРеестра);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбменНПСервер.УдалитьИзРеестра(Выборка.Ссылка, Выборка.ВнешняяСсылка);
		ОбменНПСервер.ДобавитьВРеестрЕН(Выборка.Ссылка, Выборка.ВнешняяСсылка, РеестрДляЗаписи);
		ДокументЭН = Выборка.Ссылка.ПолучитьОбъект();
		ДокументЭН.Записать();

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
