///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ShadobaAI
// Этот файл является частью программного обеспечения, распространяемого на условиях
// Mozilla Public License, версия 2.0 (MPL-2.0).
// Текст лицензии доступен по ссылке:
// https://mozilla.org/MPL/2.0/
///////////////////////////////////////////////////////////////////////////////////////////////////////

// @strict-types
#Область СлужебныйПрограммныйИнтерфейс

// см. КафкаОбработкаСобытийСлужебный.КлючЗаписиИсходящихСообщений
Функция КлючиЗаписейИсходящихСообщений(Данные) Экспорт
	Возврат КафкаОбработкаСобытийСлужебный.КлючЗаписиИсходящихСообщений(Данные);
КонецФункции

// Возвращает доступные топики из КЭШа или запускает фоновую операцию получения топиков от брокера.
// 
// Параметры:
//	Брокер - СправочникСсылка.КафкаБрокеры - Брокер
//	ИдентификаторФормы - УникальныйИдентификатор - Уникальный идентификатор формы
//	ОтложенноеЗаполнение - Булево - Отложенное заполнение
// 
// Возвращаемое значение:
//	ФиксированныйМассив Из Строка - Доступные топики
//	см. ДлительныеОперации.ВыполнитьФункцию
Функция ДоступныеТопики(Брокер, ИдентификаторФормы, ОтложенноеЗаполнение) Экспорт
	
	КЭШ = КафкаИнтеграцияСлужебныйПовтИсп.ДоступныеТопики();
	Топики = КЭШ.Получить(Брокер);
	Если Топики = Неопределено Тогда
		ОтложенноеЗаполнение = Истина;
		Возврат ДлительныеОперации.ВыполнитьФункцию(ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы),
			"кфкИнтеграцияСлужебный.ДоступныеТопики", Брокер);
		
	Иначе
		Возврат Топики;
	КонецЕсли;
	
КонецФункции

// Обновляет КЭШ доступных топиков
// 
// Параметры:
//	Брокер - СправочникСсылка.КафкаБрокеры - Брокер
//	Топики - см. КафкаИнтеграцияСлужебный.ДоступныеТопики
Процедура ОбновитьКЭШДоступныхТопиков(Брокер, Топики) Экспорт
	
	КЭШ = КафкаИнтеграцияСлужебныйПовтИсп.ДоступныеТопики();
	КЭШ.Вставить(Брокер, Новый ФиксированныйМассив(Топики));
	
КонецПроцедуры

#КонецОбласти
