
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ЗаписатьНастройкиПользователя(ТаблицаНастроек) Экспорт
	
	Если ТаблицаНастроек.Количество() > 0 Тогда
		
		НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Пользователь.Установить(ТаблицаНастроек[0].Пользователь);
		НаборЗаписей.Отбор.Магазин.Установить(ТаблицаНастроек[0].Магазин);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		Для каждого СтрокаТаблицыНастроек Из ТаблицаНастроек Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицыНастроек.Значение) Тогда
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицыНастроек);
			КонецЕсли;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
