
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Контрагент", "Контрагент");
	СтруктураРеквизитов.Вставить("Магазин", "Магазин");
	
	Реквизиты = ОбщегоНазначенияРТ.ПолучитьЗначенияРеквизитовОбъекта(ПараметрКоманды, СтруктураРеквизитов);
	Магазин = Реквизиты.Магазин;
	Поставщик = Реквизиты.Контрагент;
	
	ОткрытьФорму("Отчет.СостояниеРасчетовСПоставщиками.Форма",
		Новый Структура("Отбор,СформироватьПриОткрытии, КлючВарианта",
		Новый Структура("Поставщик, Магазин", Поставщик, Магазин), Истина, "СостояниеРасчетовСПоставщикамиИзДокумента"),,,
		ПараметрыВыполненияКоманды.Окно
		);

КонецПроцедуры
