&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТолькоПросмотр = Истина;

	УстановитьДанныеПредставление();

КонецПроцедуры

&НаСервере	//	LNK 04.12.2019 14:59:20
Процедура УстановитьДанныеПредставление()

	Элементы.ДанныеПредставление.Видимость = Ложь;

	Если ЗначениеЗаполнено(Запись.Контрагент) Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТаблицаРегистра.ВнешниеДанные КАК ВнешниеДанные
		|ИЗ
		|	РегистрСведений.АрхивДанныхКонтрагентов КАК ТаблицаРегистра
		|ГДЕ
		|	ТаблицаРегистра.Период = &Период
		|	И ТаблицаРегистра.Контрагент = &Контрагент"
		);
		Запрос.УстановитьПараметр("Период", Запись.ИсходныйКлючЗаписи.Период);
		Запрос.УстановитьПараметр("Контрагент", Запись.ИсходныйКлючЗаписи.Контрагент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда

			ЗначениеДанных = Выборка.ВнешниеДанные.Получить();

			Если ТипЗнч(ЗначениеДанных) = Тип("Структура") И НЕ ЗначениеДанных.Количество() = 0 Тогда

				Элементы.ДанныеПредставление.Видимость = Истина;

				ДанныеПредставление = ОбщегоНазначенияКлиентСервер.СтруктураПредставление("Внешние Данные", ЗначениеДанных);

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
