
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	СУММА(РекламныеМатериалыКОтгрузкеОстатки.КоличествоОстаток) КАК Количество,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки КАК ДокументПриемки,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение КАК ДокументРаспоряжение
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКОтгрузке.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Магазин = &Магазин) КАК РекламныеМатериалыКОтгрузкеОстатки
		|ГДЕ
		|	 РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение.ДатаПо < &Период
		
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение";
	
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.РекламныеМатериалы.Загрузить(РезультатЗапроса.Выгрузить())	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда 	
		Объект.Организация = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация; 
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Магазин) тогда 	
		Объект.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин; 
	КонецЕсли;    	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) тогда 	
			Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;    	

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал КАК РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость КАК РекламнаяПлоскость,
		|	СУММА(РекламныеМатериалыКОтгрузкеОстатки.КоличествоОстаток) КАК Количество,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки КАК ДокументПриемки,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение КАК ДокументРаспоряжение
		|ИЗ
		|	РегистрНакопления.РекламныеМатериалыКОтгрузке.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Магазин = &Магазин) КАК РекламныеМатериалыКОтгрузкеОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламныйМатериал,
		|	РекламныеМатериалыКОтгрузкеОстатки.РекламнаяПлоскость,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументПриемки,
		|	РекламныеМатериалыКОтгрузкеОстатки.ДокументРаспоряжение";
	
	Запрос.УстановитьПараметр("Магазин", Объект.Магазин);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Объект.РекламныеМатериалы.Загрузить(РезультатЗапроса.Выгрузить())	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры
