Функция ПодтвердитьРешениеУчетВNavision(Форма, ВнешнееОписаниеОповещения = Неопределено)	Экспорт

	Если ВнешнееОписаниеОповещения = Неопределено Тогда

		ОписаниеОповещения = Новый ОписаниеОповещения("ПодтвердитьРешениеУчетВNavisionПодтверждение"
							//	, ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ВнешниеИсточникиКлиент"), Новый Структура("ЭтотОбъект", Форма))
								, ВнешниеИсточникиКлиент, Новый Структура("ЭтотОбъект", Форма))

	Иначе

		ОписаниеОповещения = ВнешнееОписаниеОповещения;

	КонецЕсли;

	ПоказатьВопрос(ОписаниеОповещения
		, "Документ будет учтён в КСУ (общей системе учёта). Любые изменения
		  |этого документа будут невозможны. Подтвердите своё решение:
		  |[Да]  - установить признак учёта (операция необратимая после записи документа)
		  |[Нет] - работа с документом будет возможна в соответствии с общими правилами"
		, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да
		, "Учесть в Navision?", КодВозвратаДиалога.Нет
	);

КонецФункции

Процедура ПодтвердитьРешениеУчетВNavisionПодтверждение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Если КодВозврата = КодВозвратаДиалога.Да Тогда

		ДополнительныеПараметры.ЭтотОбъект.РегистрацияПередачиВNavisionНаСервере();

	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьОповещениеПередачиДокументаВNavision(Источник, СсылкаНаОбъект, УчестьДокументВNavision)	Экспорт

	Оповестить("РегистрацияПередачиВNavision"
			, Новый Структура(
				"Объект, РегистрацияПередачиВNavision"
				, СсылкаНаОбъект
				, УчестьДокументВNavision)
			, Источник);

КонецПроцедуры

Процедура ПроверитьКнопкуУчестьВNavision(Форма, УстановкаРеквизитаФормы = Ложь, ОснованиеПередано = Истина)	Экспорт

	ВнешниеИсточникиСобытия.ПроверитьКнопкуУчестьВNavision(Форма, УстановкаРеквизитаФормы, ОснованиеПередано);

КонецПроцедуры

//	LNK 18.06.2023 06:13:52
Процедура ПодтвердитьПовторнуюВыгрузкуВNavision(Форма)	Экспорт

	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтвердитьПовторнуюВыгрузкуВNavisionПодтверждение", ВнешниеИсточникиКлиент);

КонецПроцедуры

//	LNK 18.06.2023 06:48:04
Процедура ПодтвердитьПовторнуюВыгрузкуВNavisionПодтверждение(КодВозврата, ДополнительныеПараметры)	Экспорт


КонецПроцедуры

