#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устаревшее. Используется для обратной совместимости. Используйте ОповещенияПользователей.ВыполнитьОповещениеПользователей()
//
Процедура ВыполнитьОповещение(Событие, СсылкаНаОбъект = Неопределено, ТелоСообщения = "", ТипТекста = "") Экспорт
	
	ОповещенияПользователей.ВыполнитьОповещение(Событие, СсылкаНаОбъект, ТелоСообщения, ТипТекста);
		
КонецПроцедуры

// Устаревшее. Используется для обратной совместимости. Используйте ОповещенияПользователей.ВыполнитьПроизвольноеОповещениеПользователей()
//
Процедура ВыполнитьПроизвольноеОповещение(Получатель, Тема = "", Текст = "", Копии = Неопределено, СкрытыеКопии = Неопределено) Экспорт
		
	ОповещенияПользователей.ВыполнитьПроизвольноеОповещение(Получатель, Тема, Текст, Копии, СкрытыеКопии);
		
КонецПроцедуры

#КонецОбласти 

#КонецЕсли