#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.СпособОповещения = Перечисления.СпособыОповещения.Telegram Тогда
			ЭлементРеквизита = ПроверяемыеРеквизиты.Найти("Тема");
			Если ЭлементРеквизита <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ЭлементРеквизита);
			КонецЕсли;
		ИначеЕсли Запись.СпособОповещения = Перечисления.СпособыОповещения.Email Тогда	
			ЭлементРеквизита = ПроверяемыеРеквизиты.Найти("Бот");
			Если ЭлементРеквизита <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ЭлементРеквизита);
			КонецЕсли;
		КонецЕсли;	
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
 
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
