#Область ОбщийИнтерфейс

Функция ПолучитьДанныеПрограммы(КредитнаяПрограмма)	Экспорт

	Возврат ОбменСБанкамиСервер.ПолучитьДанныеПрограммы(КредитнаяПрограмма);

КонецФункции

Функция ТипыУслугБанкаВидамОперацииСчетуНаОплатуПокупателю(ТипУслугиИлиОперация)	Экспорт

	ТипыПоОперации = Новый Соответствие;
	ТипыПоОперации.Вставить(Перечисления.ВидыОперацийСчетНаОплатуПокупателю.Кредит, Перечисления.ТипыУслугБанка.Кредит);
	ТипыПоОперации.Вставить(Перечисления.ВидыОперацийСчетНаОплатуПокупателю.ОплатаЧастями, Перечисления.ТипыУслугБанка.ОплатаЧастями);

	Значение = ТипыПоОперации.Получить(ТипУслугиИлиОперация);

	Если Значение = Неопределено Тогда

		ОперацииПоТипу = Новый Соответствие;

		Для каждого КлючЗначение Из ТипыПоОперации Цикл
			
			ОперацииПоТипу.Вставить(КлючЗначение.Значение, КлючЗначение.Ключ);

		КонецЦикла;

		Значение = ОперацииПоТипу.Получить(ТипУслугиИлиОперация);

	КонецЕсли;

	Возврат Значение;

КонецФункции

#КонецОбласти

