#Область ОбщийИнтерфейс

Функция ПолучитьДанныеПрограммы(КредитнаяПрограмма)	Экспорт

	Возврат ОбменСБанкамиСервер.ПолучитьДанныеПрограммы(КредитнаяПрограмма);

КонецФункции

Функция ТипыУслугБанкаВидамОперацииСчетуНаОплатуПокупателю(ТипУслугиИлиОперация)	Экспорт

	ТипыПоОперации = Новый Соответствие;
	ТипыПоОперации.Вставить(Перечисления.ВидыОперацийСчетНаОплатуПокупателю.Кредит, Перечисления.ТипыУслугБанка.Кредит);
	ТипыПоОперации.Вставить(Перечисления.ВидыОперацийСчетНаОплатуПокупателю.ОплатаЧастями, Перечисления.ТипыУслугБанка.ОплатаЧастями);

	Значение = ТипыПоОперации.Получить(ТипУслугиИлиОперация);

	Если Значение = Неопределено Тогда

		ОперацииПоТипу = Новый Соответствие;

		Для каждого КлючЗначение Из ТипыПоОперации Цикл
			
			ОперацииПоТипу.Вставить(КлючЗначение.Значение, КлючЗначение.Ключ);

		КонецЦикла;

		Значение = ОперацииПоТипу.Получить(ТипУслугиИлиОперация);

	КонецЕсли;

	Возврат Значение;

КонецФункции

Функция ДанныеLiqPay() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("public_key", "sandbox_i1420262809");
	Результат.Вставить("private_key", "sandbox_Xdb5toppjWbxKl5tn4AKm8VLRk79WpI8R58lxWWE");
	Результат.Вставить("АдресСайта", "77.88.225.90");
	Результат.Вставить("Порт", 21);
	Результат.Вставить("Логин", "liqpay");
	Результат.Вставить("Пароль", "9Jn2PGpNjk");

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ПараметрыСоединения.ServerAddress КАК АдресСайта,
		|	ПараметрыСоединения.Port КАК Порт,
		|	ПараметрыСоединения.Account КАК Логин,
		|	ПараметрыСоединения.Password КАК Пароль,
		|	ПараметрыСоединения.public_key КАК public_key,
		|	ПараметрыСоединения.private_key КАК private_key
		|ИЗ
		|	РегистрСведений.ПараметрыСоединения КАК ПараметрыСоединения
		|ГДЕ
		|	ПараметрыСоединения.Активен
		|	И ПараметрыСоединения.Источник = ЗНАЧЕНИЕ(Перечисление.ВнешниеИсточники.LiqPay)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.private_key = Выборка.private_key;
		Результат.public_key = Выборка.public_key;
		Результат.АдресСайта = Выборка.АдресСайта;
		Результат.Логин = Выборка.Логин;
		Результат.Пароль = Выборка.Пароль;
		Результат.Порт = Выборка.Порт;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции


#КонецОбласти

