
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПриоритетСклада = Объект.Приоритет + 1;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриоритетСкладовОтгрузки.Ссылка
		|ИЗ
		|	Справочник.ПриоритетСкладовОтгрузки КАК ПриоритетСкладовОтгрузки
		|ГДЕ
		|	ПриоритетСкладовОтгрузки.Приоритет >= &Приоритет
		|	И НЕ ПриоритетСкладовОтгрузки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Приоритет", Объект.Приоритет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПриоритетСкладаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПриоритетСкладаОбъект.Приоритет = ПриоритетСклада;
		ПриоритетСкладаОбъект.Записать();
		
		ПриоритетСклада = ПриоритетСклада + 1;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
