#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//	LNK 21.07.2020 07:31:45
Процедура КорректировкаИдентификаторов(БылIDNG, СталIDNG, ГруппаНоменклатуры)	Экспорт

	Если ПустаяСтрока(БылIDNG) ИЛИ БылIDNG = СталIDNG Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

//	---------------------------------------------------------------------------------------


КонецПроцедуры


#КонецЕсли
