
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокРеквизитов();
	
	УстановитьВсеОтметкиСервер(Истина);
	
	ИспользоватьАссортимент = АссортиментСервер.ПолучитьФункциональнуюОпциюИспользованияАссортимента();
	Элементы.РазрешитьРедактированиеФорматМагазина.Видимость = ИспользоватьАссортимент;
	Элементы.РазрешитьРедактированиеКонтролироватьАссортимент.Видимость = ИспользоватьАссортимент;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	Если РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриОтгрузке Тогда
		Результат.Добавить("ИспользоватьОрдернуюСхемуПриОтгрузке");
	КонецЕсли;

	Если РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
		Результат.Добавить("ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриПоступлении Тогда
		Результат.Добавить("ИспользоватьОрдернуюСхемуПриПоступлении");
	КонецЕсли;
	
	Если РазрешитьРедактированиеВидМинимальныхЦенПродажи Тогда
		Результат.Добавить("ВидМинимальныхЦенПродажи");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользоватьПрименениеЦен Тогда
		Результат.Добавить("ИспользоватьПрименениеЦен");
	КонецЕсли;

	Если РазрешитьРедактированиеПравилоЦенообразования Тогда
		Результат.Добавить("ПравилоЦенообразования");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСкладПоступления Тогда
		Результат.Добавить("СкладПоступления");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСкладПродажи Тогда
		Результат.Добавить("СкладПродажи");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСегментИсключаемойИзСкидокНоменклатуры Тогда
		Результат.Добавить("СегментИсключаемойНоменклатуры");
	КонецЕсли;
	
	Если РазрешитьРедактированиеПорядокОкругленияСуммыЧекаВПользуПокупателя Тогда
		Результат.Добавить("ПорядокОкругленияСуммыЧекаВПользуПокупателя");
	КонецЕсли;
	
	Если Элементы.РазрешитьРедактированиеФорматМагазина.Видимость И РазрешитьРедактированиеФорматМагазина Тогда
		Результат.Добавить("ФорматМагазина");
	КонецЕсли;
	
	Если Элементы.РазрешитьРедактированиеКонтролироватьАссортимент.Видимость И РазрешитьРедактированиеКонтролироватьАссортимент Тогда
		Результат.Добавить("КонтролироватьАссортимент");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользоватьПрямуюИнкассацию Тогда
		Результат.Добавить("ИспользоватьПрямуюИнкассацию");
	КонецЕсли;

//	LNK 17.11.2016 11:19:27
	Если РазрешитьРедактированиеКодФилиала Тогда

		Результат.Добавить("КодФилиала");

	КонецЕсли;

	Если РазрешитьРедактированиеНомерМагазина Тогда

		Результат.Добавить("НомерМагазина");

	КонецЕсли;

	Если РазрешитьРедактированиеВведенВЭксплуатацию Тогда

		Результат.Добавить("ВведенВЭксплуатацию");

	КонецЕсли;

	Если РазрешитьРедактированиеДатаНачалаРаботы Тогда

		Результат.Добавить("ДатаНачалаРаботы");

	КонецЕсли;

	Если РазрешитьРедактированиеКассаМагазина Тогда

		Результат.Добавить("КассаМагазина");

	КонецЕсли;

	Если РазрешитьРедактированиеСкладПереброски Тогда

		Результат.Добавить("СкладПереброски");

	КонецЕсли;

	Если РазрешитьРедактированиеГород Тогда

		Результат.Добавить("Город");

	КонецЕсли;

	Если РазрешитьРедактированиеБлокирован Тогда

		Результат.Добавить("Блокирован");

	КонецЕсли;

	Если РазрешитьРедактированиеОбособленноеПодразделениеОрганизации Тогда

		Результат.Добавить("ОбособленноеПодразделениеОрганизации");

	КонецЕсли;

	Если РазрешитьРедактированиеВидДеятельности Тогда

		Результат.Добавить("ВидДеятельности");

	КонецЕсли;

	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	
	УстановитьВсеОтметкиКлиент(Истина)
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	УстановитьВсеОтметкиКлиент(Ложь)
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьСписокРеквизитов()
	
	Для каждого ЭлементФормы Из Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") 
			И Найти(ЭлементФормы.Имя, "РазрешитьРедактирование") = 1 Тогда
			СписокРеквизитов.Добавить(ЭлементФормы.Имя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеОтметкиСервер(ЗначениеОтметки)
	
	Для каждого ЭлементСписка из СписокРеквизитов Цикл
		
		ЭтотОбъект[ЭлементСписка.Значение] = ЗначениеОтметки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметкиКлиент(ЗначениеОтметки)
	
	Для каждого ЭлементСписка из СписокРеквизитов Цикл
		
		ЭтотОбъект[ЭлементСписка.Значение] = ЗначениеОтметки;
		
	КонецЦикла;
	
КонецПроцедуры
