#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда	//	LNK 15.01.2021 10:58:37

		Возврат;

	КонецЕсли;

	// отказываемся от выполнения типового механизма регистрации объектов
	ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	
	// удаляем все узлы, добавленные по авторегистрации, если признак авторегистрации был ошибочно установлен
	ОбменДанными.Получатели.Очистить();
	
	// заполняем свойство УникальныйИдентификаторИсточникаСтрокой из ссылки источника
	Если Количество() > 0 Тогда
		
		ПерваяЗаписьНабора = ЭтотОбъект[0];

		Если ЗначениеЗаполнено(ПерваяЗаписьНабора.УникальныйИдентификаторИсточника) Тогда

			Если ПерваяЗаписьНабора.ОбъектВыгруженПоСсылке = Истина Тогда

				Возврат;

			КонецЕсли;
			
			ПерваяЗаписьНабора.УникальныйИдентификаторИсточникаСтрокой = СокрЛП(ПерваяЗаписьНабора.УникальныйИдентификаторИсточника.УникальныйИдентификатор());

		КонецЕсли;

		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл	//	LNK 15.01.2021 10:57:33

			ЗаписьНабора.ДатаИзменения = ТекущаяДата();

		КонецЦикла;

	КонецЕсли;
	
	Если ОбменДанными.Загрузка
		ИЛИ Не ЗначениеЗаполнено(Отбор.УзелИнформационнойБазы.Значение)
		ИЛИ Не ЗначениеЗаполнено(Отбор.УникальныйИдентификаторПриемника.Значение)
		ИЛИ Не ОбщегоНазначения.СсылкаСуществует(Отбор.УзелИнформационнойБазы.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	// набор записей должен регистрироваться только на одном узле, указанном в отборе
	ОбменДанными.Получатели.Добавить(Отбор.УзелИнформационнойБазы.Значение);
	
КонецПроцедуры

#КонецЕсли