///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
	ОбщегоНазначенияРТ.ЗаполнитьШапкуДокумента(Объект,КартинкаСостоянияДокумента,СостояниеДокумента,РазрешеноПроведение);
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Для каждого СотрудникиВедомости Из Объект.Зарплата Цикл
			СотрудникиВедомости.ВыплаченностьЗарплаты = Перечисления.ВыплаченностьЗарплаты.НеВыплачено;
			СотрудникиВедомости.СуммаВыплаты = 0.00;
			СотрудникиВедомости.КомпенсацияЗаЗадержкуЗарплаты = 0.00;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьИтоговыеПоказатели();
		СтатусДокумента = Объект.Проведен;
		УстановитьДоступностьЭлементовПоПроведению();
	КонецЕсли;
	
	УправлениеДоступностьюРедактирования();

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	ОбновитьИнформациюВыплаченнойЗарплатыДляСпискаРаботников();
	ОбщегоНазначенияРТКлиентСервер.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	ОбновитьИтоговыеПоказатели();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьИнформациюВыплаченнойЗарплатыДляСпискаРаботников();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненаВыплатаРКО" Тогда
		ОбновитьИнформациюВыплаченнойЗарплатыДляСпискаРаботников();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Ответственный.Пустая() Тогда
		ТекущийОбъект.Ответственный = Пользователи.ТекущийПользователь()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененаПлатежнаяВедомость");
	ОбщегоНазначенияРТКлиентСервер.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ОткрытьФормуРедактированияКомментария(Элемент.ТекстРедактирования, Объект.Комментарий, Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	
	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ "Зарплата"

&НаКлиенте
Процедура ЗарплатаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЗарплатаРКО" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РКО) Тогда
		ПараметрыФормы = Новый Структура("Ключ", Элемент.ТекущиеДанные.РКО);
		ОткрытьФорму("Документ.РасходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Зарплата.ТекущиеДанные.ФизЛицо = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
		Элементы.Зарплата.ТекущиеДанные.ВыплаченностьЗарплаты = ПредопределенноеЗначение("Перечисление.ВыплаченностьЗарплаты.НеВыплачено");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ПоВедомостиЕстьВыплаты Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаПередУдалением(Элемент, Отказ)
	
	Если Элементы.Зарплата.ТекущиеДанные.ФлагРКО = ИСТИНА ИЛИ ПоВедомостиЕстьВыплаты Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаПриИзменении(Элемент)
	
	ОбновитьИтоговыеПоказатели();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьВыплаченоНедепонированнойЗарплате(Команда)
	
	УстановкаВыплаченностиЗарплатыВСпискеРаботников(ПредопределенноеЗначение("Перечисление.ВыплаченностьЗарплаты.Выплачено"));
	ОбновитьИтоговыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкуДепонировать(Команда)
	
	УстановкаВыплаченностиЗарплатыВСпискеРаботников(ПредопределенноеЗначение("Перечисление.ВыплаченностьЗарплаты.Задепонировано"));
	ОбновитьИтоговыеПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	СтатусДокумента = Не СтатусДокумента;
	УстановитьДоступностьЭлементовПоПроведению();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура получает информацию была ли выплачена зарплата работнику по ведомости.
// Если зарплата уже выплачена, то строка в документе с этим работником должна быть не доступна для редакитрования.
//
&НаСервере
Процедура ОбновитьИнформациюВыплаченнойЗарплатыДляСпискаРаботников()
	
	МассивРезультатовЗапросов = Документы.ЗарплатаКВыплатеОрганизаций.ДанныеПоВыплаченностиВедомости(Объект);
	Выборка = МассивРезультатовЗапросов[1].Выбрать();
	ВыборкаВедомостьОплачена = МассивРезультатовЗапросов[2].Выбрать();
	
	ПоВедомостиЕстьВыплаты = Ложь;
	Для итератор = 0 По Выборка.Количество() - 1 Цикл
		Выборка.Следующий();
		ПоВедомостиЕстьВыплаты = ?(ПоВедомостиЕстьВыплаты = Истина, ПоВедомостиЕстьВыплаты, Выборка.ФлагРКО);
		ЭлементФормыСтрока = Объект.Зарплата.Получить(итератор);
		ЭлементФормыСтрока.ФлагРКО = Выборка.ФлагРКО;
		ЭлементФормыСтрока.РКО = Выборка.РКО;
	КонецЦикла;
	Элементы.КоманднаяПанельЗарплатаВсеДействия.Доступность = НЕ ПоВедомостиЕстьВыплаты;
	Элементы.КоманднаяПанельЗарплата.Доступность = НЕ ПоВедомостиЕстьВыплаты;
	ЭтотОбъект.ТолькоПросмотр = Ложь;
	Если ВыборкаВедомостьОплачена.Следующий() Тогда
		Если ВыборкаВедомостьОплачена.ВедомостьОплаченаПолностью Тогда
			Элементы.ЗарплатаВыплаченностьЗадепонировано.Доступность = Ложь;
			Элементы.ЗарплатаДепонировать.Доступность = Ложь;
			ЭтотОбъект.ТолькоПросмотр = Объект.Проведен;
			Если НЕ Объект.Проведен Тогда
				СтатусДокумента = Истина;
				УстановитьДоступностьЭлементовПоПроведению();
			КонецЕсли;
			ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Изменить", "Доступность", Ложь);
		Иначе
			Элементы.ЗарплатаВыплаченностьЗадепонировано.Доступность = Истина;
			Элементы.ЗарплатаДепонировать.Доступность = Истина;
			Если ВыборкаВедомостьОплачена.ВедомостьОплаченаНеПолностью Тогда
				СтатусДокумента = Истина;
				УстановитьДоступностьЭлементовПоПроведению();
				ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Изменить", "Доступность", Ложь);
			Иначе
				СтатусДокумента = Объект.Проведен;
				УстановитьДоступностьЭлементовПоПроведению();
			КонецЕсли; 
		КонецЕсли;
	Иначе
		Элементы.ЗарплатаВыплаченностьЗадепонировано.Доступность = Истина;
		Элементы.ЗарплатаДепонировать.Доступность = Истина;
		СтатусДокумента = Объект.Проведен;
		УстановитьДоступностьЭлементовПоПроведению();
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает для строк ведомости отметку выплаченности зарплаты
// 
// Параметры:
//	Выплаченность - ПеречислениеСсылка.ВыплаченностьЗарплаты - устанавливаемая отметка
//
&НаКлиенте
Процедура УстановкаВыплаченностиЗарплатыВСпискеРаботников(ВыбранноеЗначение)
	
	Для каждого СтрокаТЧ Из Объект.Зарплата Цикл
		Если СтрокаТЧ.ВыплаченностьЗарплаты = ПредопределенноеЗначение("Перечисление.ВыплаченностьЗарплаты.НеВыплачено")
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.ВыплаченностьЗарплаты)
		Тогда
			СтрокаТЧ.ВыплаченностьЗарплаты = ВыбранноеЗначение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДоступностьюРедактирования()

	Если Пользователи.РолиДоступны("ИзменениеЗарплатыКВыплатеОрганизаций") 
	И НЕ Пользователи.РолиДоступны("ДобавлениеИзменениеЗарплатыКВыплатеОрганизаций")
	И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		
		НаименованиеГруппыДляКнопкиЗапрета = Элементы.ГруппаНевидимая;
		
		ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Зарплата", "ИзменятьСоставСтрок", Ложь);
		ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Зарплата", "ИзменятьПорядокСтрок", Ложь);
		
		МассивЭлементов = Новый Массив;
		МассивЭлементов.Добавить("ФлагРКО");
		МассивЭлементов.Добавить("ЗарплатаФизлицо");
		МассивЭлементов.Добавить("ЗарплатаСумма");
		МассивЭлементов.Добавить("ЗарплатаКомпенсацияЗаЗадержкуЗарплаты");
		МассивЭлементов.Добавить("ЗарплатаРКО");
		МассивЭлементов.Добавить("ЗарплатаТабельныйНомер");
		МассивЭлементов.Добавить("Ответственный");
		МассивЭлементов.Добавить("Магазин");
		МассивЭлементов.Добавить("Организация");
		МассивЭлементов.Добавить("Дата");
		МассивЭлементов.Добавить("ПериодРегистрации");
		
		ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "ТолькоПросмотр", Истина);
		
		ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Изменить", "Доступность", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИтоговыеПоказатели()
	
	ТаблицаВыплат = Объект.Зарплата.Выгрузить(, "ВыплаченностьЗарплаты, Сумма");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаВыплат.ВыплаченностьЗарплаты КАК ВыплаченностьЗарплаты,
		|	ТаблицаВыплат.Сумма КАК Сумма
		|ПОМЕСТИТЬ ЗарплатаКВыплатеОрганизацийЗарплата
		|ИЗ
		|	&ТаблицаВыплат КАК ТаблицаВыплат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Выплачено)
		|				ТОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Выплачено,
		|	СУММА(ВЫБОР
		|			КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено)
		|				ТОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеВыплачено,
		|	СУММА(ВЫБОР
		|			КОГДА ЗарплатаКВыплатеОрганизацийЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)
		|				ТОГДА ЗарплатаКВыплатеОрганизацийЗарплата.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Задепонировано
		|ИЗ
		|	ЗарплатаКВыплатеОрганизацийЗарплата КАК ЗарплатаКВыплатеОрганизацийЗарплата";
		
	Запрос.УстановитьПараметр("ТаблицаВыплат", ТаблицаВыплат);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Выплачено = 0;
		НеВыплачено = 0;
		Задепонировано = 0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Выплачено = Выборка.Выплачено;
		НеВыплачено = Выборка.НеВыплачено;
		Задепонировано = Выборка.Задепонировано;
		
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовПоПроведению()
	
	ТолькоПросмотрЭлементов = СтатусДокумента;
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("Магазин");
	МассивЭлементов.Добавить("Организация");
	МассивЭлементов.Добавить("Дата");
	МассивЭлементов.Добавить("ПериодРегистрации");
	
	ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "ТолькоПросмотр", ТолькоПросмотрЭлементов);
	ОбщегоНазначенияРТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Изменить", "Доступность", ТолькоПросмотрЭлементов);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
