////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ СО СТАВКАМИ НАЛОГОВ И ВЗНОСОВ


// Функция возвращает ставку акцизного налога 
//
Функция ПолучитьСтавкуАкцизногоНалога(ПодакцизныйТовар) Экспорт

	Если ПодакцизныйТовар Тогда
		Возврат 0.05;
	Иначе
		Возврат 0;	
	КонецЕсли; 

КонецФункции // ПолучитьСтавкуАкцизногоНалога()


// Рассчитывает сумму акцизного налога исходя из суммы и флагов налогообложения
//
// Параметры: 
//  Сумма            	- число, сумма от которой надо рассчитывать налоги, 
//  СуммаВключаетНалоги - булево, признак учета НДС и акциза в сумме, 
//  ПодакцизныйТовар, 
//  ПодакцизныеТоварыДляКоммерческогоИспользования - параметры, влияющие на расчет суммы
//
// Возвращаемое значение:
//  Число, полученная сумма акцизного налога
//
Функция РассчитатьСуммуАкцизногоНалога(Сумма, СуммаВключаетАкциз, ПодакцизныйТовар, ПодакцизныеТоварыДляКоммерческогоИспользования) Экспорт

	Если ПодакцизныеТоварыДляКоммерческогоИспользования Тогда
		СуммаАкцизногоНалога = 0;
	Иначе 
		СтавкаАкцизногоНалога = ПолучитьСтавкуАкцизногоНалога(ПодакцизныйТовар);
		Если СуммаВключаетАкциз Тогда
			СуммаАкцизногоНалога = Сумма * СтавкаАкцизногоНалога/(1+СтавкаАкцизногоНалога);
		Иначе
			СуммаАкцизногоНалога = Сумма * СтавкаАкцизногоНалога;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат СуммаАкцизногоНалога;

КонецФункции // РассчитатьСуммуАкцизногоНалога()

// Процедура устанавливает видимость полей акцизного налога.
//
// Параметры:
//	Объект - ДанныеФормыСтруктура - Текущий документ
//	Элемент - ПолеВвода - Элемент формы
//
Процедура УстановитьВидимостьПолейАкцизногоНалога(Объект, Элемент) Экспорт
	
	Элемент.Видимость = ДействуетАкцизныйНалог(Объект.Дата);
	
КонецПроцедуры // УстановитьВидимостьСтатьиДекларацииПоЕдиномуНалогу()

// Функция проверяет, действует ли акцизный налог на дату.
//
// Параметры:
//	ДатаДокумента - Дата - Дата,на которую проверить действие акцизного налога
//
Функция ДействуетАкцизныйНалог(ДатаДокумента) Экспорт

	Возврат НЕ ЗначениеЗаполнено(ДатаДокумента) ИЛИ ДатаДокумента > '20150101';

КонецФункции // ДействуетАкцизныйНалог()
 
