
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьПривилегированныйРежим(Истина);
	ЦО = Справочники.СтруктураУзлов.ЦентральныйОфис.ПолучитьОбъект();

	СтрокаТаблицы = ЦО.ПроизвольныеДанные.Найти("СоответствиеОтчетовИз7","Ключ");
	
	Попытка
	
		ТЗ.Загрузить(СтрокаТаблицы.Данные.Получить());
	
	Исключение	
	КонецПопытки;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	ЦО = Справочники.СтруктураУзлов.ЦентральныйОфис.ПолучитьОбъект();

	СтрокаТаблицы = ЦО.ПроизвольныеДанные.Найти("СоответствиеОтчетовИз7","Ключ");
	Если СтрокаТаблицы = Неопределено Тогда
	
		СтрокаТаблицы = ЦО.ПроизвольныеДанные.Добавить();
		СтрокаТаблицы.Ключ = "СоответствиеОтчетовИз7";
	   		
	КонецЕсли;

	СтрокаТаблицы.Данные = Новый ХранилищеЗначения(ТЗ.Выгрузить(), Новый СжатиеДанных(9));

	ЦО.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Вариант = ЭтотОбъект.Элементы.ТЗ.ТекущиеДанные.ОтчетВРознице;
	ВариантОбъект = ПолучитьОбъектВарианта(Вариант);
	
	Уникальность = "Отчет." + ВариантОбъект.ИмяОтчета;
		Если ЗначениеЗаполнено(ВариантОбъект.КлючВарианта) Тогда
			Уникальность = Уникальность + "/КлючВарианта." + ВариантОбъект.КлючВарианта;
		КонецЕсли;
	ИмяОтчета = ВариантОбъект.ИмяОтчета;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", ВариантОбъект.КлючВарианта);
	ПараметрыОткрытия.Вставить("КлючПараметровПечати", );
	ПараметрыОткрытия.Вставить("КлючСохраненияПоложенияОкна", );
	
	ОткрытьФорму("Отчет." + ИмяОтчета + ".Форма", ПараметрыОткрытия, Неопределено, );
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектВарианта(Вариант)

	 ВариантОбъект = Вариант.ПолучитьОбъект();
	 Возврат Новый Структура("КлючВарианта, ИмяОтчета", Вариант.КлючВарианта, Вариант.Отчет.Имя); 

КонецФункции // ПолучитьОбъектВарианта(Вариант);()

