
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Путь = "";
	НомерТТН = ПолучитьНомерТТН(ПараметрКоманды);
	Магазин = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПараметрКоманды,"МагазинОтправитель");
	ОператорДоставки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПараметрКоманды,"ОператорДоставки");
	Путь = ПолучитьПутьКФото(Магазин,ОператорДоставки)+"ТТН"+НомерТТН+".pdf"; 
	ПопытКа 
		ЗапуститьПриложение(Путь);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерТТН(ДокСсылка) 
	ТТН = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИнформацияТТН.НомерТТН КАК НомерТТН
		|ИЗ
		|	РегистрСведений.ИнформацияТТН КАК ИнформацияТТН
		|ГДЕ
		|	ИнформацияТТН.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТТН = ВыборкаДетальныеЗаписи.НомерТТН;
	КонецЦикла;
    Возврат ТТН;
КонецФункции

&НаСервере
Функция ПолучитьПутьКФото(Магазин,ОператорДоставки) 
	ПутьКФото = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиСлужбДоставки.АдресДляПечатиPDF КАК АдресДляПечатиPDF
		|ИЗ
		|	РегистрСведений.НастройкиСлужбДоставки КАК НастройкиСлужбДоставки
		|ГДЕ
		|	НастройкиСлужбДоставки.ОператорДоставки = &ОператорДоставки
		|	И НастройкиСлужбДоставки.Магазин = &Магазин";
	
	Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПустаяСтрока(ВыборкаДетальныеЗаписи.АдресДляПечатиPDF) Тогда
			ПутьКФото = "https://roznicabkp.antoshka.ua/ttn/";
		Иначе
			ПутьКФото = ВыборкаДетальныеЗаписи.АдресДляПечатиPDF;
		КонецЕсли;
	КонецЦикла;
    Возврат ПутьКФото;
КонецФункции
