
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Путь = ПолучитьПутьТТН(ПараметрКоманды);
	ПопытКа 
		ЗапуститьПриложение(Путь);
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ПолучитьПутьТТН(ДокСсылка)
	
	Результат = "";
	ДанныеЭН = Документы.ЭлектроннаяНакладная.ПолучитьЭНПоДокументуОснования(ДокСсылка);
	Если ДанныеЭН.ЕстьТТН Тогда
		Результат = ДанныеЭН.ПутьКФайлуТТН;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции