Процедура ЗаписьСообщенияВРегистр(СтруктураЗаписи, СтарыйИД = "") Экспорт  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПустаяСтрока(СтруктураЗаписи.Телефон) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Не ПустаяСтрока(СтарыйИД) Тогда
			НаборЗаписей = РегистрыСведений.СообщениеКлиенту.СоздатьНаборЗаписей();
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.Отбор.Дата.Установить(СтруктураЗаписи.Дата);
			НаборЗаписей.Отбор.ИДСообщения.Установить(СтарыйИД); 
			НаборЗаписей.Записать();
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.СообщениеКлиенту.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Отбор.Дата.Установить(СтруктураЗаписи.Дата);
		НаборЗаписей.Отбор.ИДСообщения.Установить(СтруктураЗаписи.ИДСообщения);
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда 
			НоваяЗапись = НаборЗаписей.Добавить();
		Иначе 
			НоваяЗапись = НаборЗаписей[0];
		КонецЕсли;
		
		НоваяЗапись.Дата 					= СтруктураЗаписи.Дата;
		НоваяЗапись.ИДСообщения				= СтруктураЗаписи.ИДСообщения; 
		НоваяЗапись.ТекстСообщения 			= СтруктураЗаписи.ТекстСообщения;
		НоваяЗапись.ТипСообщения 			= СтруктураЗаписи.ТипСообщения;
		НоваяЗапись.СостояниеСообщения 		= СтруктураЗаписи.СостояниеСообщения;
		НоваяЗапись.Телефон 				= СтруктураЗаписи.Телефон;
		НоваяЗапись.ДатаСледующейОтправки 	= СтруктураЗаписи.ДатаСледующейОтправки;  
		
		НаборЗаписей.Записать(Истина); 
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;

КонецПроцедуры    

Функция СтруктураЗаписиРегистра() Экспорт 
	
	СтруктураЗаписи = Новый Структура("
		| Дата,
		| ИДСообщения,
		| ТекстСообщения,
		| ТипСообщения,
		| СостояниеСообщения,
		| Телефон,
		| ДатаСледующейОтправки");
	
	Возврат СтруктураЗаписи;
	
КонецФункции
