
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолусчитьТипыДоставки(ТипДоставки) Экспорт
	
	Результат = Новый Массив();
	
	Если ТипДоставки Тогда
		Результат.Добавить(АдресАдрес);
		Результат.Добавить(СкладАдрес);
	Иначе
		Результат.Добавить(АдресСклад);
		Результат.Добавить(СкладСклад);
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
