#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Найти почтомат по номеру.
// 
// Параметры:
//  НомерПочтомата - Строка - Номер почтомата в виде строки
//  Город - СправочникСсылка.ГородаДоставки - Город, в которм нужно найти улицу
//  ОператорДоставки - ПеречислениеСсылка.ОператорыДоставки - Оператор доставки
// 
// Возвращаемое значение:
// СправочникСсылка.Отделения - Ссылка на город доставки
//  
Функция НайтиПочтомат(НомерПочтомата, Город, ОператорДоставки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Почтоматы.Ссылка
		|ИЗ
		|	Справочник.Почтоматы КАК Почтоматы
		|ГДЕ
		|	Почтоматы.ОператорДоставки = &ОператорДоставки
		|	И (Почтоматы.НомерОтделения = &НомерОтделения)
		|	И Почтоматы.Город = &Город";
	
	Запрос.УстановитьПараметр("ОператорДоставки", ОператорДоставки);
	Запрос.УстановитьПараметр("НомерПочтомата", СокрЛП(Строка(НомерПочтомата)));
	Запрос.УстановитьПараметр("Город", Город);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат = Выборка.Ссылка;
		
	Иначе
		
		Результат = ПустаяСсылка();

	КонецЕсли;
	
	Возврат Результат;

КонецФункции
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли