#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//	LNK 03.03.2024 07:26:08
Функция ПолучитьОповещенияПользователя()	Экспорт

	СписокОповещений = Новый Массив;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаОповещений.ДействиеКоманда КАК ДействиеКоманда,
	|	ТаблицаОповещений.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.ОповещенияПользователя КАК ТаблицаОповещений
	|ГДЕ
	|	ТаблицаОповещений.Пользователь = &ТекущийПользователь"
	);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл

			СписокОповещений.Добавить(
				Новый Структура(
					"ИмяСобытия, Параметр, Выполнено"
					, Выборка.ДействиеКоманда
					, Новый Структура("Объект", Выборка.Объект)
					, Ложь
				)
			);

		КонецЦикла;

	КонецЕсли;

	Возврат СписокОповещений;

КонецФункции

//	LNK 03.03.2024 07:35:13
Процедура УдалитьОповещенияПользователя(СписокОповещений)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = РегистрыСведений.ОповещенияПользователя.СоздатьНаборЗаписей();

	Для каждого СоставОповещения Из СписокОповещений Цикл

		Если СоставОповещения.Выполнено Тогда

			НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
			НаборЗаписей.Отбор.ДействиеКоманда.Установить(СоставОповещения.ИмяСобытия);
			НаборЗаписей.Отбор.Объект.Установить(СоставОповещения.Параметр.Объект);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

//	LNK 03.03.2024 07:50:37
Процедура Установить(Объект, ДействиеКоманда)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НаборЗаписей = РегистрыСведений.ОповещенияПользователя.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Отбор.ДействиеКоманда.Установить(ДействиеКоманда);
	НаборЗаписей.Отбор.Объект.Установить(Объект);

	ЗаписьНабора = НаборЗаписей.Добавить();

	ЗаписьНабора.Пользователь = НаборЗаписей.Отбор.Пользователь.Значение;
	ЗаписьНабора.ДействиеКоманда = НаборЗаписей.Отбор.ДействиеКоманда.Значение;
	ЗаписьНабора.Объект = НаборЗаписей.Отбор.Объект.Значение;

	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
