////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПереместитьЭлементВверх()
	
	ПереместитьЭлемент("Вверх");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз()
	
	ПереместитьЭлемент("Вниз");
	
КонецПроцедуры

&НаСервере
Процедура ПереместитьЭлемент(Направление)

	НастройкаПорядкаЭлементов.ПереместитьЭлемент(Список, Элементы.Список, Направление);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	// Проверим, выполняется ли копирование группы
	Если Копирование И Группа Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Добавление новых групп в справочнике запрещено.'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры





