
Функция Personalendpoint(HTTPЗапрос)
	ХТТПОтвет = Новый HTTPСервисОтвет(200);
	УстановитьПривилегированныйРежим(Истина);

	Действие = HTTPЗапрос.ПараметрыURL["Action"];

	Если ТипЗнч(HTTPЗапрос) = Тип("Структура") Тогда	
	//		В целях разработки и отладки процессов, не связанных с HTTP.
	//		Вызываем данную функцию из внешней обработки, предварительно
	//		эмулировав параметр "HTTPЗапрос" как структуру.
			RequestData	= HTTPЗапрос.ТелоЗапросаСтрока;			//	отладочный вариант

	Иначе	RequestData	= HTTPЗапрос.ПолучитьТелоКакСтроку();	//	"боевой" вариант

	КонецЕсли;

	КонтекстПриложения.ЖурналированиеВходящихЗапросов("HRExchange\Personal.Endpoint." + Действие
		, "in"
		, КонтекстПриложения.ПредставлениеЗаголовка(HTTPЗапрос.Заголовки)
		+ Символы.ПС + RequestData
		, Истина
	);

	СоставОшибки = Новый Структура("Отказ, СтатусОшибки, ОписаниеОшибки", Ложь, "", "");

	Если ТипЗнч(HTTPЗапрос) = Тип("Структура") Тогда
		
			ХТТПОтвет = Новый Структура(			// отладочный вариант
				"ТелоЗапросаСтрока, Заголовки, КодСостояния"
				, ""
				, Новый Соответствие
				, 200
			);

	Иначе	ХТТПОтвет = Новый HTTPСервисОтвет(200);	//	"боевой" вариант

	КонецЕсли;

	ХТТПОтвет.Заголовки.Вставить("Content-Type"	, "application/json; charset=utf-8");
	ХТТПОтвет.Заголовки.Вставить("ErrorStatus"	, "");
	ХТТПОтвет.Заголовки.Вставить("ErrorMessage"	, "");

	Если Действие = Неопределено ИЛИ ПустаяСтрока(Действие) Тогда

	//	https://developer.mozilla.org/ru/docs/Web/HTTP/Status
		ХТТПОтвет.КодСостояния	= 400;	//	400 Bad Request
										//	Сервер не может или не будет обрабатывать запрос из-за чего-то,
										//	что воспринимается как ошибка клиента (например, неправильный синтаксис,
										//	формат или маршрутизация запроса).
		ХТТПОтвет.Заголовки.Вставить("ErrorStatus"	, "ACTION_UNKNOWN");
		ХТТПОтвет.Заголовки.Вставить("ErrorMessage"	, СтроковыеФункцииКлиентСервер.СтрокаЛатиницей("Дія для ресурсу не визначена. Помилка!"));
		
		Возврат ХТТПОтвет;
	КонецЕсли;


		Попытка

			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(RequestData);

		//	Формат даты ISO вида: "ГГГГ-ММ-ДДTЧЧ:ММ:ССZ". Дата сериализуется в дату стандарта UTC.
		//	Например: "2009-02-15T00:00:00Z".
			//ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON,, ОбменMagentoСервер.ИменаТипаДата(2), ФорматДатыJSON.ISO);

			//Если ДанныеЗапроса.IDBASE <> ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ИдентификаторУчетнойСистемы") Тогда
			//	ХТТПОтвет.КодСостояния	= 400;	//	400 Bad Request
			//									//	Сервер не может или не будет обрабатывать запрос из-за чего-то,
			//									//	что воспринимается как ошибка клиента (например, неправильный синтаксис,
			//									//	формат или маршрутизация запроса).
			//	ХТТПОтвет.Заголовки.Вставить("ErrorStatus"	, "WRONG_DESTINATION");
			//	ХТТПОтвет.Заголовки.Вставить("ErrorMessage"	, СтроковыеФункцииКлиентСервер.СтрокаЛатиницей("Wrong IDBASE!"));
			//	
			//	Возврат ХТТПОтвет;
			//	
			//КонецЕсли;

			Действие = Нрег(Действие);
			Если Действие = "update" Тогда	//	/Personal/{Action} - последняя лексема
				СтруктураОтвета = ОбновитьПерсонал(RequestData);	//
				ТекстОтвета = ОбменWebRetailСервер.СтруктуруВТекстДЖСОН(СтруктураОтвета);
				ХТТПОтвет = СформироватьHTTPОтвет(ТекстОтвета);
				
			//ИначеЕсли Действие = "getdiscountcalcv2" Тогда	//	/Personal/{Action} - последняя лексема
			Иначе

				ХТТПОтвет.КодСостояния	= 400;	//	400 Bad Request
												//	Сервер не может или не будет обрабатывать запрос из-за чего-то,
												//	что воспринимается как ошибка клиента (например, неправильный синтаксис,
												//	формат или маршрутизация запроса).
				ХТТПОтвет.Заголовки.Вставить("ErrorStatus"	, "ACTION_UNKNOWN");
				ХТТПОтвет.Заголовки.Вставить("ErrorMessage"	, "Вказана дія [" + Действие + "] не може бути опрацьована. Помилка!");

			КонецЕсли;

		Исключение

			ТекстОшибки	= Латиница(ОписаниеОшибки());	//	отдельной строкой для облегчения отладки
			ХТТПОтвет.КодСостояния	= 406;	//	406 Not Acceptable
											//	Сервер после выполнения согласования контента не нашёл содержимого,
											//	соответствующего критериям, заданным пользовательским агентом.
			ХТТПОтвет.Заголовки.Вставить("ErrorStatus"	, "SYS_ERROR");
			ХТТПОтвет.Заголовки.Вставить("ErrorMessage"	, ТекстОшибки);

		КонецПопытки;

	Если ТипЗнч(ХТТПОтвет) = Тип("Структура") Тогда

			ТекстJSON = ХТТПОтвет.ТелоЗапросаСтрока;		//	отладочный вариант

	Иначе	ТекстJSON = ХТТПОтвет.ПолучитьТелоКакСтроку();	//	"боевой" вариант

	КонецЕсли;

	КонтекстПриложения.ЖурналированиеВходящихЗапросов("HRExchange\Personal.Endpoint." + Действие
		, "out"
		, КонтекстПриложения.ПредставлениеЗаголовка(ХТТПОтвет.Заголовки)
		+ Символы.ПС + ТекстJSON
		, Истина
	);

	
	Возврат ХТТПОтвет;
КонецФункции         

Функция Латиница(Текст)
	РусскийАлфавит = "абвгдеёжзийклмнопрстуфхцчшщьыъэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЬЫЪЭЮЯ";
	ЛатинскийАлфавит = " a b v g d e yo zh z i iy k l m n o p r s t u f kh ts ch sh sch ' y ' e yu ya A B V G D E Yo Zh Z S Iy K L M N O P R S T U F Kh Ts Ch Sh Sch ' Y ' E Yu Ya";
	ДлинаТекста = СтрДлина(Текст);
	Перевод = "";
	Для н = 1 По ДлинаТекста Цикл
		ТекСимв = Сред(Текст,н,1);
		п = Найти(РусскийАлфавит,ТекСимв);
		Если п = 0 Тогда
			Перевод = Перевод + ТекСимв;
			Продолжить;
		КонецЕсли;
		т = СтрНайти(ЛатинскийАлфавит, " ",НаправлениеПоиска.СНачала,1,п);
		ы = СтрНайти(ЛатинскийАлфавит, " ",НаправлениеПоиска.СНачала, т + 1,1);
		ТрансСимвол = Сред(ЛатинскийАлфавит,т + 1,ы - т);
		Перевод = Перевод + ТрансСимвол;
	КонецЦикла;
	
	Возврат Перевод;
КонецФункции

Функция ОбновитьПерсонал(ТекстЗапроса)
	Возврат ОбменДаннымиЗУП.ОбработатьМассивСотрудников(ТекстЗапроса);	
КонецФункции

Функция СформироватьHTTPОтвет(ТекстОтвета)
	HTTPОтвет = Новый HTTPСервисОтвет(200);	
	HTTPОтвет.Заголовки.Вставить("Content-Type"	, "application/json; charset=utf-8");
	HTTPОтвет.Заголовки.Вставить("ErrorStatus"	, "");
	HTTPОтвет.Заголовки.Вставить("ErrorMessage"	, "");
	HTTPОтвет.УстановитьТелоИзСтроки(ТекстОтвета);

	Возврат HTTPОтвет;
КонецФункции

