///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;            
	
	Если Параметры.Свойство("Номенклатура") Тогда  
		Номенклатура = Параметры.Номенклатура; 
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Список, "Номенклатура", Параметры.Номенклатура);
		Элементы.ФормаСоздатьКодыSKU.Доступность = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("SKUУстанавливаетсяВГлавномУзлеРИБ");
		Если НЕ Элементы.ФормаСоздатьКодыSKU.Доступность Тогда
			ЭтотОбъект.Команды.СоздатьКодыSKU.Подсказка = НСтр("ru = 'Cоздание SKU в правилах обмена с оборудованием Offline'");
			Элементы.Список.ТолькоПросмотр = Истина;
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьАвтоматическиКодыSKU()
	РегистрыСведений.КодыТоваровSKU.ВыполнитьПроверкуSKU(Номенклатура);
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СоздатьКодыSKU(Команда)
	ЗаполнитьАвтоматическиКодыSKU();
	ОбновитьИнтерфейс();
КонецПроцедуры