//	LNK 22.07.2019 14:24:24
Процедура ДанныеЗаписать(Владелец, Данные, Магазин, Мигрировать = Истина)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.БезопасноеХранилищеДанных.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Владелец    = Владелец;
	МенеджерЗаписи.Данные      = ?(ТипЗнч(Данные) = Тип("ХранилищеЗначения"), Данные, Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9)));
	МенеджерЗаписи.Магазин     = Магазин;
	МенеджерЗаписи.Мигрировать = Мигрировать;

	МенеджерЗаписи.Записать();

КонецПроцедуры

//	LNK 22.07.2019 14:47:25
Функция ДанныеПрочитать(Владелец)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.БезопасноеХранилищеДанных.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Владелец = Владелец;

	МенеджерЗаписи.Прочитать();

	Возврат ?(МенеджерЗаписи.Выбран(), МенеджерЗаписи.Данные, Новый ХранилищеЗначения(Неопределено));

КонецФункции
