
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЛистыЖеланий Расход
	Движения.ЛистыЖеланий.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если Не ЗначениеЗаполнено(ТекСтрокаТовары.Операция) Тогда
			Продолжить;
		ИначеЕсли ТекСтрокаТовары.Операция = Перечисления.ОперацияЛистаЖеланий.Добавление Тогда 
			Движение = Движения.ЛистыЖеланий.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Магазин = Магазин;
			Движение.Операция = ТекСтрокаТовары.Операция;
			Движение.ЛистЖеланий = РедактируемыйДокумент;
			Движение.Корзина = Корзина;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Характеристика = ТекСтрокаТовары.Характеристика;
			Движение.Количество = ТекСтрокаТовары.Количество;
		ИначеЕсли ТекСтрокаТовары.Операция = Перечисления.ОперацияЛистаЖеланий.Отказ или ТекСтрокаТовары.Операция = Перечисления.ОперацияЛистаЖеланий.Продажа Тогда 
			Движение = Движения.ЛистыЖеланий.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Магазин = Магазин;
			Движение.Операция = ТекСтрокаТовары.Операция;
			Движение.ЛистЖеланий = РедактируемыйДокумент;
			Движение.Корзина = Корзина;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Характеристика = ТекСтрокаТовары.Характеристика;
			Движение.Количество = ТекСтрокаТовары.Количество;
		КонецЕсли; 
	КонецЦикла;
	
	// регистр СостояниеЛистаЖеланий
	Движения.СостояниеЛистаЖеланий.Записывать = Истина;
	Движение = Движения.СостояниеЛистаЖеланий.Добавить();
	Движение.Период = Дата;
	Движение.Магазин = Магазин;
	Движение.ЛистЖеланий = РедактируемыйДокумент;
	Движение.Состояние = Перечисления.СостояниеЛистаЖеланий.Корректировка;
	
	ОписаниеОперации = "Корректировка листа желаний №"+ Номер + " от " + Дата + ", на корзину №" + Корзина + "." + Символы.ПС;
	КопияТовары = Товары.Выгрузить();
	КопияТовары.Сортировать("Операция");
	Для каждого Строка Из Товары Цикл
		Если Не ЗначениеЗаполнено(Строка.Операция) Тогда
			 Продолжить;
		ИначеЕсли Строка.Операция = Перечисления.ОперацияЛистаЖеланий.Добавление Тогда
			ОписаниеОперации = ОписаниеОперации + "Добавлена номенклатура: " + Символы.ПС;
			ОписаниеОперации = ОписаниеОперации + Строка.Номенклатура +" в количестве "+ Строка.Количество + Символы.ПС;
		ИначеЕсли Строка.Операция = Перечисления.ОперацияЛистаЖеланий.Продажа Тогда
			ОписаниеОперации = ОписаниеОперации + "Продана номенклатура: " + Символы.ПС;
			ОписаниеОперации = ОписаниеОперации + Строка.Номенклатура +" в количестве "+ Строка.Количество + Символы.ПС;
		ИначеЕсли Строка.Операция = Перечисления.ОперацияЛистаЖеланий.Отказ Тогда
			ОписаниеОперации = ОписаниеОперации + "Отказались от номенклатуры: " + Символы.ПС;
			ОписаниеОперации = ОписаниеОперации + Строка.Номенклатура +" в количестве "+ Строка.Количество + Символы.ПС;
		КонецЕсли; 
	КонецЦикла; 
	
	Движение.ОписаниеОперации = ОписаниеОперации;
КонецПроцедуры
