&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДатаОкончания = НачалоДня(ТекущаяДата());
	ДатаНачала    = НачалоМесяца(ДатаОкончания);

	Магазин = ПараметрыСеанса.ТекущийМагазин;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьПечатныйДокумент(Команда)

	Если ПроверитьЗаполнение() Тогда

		ПараметрКоманды = Новый Структура(
			"Магазин, Склад, ДатаНачала, ДатаОкончания"
			, Магазин, Склад, ДатаНачала, ДатаОкончания);
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ПересчетТоваровСамостоятельный",
				"РезультатыПересчетовТоваровСамостоятельных",
				ПараметрКоманды,
				ВладелецФормы);
		Закрыть();

	КонецЕсли;

КонецПроцедуры
