
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьОтображениеСписка();
	ОтправлятьИзЦентра = 1;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТопикПриИзменении(Элемент)
	
	ОбновитьОтображениеСписка();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтображениеСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("Топик", Топик);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеТопики", Топик.Пустая());
	
КонецПроцедуры

#КонецОбласти
