
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаправлениеОтправки = 1;
	ОбновитьОтображениеСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТопикПриИзменении(Элемент)
	
	ОбновитьОтображениеСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеОтправкиПриИзменении(Элемент)
	
	ОбновитьОтображениеСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеОтправкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НаправлениеОтправки = 1;
	ОбновитьОтображениеСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтображениеСписка()
	
	Список.Параметры.УстановитьЗначениеПараметра("Топик", Топик);
	Список.Параметры.УстановитьЗначениеПараметра("ВсеТопики", Топик.Пустая());
	Список.Параметры.УстановитьЗначениеПараметра("НаправлениеОтправки", Число(НаправлениеОтправки));

КонецПроцедуры

#КонецОбласти
