
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПотокаОбмена.ПолученныеДанные,
		|	ДанныеПотокаОбмена.КоличествоПолучений,
		|	ДанныеПотокаОбмена.ПоследняяОшибка
		|ИЗ
		|	РегистрСведений.ИнтернетЗаказВнешниеДанные КАК ДанныеПотокаОбмена
		|ГДЕ
		|	ДанныеПотокаОбмена.ВремяПолучения = &ВремяПолучения";
	
	Запрос.УстановитьПараметр("ВремяПолучения", Запись.ВремяПолучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПолученныеДанныеОбмена = Выборка.ПолученныеДанные.Получить();
		ПоследняяОшибка = Выборка.ПоследняяОшибка.Получить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
