///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КодКПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СписокСоответствия = СписокДолжностейКлассификатора();

	ЭлементСписка = ВыбратьИзСписка(СписокСоответствия, Элемент);
	
	Если НЕ ЭлементСписка = Неопределено Тогда

		Объект.КодКП = СокрЛП(Лев(ЭлементСписка.Значение, 6));
		Объект.Наименование = СокрЛП(Сред(ЭлементСписка.Значение, 7));

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СписокДолжностейКлассификатора()

	Макет = Справочники.ДолжностиОрганизаций.ПолучитьМакет("КлассификаторПрофессийИДолжностей");
	
	СписокСоответствия = Новый СписокЗначений();
		
	ТекущаяСтрока = 0;
	ТЗ = Макет.ТекущаяОбласть;
	Пока ТекущаяСтрока < Макет.ВысотаТаблицы Цикл
		ТЗ = Макет.НайтиТекст(СокрЛП(Объект.Наименование), ТЗ,,,,,Истина);		
		Если ТЗ = Неопределено Тогда
			Прервать;
		КонецЕсли;                 
				
		СтрокаКод       = "R" + Формат(ТЗ.Верх, "ЧГ=0") + "C2";
		СтрокаДолжность = "R" + Формат(ТЗ.Верх, "ЧГ=0") + "C6";
		СписокСоответствия.Добавить(Макет.Область(СтрокаКод).Текст + " " + Макет.Область(СтрокаДолжность).Текст);
		
	КонецЦикла;

	Возврат СписокСоответствия;

КонецФункции // СписокДолжностейКлассификатора()

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
