&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПериодОтчета = Новый СтандартныйПериод;
	ПериодОтчета.ДатаНачала    = НачалоДня(ТекущаяДата());
	ПериодОтчета.ДатаОкончания = КонецДня(ТекущаяДата());
	
	ПользовательскиеНастройки = Новый НастройкиКомпоновкиДанных;
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Период"      , ПериодОтчета);
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Номенклатура", ПараметрКоманды);

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КлючВарианта", "ПоСкладам");
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
//	ПараметрыОткрытия.Вставить("Период", ПериодОтчета);
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Номенклатура", ПараметрКоманды));
	ПараметрыОткрытия.Вставить("Настройки", ПользовательскиеНастройки);

	ОткрытьФорму("Отчет.АнализДвиженийНоменклатуры.Форма"
		, ПараметрыОткрытия
		, ПараметрКоманды
		, ПараметрКоманды
		, ПараметрыВыполненияКоманды.Окно
	);

КонецПроцедуры
