
&НаКлиенте
Процедура КомментарииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбновитьНаСервере()
	
	Отказ = Ложь;
	
	ПроверитьВозрастДетей(Отказ);
	
	//Если Отказ Тогда 
	//	Сообщить("Не удалось записать данные!");
	//	Возврат;
	//КонецЕсли;	
	
	ДанныеКонтрагента = Новый Структура;
	
	ДанныеКонтрагента.Вставить("Фамилия",	Фамилия);
	ДанныеКонтрагента.Вставить("Имя"	,	Имя);
	ДанныеКонтрагента.Вставить("Отчество",	Отчество);
	
	ДанныеКонтрагента.Вставить("Контрагент",	Контрагент);
	
	ДанныеКонтрагента.Вставить("НомерТелефона", Телефон); 
	
	ДанныеКонтрагента.Вставить("Электропочта", EMail);  
	
	ДанныеКонтрагента.Вставить("Пол", Пол);
	
	ДанныеКонтрагента.Вставить("РасширенныеДанные", Истина);
	
	ДанныеКонтрагента.Вставить("ДатаРождения", ДатаРождения); 
	
	ДанныеКонтрагента.Вставить("Электропочта", EMail);
	
	ДанныеКонтрагента.Вставить("Дети", Дети.Выгрузить());
	
	ДанныеКонтрагента.Вставить("ИнформационнаяКарта", "");  
	
	ДанныеКонтрагента.Вставить("Комментарий", Комментарий);  
	
	Если ВерификацияКлиентовСервер.ЗаписатьВерифицированныеДанныеКонтрагента(ДанныеКонтрагента).Выполнено Тогда
		
		Если СтрДлина(Телефон) = 10 Тогда 
			НомерТелефона = "38" + Телефон;         
		Иначе 
			НомерТелефона = СтрЗаменить(Телефон, "+", "");         
		КонецЕсли;	
		
		Запись = РегистрыСведений.ВходящиеЗвонкиАстерикс.СоздатьМенеджерЗаписи();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.НомерТелефона = &НомерТелефона
		|	И КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтрагентыКонтактнаяИнформация.Ссылка";
		Запрос.Параметры.Вставить("НомерТелефона", НомерТелефона);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() Тогда 
			Контрагент = Результат.Ссылка;
		Иначе 
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;	   
		
	КонецЕсли;
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбновить(Команда)
	
	Если Сотрудник Тогда 
		Возврат;
	КонецЕсли;	
	
	ЗаписатьОбновитьНаСервере(); 
	
	ПриОткрытии(Ложь);  
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьТелефонНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТелефон(Команда)
	ДобавитьТелефонНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Объект") Тогда
		Если ТипЗнч(Параметры.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда 
			Контрагент 	= Параметры.Объект;
			ЗаполнитьФормуНаСервере(Контрагент); 
		ИначеЕсли ТипЗнч(Параметры.Объект) = Тип("Строка") Тогда //Контрагент отсутствует в БД. Имеем только номер телефона
			Телефон		= Параметры.Объект;
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуНаСервере(Контрагент) Экспорт 
	
	//Заполнение карточки
	ИмяПокупателя 	= Контрагент.Наименование; 
	ДатаРождения	= Контрагент.ДатаРождения;
	Пол				= Контрагент.Пол;
	ДатаСоздания	= Контрагент.ДатаСоздания; 
	Документ		= Контрагент.ДокументУдостоверяющийЛичность; 
	Сотрудник		= Контрагент.ФизЛицо.Сотрудник;
	
	СтрокиТелефон 			= Контрагент["КонтактнаяИнформация"].НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон")));
	СтрокиЭлектроннаяПочта 	= Контрагент["КонтактнаяИнформация"].НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты")));
	СтрокиАдрес 			= Контрагент["КонтактнаяИнформация"].НайтиСтроки(Новый Структура("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес")));
	
	Если НЕ СтрокиТелефон.Количество() = 0 Тогда 
		Телефон = СтрокиТелефон[0].Представление;	
	КонецЕсли;
	
	Если НЕ СтрокиЭлектроннаяПочта.Количество() = 0 Тогда 
		EMail = СтрокиЭлектроннаяПочта[0].Представление;	
	КонецЕсли;
	
	Если НЕ СтрокиАдрес.Количество() = 0 Тогда 
		ФактическийАдрес = СтрокиАдрес[0].Представление;	
	КонецЕсли; 
	
	Дети.Загрузить(Контрагент.Дети.Выгрузить()); 
	
	ПроверитьВозрастДетей(Ложь);
	
	Комментарий = СокрЛП(Контрагент.Комментарий); 
	
	ОбновитьСостояниеБонусногоСчетаНаСервере();  
	
	СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
	//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Состояние", ПредопределенноеЗначение("Перечисление.СостоянияЗаказовПокупателей.Закрыт"));
	
	ЗвонкиКлиента.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);    
	
	НеОтвеченныеЗвонки.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
	
	Элементы.СписокЗаказов.Обновить();
	Элементы.СписокЗапросаДоступности.Обновить();
	Элементы.КомментарийКЗаказу.Обновить(); 
	
	ЗаполнитьФИО();
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьСостояниеБонусногоСчетаНаСервере()
	
	
	ПараметрыЗапроса = Новый Структура(
	"ТипыБонусов, ТолькоТекущийОстаток, Команда"
	, ОбщегоНазначенияКлиентСервер.AAD(Перечисления.ТипыБонусов.Привлечение, Перечисления.ТипыБонусов.Органический, Перечисления.ТипыБонусов.Акционный)
	, Истина
	, "ОбщееСостояниеСчёта"
	);
	
	ДанныеОтвета = БонусныеБаллыСервер.BPS_ПолучитьОстатокБонусныхБаллов(Контрагент, ПараметрыЗапроса);
	
	Если ДанныеОтвета.Ошибка = Истина ИЛИ НЕ ДанныеОтвета.Свойство("ДанныеСчёта") Тогда
		
		ББ_ПериодРасчета = '00010101';
		
		СуммаБонусныхБаллов 					= 0;
		СуммаБонусныхБалловВРезерве 			= 0;
		СуммаБонусныхБалловАкционных 			= 0;
		СуммаБонусныхБалловВРезервеАкционных 	= 0;
		
		ББ_ПоследовательностьВПорядке	= Ложь;
		ББ_СостояниеПоследовательности	= ?(ДанныеОтвета.Ошибка = Истина
		, ДанныеОтвета.ОписаниеОшибки
		, "в ответе сервера нет информации о состоянии бонусного счёта ([ДанныеСчёта])"
		);
		
	Иначе
		
		ББ_ПериодРасчета = ДанныеОтвета.ДанныеСчёта.Период;
		
		СуммаБонусныхБаллов 					= ДанныеОтвета.ДанныеСчёта.СуммаБонусныхБаллов;
		СуммаБонусныхБалловВРезерве 			= ДанныеОтвета.ДанныеСчёта.СуммаБонусныхБалловВРезерве;
		СуммаБонусныхБалловАкционных 			= ДанныеОтвета.ДанныеСчёта.СуммаБонусныхБалловАкционных;
		СуммаБонусныхБалловВРезервеАкционных 	= ДанныеОтвета.ДанныеСчёта.СуммаБонусныхБалловВРезервеАкционных;
		
		ББ_ПоследовательностьВПорядке = (ДанныеОтвета.ДанныеСчёта.Регистратор_П = ДанныеОтвета.ДанныеСчёта.Регистратор_ГП);
		
		Если ББ_ПоследовательностьВПорядке Тогда
			
			ББ_СостояниеПоследовательности = "Последовательность списания бонусных баллов восстановлена!";
			
		Иначе	ББ_СостояниеПоследовательности = "Проблема! Последовательность списания бонусных баллов нарушена и не восстановлена!";
			
		КонецЕсли;
		
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ДетиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.УникальныйИдентификатор) Тогда 
		Элемент.ТекущиеДанные.УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВедомостьБонусныхНакоплений(Команда) 
	
	ОткрытьОтчёт("ВедомостьБонусныхНакоплений", "ВедомостьБонусныхНакопленийДокументНачисления", Контрагент);
	
КонецПроцедуры     

&НаКлиенте	
Процедура ОткрытьОтчёт(ИмяОтчёта, КлючВарианта, ТекущиеДанные)

	Если НЕ ТекущиеДанные = Неопределено Тогда

		Отбор = Новый Структура("Контрагент", ТекущиеДанные);

		ПараметрыНастроек = Новый Структура(
			"Период"
			, Новый СтандартныйПериод(ВариантСтандартногоПериода.ПроизвольныйПериод)
		);
		ПараметрыНастроек.Период.ДатаОкончания = КонецДня(ТекущаяДата());

		ПараметрыФормы = Новый Структура(
			"КлючВарианта, Отбор, СформироватьПриОткрытии, ПользовательскиеНастройки"
			, КлючВарианта
			, Отбор
			, Истина
			, ВариантыОтчетовВызовСервера.ПолучитьПользовательскиеНастройки(ИмяОтчёта, ПараметрыНастроек)
		);

		ОткрытьФорму("Отчет." + ИмяОтчёта + ".Форма"
			, ПараметрыФормы
			, ЭтотОбъект
			, ЭтотОбъект
		);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДисконтныеКарты(Команда)
	
	ПараметрыФормы = Новый Структура;	
	ПараметрыФормы.Вставить("ВладелецКарты", Контрагент); 
	ПараметрыФормы.Вставить("ТолькоДисконтныеКарты", Истина);		
	ОткрытьФорму("Справочник.ИнформационныеКарты.ФормаСписка", 
		ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()


КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда 
		СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Контрагент", ""); 
		//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Состояние", "");
	Иначе
		СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
		//СписокЗаказов.Параметры.УстановитьЗначениеПараметра("Состояние", ПредопределенноеЗначение("Перечисление.СостоянияЗаказовПокупателей.Закрыт"));
	КонецЕсли; 
	
	Комментарии.Параметры.УстановитьЗначениеПараметра("Контрагент", Контрагент);
	
	УстановитьВидимость();
	
	УстановитьДоступность();
	
	ПриОткрытииНаСервере();      
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДоступность() 
	
	//Элементы.ИмяПокупателя.Видимость = Не ЗначениеЗаполнено(Контрагент);
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		
		Элементы.Контрагент.Доступность 			= Истина; 
		Элементы.Фамилия.ТолькоПросмотр				= Истина;
		Элементы.Имя.ТолькоПросмотр					= Истина;
		Элементы.Отчество.ТолькоПросмотр			= Истина;
		Элементы.ДатаРождения.ТолькоПросмотр		= Истина;
		Элементы.Пол.ТолькоПросмотр					= Истина;
		Элементы.Телефон.ТолькоПросмотр				= Истина;
		Элементы.EMail.ТолькоПросмотр				= Истина;
		Элементы.ФактическийАдрес.ТолькоПросмотр 	= Истина;
		
		Элементы.Дети.ТолькоПросмотр 				= Истина;
		
	КонецЕсли;
	
	                  
КонецПроцедуры

&НаСервере
Функция ЕстьДеньРожденияРебенка(Контрагент) 

	Возврат Справочники.Контрагенты.ЕстьДеньРожденияРебенка(Контрагент);	
	
КонецФункции	

&НаКлиенте
Процедура УстановитьВидимость() 
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		Элементы.Контрагент.Видимость 	= Истина;
		Элементы.Фамилия.Видимость		= Истина;   
		Элементы.Имя.Видимость			= Истина;
		Элементы.Отчество.Видимость		= Истина;
		
		Элементы.ГруппаЗаказы.Видимость = Истина;    
		
		Элементы.ДеньРожденияРебенка.Видимость = ЕстьДеньРожденияРебенка(Контрагент);   
		
		Элементы.ЗаписатьОбновить.Видимость = Ложь;
		
	Иначе       
		
		Элементы.Контрагент.Видимость 	= Истина;
		Элементы.Фамилия.Видимость		= Истина;   
		Элементы.Имя.Видимость			= Истина;
		Элементы.Отчество.Видимость		= Истина;
		
		Элементы.ГруппаЗаказы.Видимость = Ложь;  
		
		Элементы.ГруппаКомментарии.Видимость = Ложь;  
		
		Элементы.ЗаписатьОбновить.Видимость = Истина;
		
	КонецЕсли; 
	
	Элементы.ДекорацияСотрудник.Видимость = Сотрудник;
		
КонецПроцедуры	

&НаКлиенте
Процедура СписокЗаказовПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокЗаказов.ТекущиеДанные = Неопределено Тогда 
		СписокЗапросаДоступности.Параметры.УстановитьЗначениеПараметра("ДокументОснование", "");
		КомментарийКЗаказу.Параметры.УстановитьЗначениеПараметра("ЗаказПокупателя", "");
	Иначе
		СписокЗапросаДоступности.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Элементы.СписокЗаказов.ТекущаяСтрока);
		КомментарийКЗаказу.Параметры.УстановитьЗначениеПараметра("ЗаказПокупателя", Элементы.СписокЗаказов.ТекущаяСтрока);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ЗаполнитьФормуНаСервере(Контрагент);
		
	УстановитьВидимость();
	УстановитьДоступность();
	
КонецПроцедуры

Процедура ЗаполнитьФИО()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Фамилия КАК Фамилия,
	|	ТаблицаРегистра.Имя КАК Имя,
	|	ТаблицаРегистра.Отчество КАК Отчество
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(, ФизЛицо ССЫЛКА Справочник.Контрагенты) КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ФизЛицо = &ФизЛицо"
	);
	Запрос.УстановитьПараметр("ФизЛицо", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Фамилия  = Выборка.Фамилия;
		Имя      = Выборка.Имя;
		Отчество = Выборка.Отчество;
		
	Иначе
		
		СоставНаименования = ОбщегоНазначенияКлиентСервер.lx_FillValueList(, СокрЛП(Контрагент.Наименование),, " ", 3,, Новый ОписаниеТипов("Строка"));
		
		Фамилия  = СоставНаименования[0];
		Имя      = СоставНаименования[1];
		Отчество = СоставНаименования[2];
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЗаказовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
		Сообщить("Не выбран контрагент!");
		Возврат;
	КонецЕсли;	
	
	П = Новый Структура; 
	П.Вставить("Контрагент", Контрагент); 
	ОткрытьФорму("Документ.ЗаказПокупателя.ФормаОбъекта", П, ЭтотОбъект); 

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеКлиенту(Команда)
	
	Если Не ПустаяСтрока(Телефон) И Не Контрагент.Пустая() Тогда 

		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НомерТелефона", Телефон);
		ПараметрыФормы.Вставить("Контрагент", Контрагент);
		//ПараметрыФормы.Вставить("ЗаказКлиента", Объект.Ссылка);

		ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаОтправкиСообщения", ПараметрыФормы, ЭтаФорма); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТелефонИзменениеТекстаРедактированияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТелефонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ТелефонИзменениеТекстаРедактированияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДетиДатаРожденияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Дети.ТекущиеДанные;
	
	ТекущаяСтрока.КоличествоЛетРебёнку = РассчитатьВозраст(ТекущаяСтрока.ДатаРождения);
	
	Если ТекущаяСтрока.КоличествоЛетРебёнку >= 16 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Возраст не должен быть больше 16 лет.";
		Сообщение.КлючДанных = Контрагент;
		Сообщение.Поле   = "ЭтотОбъект.Дети["+Элементы.Дети.ТекущаяСтрока+"].ДатаРождения"; 
		Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
		
		Сообщение.УстановитьДанные(ЭтотОбъект);
		
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьВозраст(ДатаРождения)
	
	  Возврат Окр((ТекущаяДата() - ДатаРождения) / (86400 * 365),0);

КонецФункции	   

Процедура ПроверитьВозрастДетей(Отказ)
	
	Для Каждого Стр Из Дети Цикл 
		Стр.КоличествоЛетРебёнку = РассчитатьВозраст(Стр.ДатаРождения); 
		
		Если Стр.КоличествоЛетРебёнку >= 16 Тогда 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Возраст ребенка: " + Стр.Имя + " превышает 16 лет!";
			Сообщение.КлючДанных = Контрагент;
			Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
			
			Сообщение.УстановитьДанные(ЭтотОбъект);
			
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьКомментарий(Команда)
	
	П = Новый Структура; 
	П.Вставить("Контрагент", Контрагент); 
	ОткрытьФорму("РегистрСведений.КомментарииК_Контрагенту.ФормаЗаписи", П, ЭтотОбъект); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	
	
КонецПроцедуры
  
  

