&НаКлиенте	//	LNK 06.01.2022 05:59:15
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ПрограммыЛояльности") Тогда

		КлючВарианта = "ВедомостьБонусныхНакопленийПрограммыЛояльности";
		Отбор		 = Новый Структура("ПрограммаЛояльности", ПараметрКоманды);

	Иначе

		КлючВарианта = "ВедомостьБонусныхНакопленийДокументНачисления";
		Отбор		 = Новый Структура("Контрагент", ПараметрКоманды);

	КонецЕсли;

	ПараметрыНастроек = Новый Структура(
		"Период"                                                                            
		//2026-03-10 sa по умолчанию нужно брать не неделю, а сколько действует период накопления бонусной программы.
		//Сейчас это 6 месяцев.
//		, Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя)                     
		, Новый СтандартныйПериод(НачалоДня(ДобавитьМесяц(ТекущаяДата(),-6)),КонецДня(ТекущаяДата()))
	);

	ПараметрыФормы = Новый Структура(
		"КлючВарианта, Отбор, СформироватьПриОткрытии, ПользовательскиеНастройки"
		, КлючВарианта
		, Отбор
		, Истина
		, ВариантыОтчетовВызовСервера.ПолучитьПользовательскиеНастройки("ВедомостьБонусныхНакоплений", ПараметрыНастроек)
	);

	ОткрытьФорму("Отчет.ВедомостьБонусныхНакоплений.Форма"
		, ПараметрыФормы
		, ПараметрыВыполненияКоманды.Источник
		, ПараметрыВыполненияКоманды.Уникальность
		, ПараметрыВыполненияКоманды.Окно
		, ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);

КонецПроцедуры

















