&НаКлиенте	//	LNK 06.01.2022 05:59:15
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ПрограммыЛояльности") Тогда

		КлючВарианта = "ВедомостьБонусныхНакопленийПрограммыЛояльности";
		Отбор		 = Новый Структура("ПрограммаЛояльности", ПараметрКоманды);

	Иначе

		КлючВарианта = "ВедомостьБонусныхНакопленийДокументНачисления";
		Отбор		 = Новый Структура("Контрагент", ПараметрКоманды);

	КонецЕсли;

	ПараметрыНастроек = Новый Структура(
		"Период"
		, Новый СтандартныйПериод(ВариантСтандартногоПериода.ЭтаНеделя)
	);

	ПараметрыФормы = Новый Структура(
		"КлючВарианта, Отбор, СформироватьПриОткрытии, ПользовательскиеНастройки"
		, КлючВарианта
		, Отбор
		, Истина
		, ВариантыОтчетовВызовСервера.ПолучитьПользовательскиеНастройки("ВедомостьБонусныхНакоплений", ПараметрыНастроек)
	);

	ОткрытьФорму("Отчет.ВедомостьБонусныхНакоплений.Форма"
		, ПараметрыФормы
		, ПараметрыВыполненияКоманды.Источник
		, ПараметрыВыполненияКоманды.Уникальность
		, ПараметрыВыполненияКоманды.Окно
		, ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);

КонецПроцедуры

















