
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПроверитьАцкцииНаПечатьУникальныхКупонов(ПараметрКоманды);

КонецПроцедуры

&НаСервере
Функция ПроверитьЗаписи(Ссылка)
	 	МассивНепроведенныхДокументов = Новый Массив;
	

	Если МассивНепроведенныхДокументов.Количество() = 0 Тогда

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекККМСкидкиНаценки.СкидкаНаценка КАК СкидкаНаценка,
		|	СерийныеНомераДляАкций.СерийныйНомер КАК СерийныйНомер,
		|	ЧекККМСкидкиНаценки.СкидкаНаценка.ШаблонЧека КАК СкидкаНаценкаШаблонЧека
		|ИЗ
		|	Документ.ЧекККМ.СкидкиНаценки КАК ЧекККМСкидкиНаценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СерийныеНомераДляАкций КАК СерийныеНомераДляАкций
		|		ПО ЧекККМСкидкиНаценки.СкидкаНаценка = СерийныеНомераДляАкций.СкидкаНаценка
		|			И ЧекККМСкидкиНаценки.Ссылка = СерийныеНомераДляАкций.ЧекККМПродажи
		|ГДЕ
		|	ЧекККМСкидкиНаценки.СкидкаНаценка.ПечататьСерийныйНомер = ИСТИНА
		|	И ЧекККМСкидкиНаценки.СкидкаНаценка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СерийныйНомер) тогда
			
		Иначе
			
		КонецЕсли;
	КонецЦикла;
	
		
	КонецЕсли;

КонецФункции


 &НаСервере
 Функция ЭтоПРРО(ПараметрыКассыККМ) 
	 ЭтоПРРО = ПараметрыКассыККМ.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикDeviceManagerФискальныйРегистратор;
	 Возврат ЭтоПРРО;
 КонецФункции
 

&НаКлиенте 
Функция ПроверитьАцкцииНаПечатьУникальныхКупонов(ЧекККМСсылка)
	КассаККМ =  ПолучитьКассуККМ();      
	// Готовим данные
	МассивВходныеПараметры  = ПолучитьТекстУникальногоКупона(ЧекККМСсылка);
	ОписаниеОшибки = "";
	Если ЗначениеЗаполнено(КассаККМ) тогда  
		Если НЕ МассивВходныеПараметры = Неопределено тогда 
			Для каждого ВходныеПараметры из МассивВходныеПараметры	цикл
				Если НЕ ВходныеПараметры = Неопределено тогда 

					//Если НЕ ИспользоватьПодключаемоеОборудование  Тогда // если сразу печатать на принтер чеков
					//	Возврат Ложь;
					//КонецЕсли;
					Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО
					
						ПараметрыКассыККМ = ЗначениеНастроекПовтИсп.ПолучитьПараметрыКассыККМ(КассаККМ);    
						ЭтоПРРО = ЭтоПРРО(ПараметрыКассыККМ);
						Если ЭтоПРРО Тогда 
						ТабДокумент = ПолучитьТабДокКупона(ЧекККМСсылка);
							Если НЕ ТабДокумент = Неопределено Тогда
								ТабДокумент.Показать("Купон");
							КонецЕсли;
						Иначе
							ИдентификаторУстройстваФР = ПараметрыКассыККМ.ИдентификаторУстройства;
							
							Если ИдентификаторУстройстваФР <> Неопределено Тогда
								
							//	Подключаем ФР
								Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(ЭтотОбъект,
								                                                                              ИдентификаторУстройстваФР,
								                                                                              ОписаниеОшибки);
								Если Результат Тогда

									ВыходныеПараметры = Неопределено;
								//	Печатаем чек.
									Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР,"beginNonFiscal",ВходныеПараметры,ВыходныеПараметры);
									Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР,"printNonFiscalText",ВходныеПараметры,ВыходныеПараметры);

									СтрокиШаблона = РМКСервер.ПолучитьШаблонЧека(ВходныеПараметры[7]);

									Если НЕ СтрокиШаблона = Неопределено тогда
										Для каждого ДанныеСтроки из СтрокиШаблона цикл
											ВходныеПараметры[2] = СтрЗаменить(ДанныеСтроки.СтрокаТекста	, "#SUM#"		, Формат(ВходныеПараметры[9], "ЧДЦ=2; ЧН=0,00; ЧГ="));
											ВходныеПараметры[2] = СтрЗаменить(ВходныеПараметры[2]		, "#SERIALNUM#"	, СокрЛП(ВходныеПараметры[1]));
											Если ПараметрыКассыККМ.ПечатьКодQR = Истина И ДанныеСтроки.QRкод = Истина Тогда
												ДанныеДляQRКода = Новый Массив;
												ДанныеДляQRКода.Добавить(ВходныеПараметры[2]);
												Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР
													, "PrintQR"
													, ДанныеДляQRКода
													, ВыходныеПараметры
												);
											Иначе
												Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР
													, "printNonFiscalText"
													, ВходныеПараметры
													, ВыходныеПараметры
												);
											КонецЕсли;
										КонецЦикла;		
									КонецЕсли;

									Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР,"printBarCode",ВходныеПараметры,ВыходныеПараметры);
									ВходныеПараметры[2] = ВходныеПараметры[1];
									Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР,"printNonFiscalText",ВходныеПараметры,ВыходныеПараметры);
									ВходныеПараметры[2] = ПолучитьТексКонстантыНаСервере();
									Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР,"printNonFiscalText",ВходныеПараметры,ВыходныеПараметры);
									Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройстваФР,"endNonFiscal",ВходныеПараметры,ВыходныеПараметры);

									Если НЕ ВходныеПараметры[8] Тогда
										СделатьЗаписьВРССерийныеНомераДляАкций(ЧекККМСсылка,ВходныеПараметры[3],ВходныеПараметры[1],ВходныеПараметры[6]);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						

					КонецЕсли;

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;					
	Иначе //2025-07-08 sa Значит это ПРРО или центральная база. Печатаем купон на экран
		Если МассивВходныеПараметры = Неопределено тогда  //купона нет. печатать нечего. досвидос.
			Возврат Неопределено;
		КонецЕсли;
		
		ТабДокумент = ПолучитьТабДокКупона(ЧекККМСсылка);
		Если НЕ ТабДокумент = Неопределено тогда
			ТабДокумент.Показать("Купон");
		КонецЕсли;
	КонецЕсли;	

КонецФункции

&НаСервере 
Функция ПолучитьТабДокКупона(ЧекККМСсылка)
	Возврат Документы.ЧекККМ.ПолучитьТабДокКупона(ЧекККМСсылка);		
КонецФункции


&НаСервере
Функция ПолучитьКассуККМ()
КассаККМ = Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассыККМ.Ссылка КАК КассаККМ
		|ИЗ
		|	Справочник.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.ПометкаУдаления = ЛОЖЬ
		|	И КассыККМ.РабочееМесто = &РабочееМесто";
	
	Запрос.УстановитьПараметр("РабочееМесто", ПараметрыСеанса.РабочееМестоКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КассаККМ = ВыборкаДетальныеЗаписи.КассаККМ;	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	Возврат КассаККМ;
КонецФункции


&НаСервере
Функция ПолучитьТексКонстантыНаСервере()
	  Возврат Константы.ТекстПодвалаДляКупона.Получить();
КонецФункции

&НаСервере
Функция  ПолучитьТекстУникальногоКупона(ЧекККМСсылка)
    Возврат Документы.ЧекККМ.ПолучитьТекстУникальногоКупона(ЧекККМСсылка);
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	СерийныеНомераДляАкций.СкидкаНаценка КАК СкидкаНаценка,
	//	|	СерийныеНомераДляАкций.СкидкаНаценка.ТекстУсловияДляПечатиВЧекеККМ КАК ТекстУсловияДляПечатиВЧекеККМ,
	//	|	СерийныеНомераДляАкций.СкидкаНаценка.ТекстСообщения КАК ТекстСообщения,
	//	|	СерийныеНомераДляАкций.СкидкаНаценка.ВариантВыдачиКупона КАК ВариантВыдачиКупона,
	//	|	СерийныеНомераДляАкций.СкидкаНаценка.НоменклатураСкидочногоКупона КАК НоменклатураСкидочногоКупона,
	//	|	СерийныеНомераДляАкций.СкидкаНаценка.ШаблонЧека КАК ШаблонЧека,
	//	|	СерийныеНомераДляАкций.Сумма КАК СуммаКупона,
	//	|	СерийныеНомераДляАкций.ЧекККМПродажи.Номер КАК НомерЧека,
	//	|	СерийныеНомераДляАкций.СерийныйНомер КАК СкидочныйКупон,
	//	|	Штрихкоды.Штрихкод КАК КодСерийногоНомера
	//	|ИЗ
	//	|	РегистрСведений.СерийныеНомераДляАкций КАК СерийныеНомераДляАкций
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	//	|		ПО СерийныеНомераДляАкций.СерийныйНомер = Штрихкоды.Владелец
	//	|ГДЕ
	//	|	СерийныеНомераДляАкций.ЧекККМПродажи = &Ссылка";

	//
	//
	//
	//Запрос.УстановитьПараметр("Ссылка", ЧекККМСсылка);
	//РезультатЗапроса = Запрос.Выполнить();
	//Если НЕ РезультатЗапроса.Пустой() тогда 
	//	ОбщиеПараметрыМассив = Новый Массив;
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		ОбщиеПараметры = Новый Массив();
	//		ОбщиеПараметры.Добавить("CODE128");
	//		СерийныйНомер = ВыборкаДетальныеЗаписи.СкидочныйКупон;
	//		Если  ВыборкаДетальныеЗаписи.ВариантВыдачиКупона = Перечисления.ВариантыВыдачиКупона.ПечататьНаЧекеИзСписка тогда
	//			//СкидочныйКупон = Новый Структура;
	//			//СкидочныйКупон.Вставить("СкидочныйКупон",ВыборкаДетальныеЗаписи.СкидочныйКупон);
	//			//СкидочныйКупон.Вставить("КодСерийногоНомера",ВыборкаДетальныеЗаписи.КодСерийногоНомера);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.КодСерийногоНомера);				
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.ТекстУсловияДляПечатиВЧекеККМ);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.СкидкаНаценка);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.ТекстСообщения);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.ВариантВыдачиКупона);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.СкидочныйКупон);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.ШаблонЧека);
	//			ОбщиеПараметры.Добавить(Истина);
	//			ОбщиеПараметры.Добавить(0);				
	//		Иначе
	//			//Номер = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЧекККМСсылка,"Номер");
	//			//НомерСокр = Прав(Лев(Номер,4),3)+прав(Номер,6);
	//			//Сумма = ВыборкаДетальныеЗаписи.СуммаКупона;
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.КодСерийногоНомера);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.ТекстУсловияДляПечатиВЧекеККМ);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.СкидкаНаценка);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.ТекстСообщения);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.ВариантВыдачиКупона);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.СкидочныйКупон);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.ШаблонЧека);
	//			ОбщиеПараметры.Добавить(Истина);
	//			ОбщиеПараметры.Добавить(ВыборкаДетальныеЗаписи.СуммаКупона);
	//		КонецЕсли;
	//		ОбщиеПараметрыМассив.Добавить(ОбщиеПараметры);
	//	КонецЦикла;
	//	
	//Иначе
	//ОбщиеПараметрыМассив =	ЗаписатьКупон(ЧекККМСсылка); // Запись в РС не обнаружена сделаемм ее и передадим на печать 
	//КонецЕсли;	

	//
	//
	//
	//Возврат ОбщиеПараметрыМассив;
	
КонецФункции

&НаСервере
Процедура СделатьЗаписьВРССерийныеНомераДляАкций(ЧекККМСсылка,СкидкаНаценка,КодСерийногоНомера,СерийныйНомер,СуммаКупона=0,ТекстСообщенияКассиру="")
	Документы.ЧекККМ.СделатьЗаписьВРССерийныеНомераДляАкций(ЧекККМСсылка,СкидкаНаценка,КодСерийногоНомера,СерийныйНомер,СуммаКупона,ТекстСообщенияКассиру);
КонецПроцедуры 
