#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Запись комментария.
// 
// Параметры:
//  ДокументКоментария - ДокументСсылка.ЗаказПокупателя, ДокументСсылка.ВозвратИнтернетЗаказа -  Заказ покупателя или 
//  	возврат интренет заказа
//  Автор - СправочникСсылка.Пользователи - Автор
//  Комментарий - Строка - Комментарий
Процедура ЗаписьКомментария(ДокументКоментария, Автор, Комментарий) Экспорт 
	
	Если ТипЗнч(Комментарий) = Тип("Соответствие") Тогда
		
		СтрокаКомментария = "";
		
		Для Каждого СтрокаСоответствия Из Комментарий Цикл
			
			СтрокаКомментария = СтрокаКомментария + СтрокаСоответствия.Ключ + ": " + СтрокаСоответствия.Значение + Символы.ПС;
			
		КонецЦикла;
		
	Иначе
		
		СтрокаКомментария = Комментарий;

	КонецЕсли;

	ДатаКомментария = ТекущаяДатаСеанса();
	НаборЗаписей = СоздатьНаборЗаписей();
		
	НаборЗаписей.Отбор.Автор.Установить(Автор);
	НаборЗаписей.Отбор.Период.Установить(ДатаКомментария);
	НаборЗаписей.Отбор.ДокументКоментария.Установить(ДокументКоментария);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		
		ДобавляемыйКомментарий = СтрокаКомментария;  
		НоваяЗапись = НаборЗаписей.Добавить();
	
	Иначе 
		
		ДобавляемыйКомментарий = НаборЗаписей[0].Комментарий + Символы.ПС + СтрокаКомментария;
		НоваяЗапись = НаборЗаписей[0];
		
	КонецЕсли; 
	
	НоваяЗапись.Период = ДатаКомментария;
	НоваяЗапись.ДокументКоментария = ДокументКоментария;
	НоваяЗапись.Автор = Автор;
	НоваяЗапись.Комментарий = ДобавляемыйКомментарий;
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли

