
Процедура ЗаписьКомментария(ЗаказПокупателя, Автор, Комментарий) Экспорт 
	ДатаКомментария = ТекущаяДата();
	НаборЗаписей = РегистрыСведений.КомментарийИнтернетЗаказа.СоздатьНаборЗаписей();
		
	НаборЗаписей.Отбор.Автор.Установить(Автор);
	НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
	НаборЗаписей.Отбор.Период.Установить(ДатаКомментария);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		
		ДобавляемыйКомментарий = Комментарий;  
		НоваяЗапись = НаборЗаписей.Добавить();
	
	Иначе 
		
		ДобавляемыйКомментарий = НаборЗаписей[0].Комментарий + Символы.ПС + Комментарий;
		НоваяЗапись = НаборЗаписей[0];
		
	КонецЕсли; 
	
	НоваяЗапись.Период = ДатаКомментария;
	НоваяЗапись.ЗаказПокупателя = ЗаказПокупателя;
	НоваяЗапись.Автор = Автор;
	НоваяЗапись.Комментарий = ДобавляемыйКомментарий;
	
	НаборЗаписей.Записать(Истина); 
	
КонецПроцедуры
