
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УсловияПредоставления = Параметры.УсловияПредоставления.Скопировать();
	Заголовок = Заголовок + ": " + Строка(Параметры.Документ);
	
	СписокУсловий.Очистить();
	
	СписокУсловий = СкидкиНаценкиСерверПереопределяемый.ПолучитьСписокЗначенийУсловийПредоставленияСкидки();
	
	МетаданныеЗначенияПеречисления = Метаданные.Перечисления.УсловияПредоставленияСкидокНаценок.ЗначенияПеречисления;
	МенеджерПеречисления           = Перечисления.УсловияПредоставленияСкидокНаценок;
	
	Для каждого ЭлементСписка Из СписокУсловий Цикл
		
		ИмяПеречисления = МетаданныеЗначенияПеречисления[МенеджерПеречисления.Индекс(ЭлементСписка.Значение)].Имя;
		
		ЭлементУправления = Элементы.Найти("КомандаСоздать" + ИмяПеречисления);
		Если НЕ ЭлементУправления = Неопределено Тогда
		
			ЭлементУправления.Видимость = Истина;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПоиска = УсловияПредоставления.НайтиПоЗначению(Элемент.ТекущиеДанные.Ссылка);
	
	Если РезультатПоиска = Неопределено Тогда
		УсловияПредоставления.Добавить(Элемент.ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаСоздатьВДеньРождения(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаВремяПродажи(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаГрафикОплаты(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаКомплектПокупки(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаНакопленныйОбъемПродаж(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаПервуюПродажуПартнеру(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаПробнуюПродажу(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаРазовыйОбъемПродаж(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьЗаФормуОплаты(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьПорядковыйНомерПродажиКратен(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьОграничениеПоГруппеПользователей(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьПоТипуПолучателя(Команда)
	
	КомандаСоздатьУсловие(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьУсловие(Команда)

	ИмяКоманды      = Команда.Имя;
	ИмяПеречисления = СтрЗаменить(ИмяКоманды,"КомандаСоздать", "");
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура("УсловиеПредоставления", ПредопределенноеЗначение("Перечисление.УсловияПредоставленияСкидокНаценок."+ИмяПеречисления)));
	ОткрытьФорму("Справочник.УсловияПредоставленияСкидокНаценок.Форма.ФормаЭлемента", СтруктураПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Закрыть(УсловияПредоставления);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
