//	LNK 14.08.2017 11:05:45
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И НЕ ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() Тогда

		Отказ = Истина;
		Сообщить("Отказано! Отмена проведения документа запрещена.");

	КонецЕсли;

КонецПроцедуры

//	LNK 14.08.2017 11:05:51
Процедура ПриЗаписи(Отказ)


КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛистыЖеланийОстатки.Магазин,
		|	ЛистыЖеланийОстатки.ЛистЖеланий,
		|	ЛистыЖеланийОстатки.Корзина,
		|	ЛистыЖеланийОстатки.Номенклатура,
		|	ЛистыЖеланийОстатки.Характеристика,
		|	ЛистыЖеланийОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЛистыЖеланий.Остатки(, ЛистЖеланий = &ЛистЖеланий) КАК ЛистыЖеланийОстатки";
	
	Запрос.УстановитьПараметр("ЛистЖеланий", ЛистЖеланий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОписаниеОстатковНоменклатуры = "";
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		
		Движения.ЛистыЖеланий.Записывать = Истина;
		ОписаниеОстатковНоменклатуры = "По истечению срока действия листа желаний была снята с резерва следующая номенклатура;" + Символы.ПС;
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ЛистыЖеланий.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Магазин = Магазин;
			Движение.ЛистЖеланий = ЛистЖеланий;
			Движение.Корзина = Корзина;
			Движение.Операция = Перечисления.ОперацияЛистаЖеланий.ОтменаПоИстеченииСрока;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Характеристика = Выборка.Характеристика;
			Движение.Количество = Выборка.КоличествоОстаток;
			ОписаниеОстатковНоменклатуры = ОписаниеОстатковНоменклатуры + Выборка.Номенклатура +" в количестве "+ Выборка.КоличествоОстаток + Символы.ПС;
		КонецЦикла;
	КонецЕсли; 
	
	
	// регистр СостояниеЛистаЖеланий
	Движения.СостояниеЛистаЖеланий.Записывать = Истина;
	Движение = Движения.СостояниеЛистаЖеланий.Добавить();
	Движение.Период = Дата;
	Движение.Магазин = Магазин;
	Движение.ЛистЖеланий = ЛистЖеланий;
	Движение.Состояние = Перечисления.СостояниеЛистаЖеланий.Закрытие;
	
	ОписаниеОперации = "Закрытие листа желаний №"+ Номер + " от " + Дата + ", на корзину №" + Корзина + ".";
	Если  ЗначениеЗаполнено(ОписаниеОстатковНоменклатуры) Тогда
		 ОписаниеОперации = ОписаниеОперации + Символы.ПС + ОписаниеОстатковНоменклатуры
	КонецЕсли; 
	Движение.ОписаниеОперации = ОписаниеОперации ;
КонецПроцедуры
