#Область ФункционалЗапросДоступностиТоваров

// Отправка почты по запросу доступности.
// Сичкаренко Ю.П. 28.08.2023
// 
// Параметры:
//  ЗапросДоступности - ДокументОбъект.ЗапросДоступностиТоваров
// Возвращаемое значение:
// 	Структура - структура регистр для записи:
//		* ПочтаОтправлена - Булево
//		* ТекстОтвета - Строка
//  
Функция ОтправкаПочтыПоЗапросуДоступности(ЗапросДоступности) Экспорт

	//УчетныеДанныеОтправителя = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("СостояниеЗД", Истина);
	УчетныеДанныеОтправителя = РаботаСПочтовымиСообщениями.ПолучитьСистемнуюУчетнуюЗапись();
	Результат = Новый Структура("ПочтаОтправлена, ТекстОтвета", Ложь, "");;
	
	Если Не УчетныеДанныеОтправителя.Пустая() Тогда

		Если ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Новый 
				Или ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Сборка
				Или ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Изменён
				Или ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ТоварВМагазине
				Или ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПодтвердитьОтмену Тогда

			ТребуетсяОтправкаПочты = Ложь;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	ТаблицаАтрибутов.ЗапросДоступности,
				|	ТаблицаАтрибутов.ОтправкаПочты
				|ИЗ
				|	РегистрСведений.КлючевыеАтрибутыЗапросовДоступности.СрезПоследних(, ЗапросДоступности = &ЗапросДоступности) КАК
				|		ТаблицаАтрибутов
				|ГДЕ
				|	ТаблицаАтрибутов.СтатусЗапроса = &СтатусЗапроса";
			
			Запрос.УстановитьПараметр("ЗапросДоступности", ЗапросДоступности.Ссылка);
			Запрос.УстановитьПараметр("СтатусЗапроса", ЗапросДоступности.СтатусЗапроса);

			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Количество() = 0 Тогда
				
				ТребуетсяОтправкаПочты = Истина;
				
			Иначе
				
				Выборка.Следующий();
				ТребуетсяОтправкаПочты = Не Выборка.ОтправкаПочты;
				
			КонецЕсли;
			
			Если ТребуетсяОтправкаПочты Тогда

				Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
					Модуль = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеКонтактнойИнформацией");
					Если ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ТоварВМагазине Тогда
						Адрес = Модуль.ПолучитьКонтактнуюИнформацияОбъекта(
							ЗапросДоступности.МагазинПолучатель, Справочники.ВидыКонтактнойИнформации.EmailМагазина);
					Иначе
						Адрес = Модуль.ПолучитьКонтактнуюИнформацияОбъекта(
							ЗапросДоступности.МагазинОтправитель, Справочники.ВидыКонтактнойИнформации.EmailМагазина);
					КонецЕсли;
	
					Если ПустаяСтрока(Адрес) Тогда
						
						Результат.ТекстОтвета = "Не указан электронный адрес магазина";
						
					Иначе
						
						ДанныеЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗапросДоступности.ДокументОснование, "Номер, Ответственный");
						ОтветственныйПочта = Модуль.ПолучитьКонтактнуюИнформацияОбъекта(
							ДанныеЗаказа.Ответственный, Справочники.ВидыКонтактнойИнформации.EmailПользователя);
						
						ПараметрыПисьма = Новый Структура;
						ПараметрыПисьма.Вставить("Кому", Адрес);
						ПараметрыПисьма.Вставить("Тема", "ЗД #"
										 + СокрЛП(ЗапросДоступности.Номер)
										 + ", статус "
										 + СокрЛП(ЗапросДоступности.СтатусЗапроса));
						ТелоПисьма = "Требуется обработка Запроса Доступности #"
							+ СокрЛП(ЗапросДоступности.Номер)
							+ " по заказу #"
							+ СокрЛП(ДанныеЗаказа.Номер)
							+ " в статусе "
							+ СокрЛП(ЗапросДоступности.СтатусЗапроса)
							+ "."
							+ Символы.ПС 
							+ Символы.ПС
							+ "Ответственный за Заказ: "
							+ СокрЛП(ДанныеЗаказа.Ответственный)
							+ " "
							+ СокрЛП(ОтветственныйПочта);
						ПараметрыПисьма.Вставить("Тело", ТелоПисьма);
		
						Результат.ТекстОтвета = ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(УчетныеДанныеОтправителя, ПараметрыПисьма);
						Результат.ПочтаОтправлена = Истина;
	
					КонецЕсли;
	
				КонецЕсли;
			
			Иначе
				
				Результат.ТекстОтвета = "";
				Результат.ПочтаОтправлена = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

//	LNK 08.04.2019 13:35:07
Процедура УстановитьСостояниеЗапросаДоступностиТоваров(ДокументСсылка, ДанныеСостояния)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;  
	
	НачатьТранзакцию();
	
	Попытка
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.СтатусЗапроса = ДанныеСостояния;
		ДокументОбъект.Записать();
		
//		СтрокаЗаписи = РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ИнициализацияСтрокиЗаписи();
//		
//		Для Каждого СтрокаЗапросаДоступности Из ДокументСсылка.Товары Цикл
//			
//			Если СтрокаЗапросаДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Отменён
//					Или СтрокаЗапросаДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Удалён Тогда
//
//				Продолжить;
//
//			КонецЕсли;
//
//			СтрокаЗаписи.ЗаказПокупателя = ДокументСсылка.ДокументОснование;   
//			СтрокаЗаписи.ЗапросДоступностиТоваров = ДокументСсылка;   
//			СтрокаЗаписи.КлючСвязи = СтрокаЗапросаДоступности.КлючСвязи;
//			СтрокаЗаписи.Отправлен = Ложь;
//			СтрокаЗаписи.Получен = Ложь;
//			
//			РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ЗаписьВРегистрСтроки(СтрокаЗаписи);
//
//		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		 		
		
	Исключение
		
		ОтменитьТранзакцию();
	
	КонецПопытки;

КонецПроцедуры

//	LNK 05.04.2019 10:53:58
Функция ПолучитьСостояниеЗапросаДоступностиТоваров(ДокументСсылка)	Экспорт

	ДанныеСостояния = Новый Структура(
		"Существует, Отправлен, Рассмотрен"
		, Ложь, Ложь, Ложь);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИСТИНА КАК Существует,
	|	ТаблицаРегистра.Отправлен КАК Отправлен,
	|	ТаблицаРегистра.Рассмотрен КАК Рассмотрен
	|ИЗ
	|	РегистрСведений.СостояниеЗапросаДоступностиТоваров КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.ЗапросДоступностиТоваров = &ДокументСсылка"
	);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ДанныеСостояния, Выборка);

	КонецЕсли;

	Возврат ДанныеСостояния;

КонецФункции // ПолучитьСостояниеЗапросаДоступностиТоваров()
	
Функция ПолучитьСледующийСтатусЗапросаДоступностиТоваров(ДанныеСостоянияДокумента)	Экспорт
	
	ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПустаяСсылка();
	
	ДанныеДляПроверки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСостоянияДокумента, "СтатусЗапроса");

	Если ДанныеДляПроверки = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Новый Тогда 
		
		ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВРаботе;
		
	ИначеЕсли ДанныеДляПроверки = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПодтвердитьОтмену Тогда 
		
		ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отменён;
		
	ИначеЕсли ДанныеДляПроверки = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Изменён Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗапросДоступностиТоваровТовары.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТоваровТовары
			|ГДЕ
			|	НЕ(ЗапросДоступностиТоваровТовары.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Удалён)
			|				ИЛИ ЗапросДоступностиТоваровТовары.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Отменён))
			|	И ЗапросДоступностиТоваровТовары.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеСостоянияДокумента);
		
		Если Запрос.Выполнить().Пустой() Тогда 
			
			ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отменён;

		Иначе 
			
			ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВРаботе; 
			
		КонецЕсли;
		
	ИначеЕсли ДанныеДляПроверки = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВРаботе Тогда 
		
		ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Согласован;

	ИначеЕсли ДанныеДляПроверки = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Согласован Тогда 
		
		ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПустаяСсылка();
		
	ИначеЕсли ДанныеДляПроверки = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Сборка Тогда 
		
		ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.КОтправке;
		
	ИначеЕсли ДанныеДляПроверки = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПродажаБезнал Тогда 
		
		ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Выдан;
		
	ИначеЕсли ДанныеДляПроверки = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ТоварВМагазине Тогда 
		
		ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Получен;
		
	ИначеЕсли ДанныеДляПроверки = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.КОтправке Тогда 

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТоварыЗапрос.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА ТоварыПеремещение.Ссылка ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК ПеремещениеЕсть
			|ИЗ
			|	Документ.ЗапросДоступностиТоваров.Товары КАК ТоварыЗапрос
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ТоварыПеремещение
			|		ПО ТоварыЗапрос.Ссылка = ТоварыПеремещение.Ссылка.ДокументОснование
			|		И ТоварыПеремещение.Номенклатура = ТоварыЗапрос.Номенклатура
			|		И НЕ ТоварыПеремещение.Ссылка.ПометкаУдаления
			|ГДЕ
			|	ТоварыЗапрос.Ссылка = &Ссылка
			|	И НЕ (ТоварыЗапрос.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Отменён)
			|	ИЛИ ТоварыЗапрос.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Удалён))
			|	И ТоварыЗапрос.Ссылка.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипДоставкиЗаказПокупателя.Самовывоз)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДокументЗапроса.Ссылка,
			|	ВЫБОР
			|		КОГДА ЭлектроннаяНакладная.Ссылка ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ
			|ИЗ
			|	Документ.ЗапросДоступностиТоваров КАК ДокументЗапроса
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЭН.СрезПоследних КАК СтатусыЭНСрезПоследних
			|			ПО ЭлектроннаяНакладная.Ссылка = СтатусыЭНСрезПоследних.ДокументРегистратор
			|		ПО ДокументЗапроса.Ссылка = ЭлектроннаяНакладная.ДокументОснование
			|ГДЕ
			|	ДокументЗапроса.Ссылка = &Ссылка
			|	И НЕ (ДокументЗапроса.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отменён)
			|	ИЛИ ДокументЗапроса.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Удалён))
			|	И НЕ ДокументЗапроса.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипДоставкиЗаказПокупателя.Самовывоз)
			|	И НЕ (СтатусыЭНСрезПоследних.СтатусЭН.СтатусПосылки = ЗНАЧЕНИЕ(Перечисление.СтатусыПосылокСлужбыДоставки.Отменена)
			|	ИЛИ СтатусыЭНСрезПоследних.СтатусЭН.СтатусПосылки = ЗНАЧЕНИЕ(Перечисление.СтатусыПосылокСлужбыДоставки.Новая))";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеСостоянияДокумента);
		
		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();  
		
		Если Выборка.Количество() = 1 Тогда
			
			Если Выборка.Следующий() Тогда
				ПеремещениеУжеЕсть = Выборка.ПеремещениеЕсть;
			КонецЕсли;
			
		Иначе
			ПеремещениеУжеЕсть = Ложь;
		КонецЕсли;
		
		Если ПеремещениеУжеЕсть Тогда
			
			ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВыданДоставке;
			
		Иначе
			
			ДанныеСостояния = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПустаяСсылка();
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат ДанныеСостояния;
	
КонецФункции

// Доступность для редактирования.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.ЗапросДоступностиТоваров - ссылка
// 
// Возвращаемое значение:
//  Булево - Доступность для редактирования
Функция ДоступностьДляРедактирования(ДокументСсылка) Экспорт

	МожемРедактировать = Ложь;
	
	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "МагазинОтправитель,
	|																				СтатусЗапроса,
	|																				МагазинПолучатель,
	|																				Дата");
	
	УчетнаяПолитика = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику(РеквизитыОбъекта.Дата);
	
	НазначениеСклада = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыОбъекта.МагазинОтправитель, "НазначениеСклада", Перечисления.НазначенияСкладов.ПустаяСсылка(), Ложь);
	
	ПополнениеМагазина = (НазначениеСклада = Перечисления.НазначенияСкладов.УправляющаяСистема)
			И Не (УчетнаяПолитика.ИнтернетМагазин = РеквизитыОбъекта.МагазинПолучатель);
	
	Если ТипЗнч(РеквизитыОбъекта.МагазинОтправитель) = Тип("СправочникСсылка.Магазины")
				И ((РеквизитыОбъекта.МагазинОтправитель = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин
				И (РеквизитыОбъекта.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Новый
					Или РеквизитыОбъекта.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВРаботе
					Или РеквизитыОбъекта.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Изменён
					Или РеквизитыОбъекта.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Сборка
					Или РеквизитыОбъекта.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПодтвердитьОтмену
					Или РеквизитыОбъекта.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.КОтправке)) 
				Или (РеквизитыОбъекта.МагазинПолучатель = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин
				И (РеквизитыОбъекта.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ТоварВМагазине
					Или РеквизитыОбъекта.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПродажаБезнал
					Или РеквизитыОбъекта.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Выдан))) Тогда
		
		МожемРедактировать = Истина;
		
	ИначеЕсли ПополнениеМагазина Тогда 
		
		МожемРедактировать = Истина;
		
	ИначеЕсли ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда
		
		МожемРедактировать = Истина;
		
	КонецЕсли;
		
	Возврат МожемРедактировать;
	
КонецФункции

#КонецОбласти

#Область РегламентныеЗадания

//	LNK 15.12.2017 09:46:38
Процедура ПолучитьЗаказыПокупателейИзЦентральногоУзла()	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если РозничныеПродажиСлужебный.РесурсWebRetailДоступен() И НЕ ПустаяСтрока(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Код) Тогда

		Подключение  = СервисыСервер.Подключение("RetailPack");
		СтрокаДанных = Подключение.GetBuyersOrder(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Код);

		Если НЕ ПустаяСтрока(СтрокаДанных) Тогда

			ТаблицаСсылок = Новый ТаблицаЗначений;
			ТаблицаСсылок.Колонки.Добавить("Ссылка"      , Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
			ТаблицаСсылок.Колонки.Добавить("ЕстьДвижения", Новый ОписаниеТипов("Булево"));

			ЧтениеJSON = Новый ЧтениеJSON;	//	пытаемся получить таблицу обработанных ссылок.
			ЧтениеJSON.УстановитьСтроку(СтрокаДанных);

			СтруктураДанных = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();

			Для каждого СтрокаТаблицы Из СтруктураДанных.ТаблицаОбъектов Цикл

				СтрокаТаблицы.Объект.ОбменДанными.Загрузка = Истина;
				СтрокаТаблицы.Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
				СтрокаТаблицы.Объект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения"  , Истина);

				Для каждого НаборЗаписей Из СтрокаТаблицы.Объект.Движения Цикл

					НаборЗаписей.Записывать = Истина;
					ТаблицаДвижений = СтрокаТаблицы.Движения.Получить(НаборЗаписей.Метаданные().ПолноеИмя());

					Если НЕ ТаблицаДвижений = Неопределено Тогда

						НаборЗаписей.Загрузить(ТаблицаДвижений);

					КонецЕсли;

				КонецЦикла;

				Попытка

					СтрокаТаблицы.Объект.Записать();
				//	Для отправки "обратно" - удалить регистрацию объекта в этот узел.
				//	Так же будут удалена регистрация и по коллекции "Движения".
					СтрокаСсылки = ТаблицаСсылок.Добавить();
					СтрокаСсылки.Ссылка = СтрокаТаблицы.Объект.Ссылка;
					СтрокаСсылки.ЕстьДвижения = Истина;

				Исключение

						ТекстОшибки = ОписаниеОшибки();
						ЖурналСобытий.Регистрация("GetBuyersOrder.ЗаписьОбъекта", УровеньЖурналаРегистрации.Ошибка
							, Метаданные.Документы.ЗаказПокупателя
							, ?(СтрокаТаблицы.Объект.Ссылка.Пустая()
								, СтрокаТаблицы.Объект.ПолучитьСсылкуНового()
								, СтрокаТаблицы.Объект.Ссылка)
							,
							, ТекстОшибки
							, СокрЛП(СтрокаТаблицы.Объект)
						);

				КонецПопытки;

			КонецЦикла;

		//	Так же могут переданы дополнительные объекты, как-то связанные с документами... например, Контрагент или ещё чего.
		//	Эти объекты будет только создавать новые, если таковые в текущей БД отсутствуют.
			Для каждого СтрокаТаблицы Из СтруктураДанных.ТаблицаСвязей Цикл

				Если СтрокаТаблицы.Объект.Ссылка.Пустая() Тогда

					СтрокаТаблицы.Объект.ОбменДанными.Загрузка = Истина;
					СтрокаТаблицы.Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
					СтрокаТаблицы.Объект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения"  , Истина);

					Попытка

						СтрокаТаблицы.Объект.Записать();

					Исключение

						ТекстОшибки = ОписаниеОшибки();
						ЖурналСобытий.Регистрация("GetBuyersOrder.ЗаписьСвязанногоОбъекта", УровеньЖурналаРегистрации.Ошибка
							, Метаданные.Документы.ЗаказПокупателя
							, ?(СтрокаТаблицы.Объект.Ссылка.Пустая()
								, СтрокаТаблицы.Объект.ПолучитьСсылкуНового()
								, СтрокаТаблицы.Объект.Ссылка)
							,
							, ТекстОшибки
							, СокрЛП(СтрокаТаблицы.Объект)
						);

					КонецПопытки;

				КонецЕсли;

			КонецЦикла;

			Если НЕ ТаблицаСсылок.Количество() = 0 Тогда

				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
				СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ТаблицаСсылок, НазначениеТипаXML.Явное);

				ТаблицаСсылок = Неопределено;

				Подключение = СервисыСервер.Подключение("RetailPack");

				ЧтениеJSON = Новый ЧтениеJSON;	//	пытаемся получить таблицу обработанных ссылок.
				Подключение.DeleteChangeRegistrations(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Код, ЗаписьJSON.Закрыть());

			КонецЕсли;

		КонецЕсли;

	Иначе

		ЖурналСобытий.Регистрация("GetBuyersOrder.WebService", УровеньЖурналаРегистрации.Ошибка
			, Метаданные.Документы.ЗаказПокупателя
			,
			,
			, "Нет доступа к WS ЦБ для узла «" + ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Код + "»"
		);

	КонецЕсли;

КонецПроцедуры

//	LNK 17.04.2019 10:10:05
Процедура ПолучитьЗапросыДоступностиТоваровИзЦентральногоУзла()	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если НЕ ПустаяСтрока(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Код) Тогда

		Подключение  = СервисыСервер.Подключение("RetailPack");
		СтрокаДанных = Подключение.GetRequestAvailability(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Код);

		Если НЕ ПустаяСтрока(СтрокаДанных) Тогда

			ТаблицаСсылок = Новый ТаблицаЗначений;
			ТаблицаСсылок.Колонки.Добавить("Ссылка"      , Новый ОписаниеТипов("ДокументСсылка.ЗапросДоступностиТоваров"));
			ТаблицаСсылок.Колонки.Добавить("ЕстьДвижения", Новый ОписаниеТипов("Булево"));

			ЧтениеJSON = Новый ЧтениеJSON;	//	пытаемся получить таблицу обработанных ссылок.
			ЧтениеJSON.УстановитьСтроку(СтрокаДанных);

			СтруктураДанных = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();

			Для каждого СтрокаТаблицы Из СтруктураДанных.ТаблицаОбъектов Цикл

				СтрокаТаблицы.Объект.ОбменДанными.Загрузка = Истина;
				СтрокаТаблицы.Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
				СтрокаТаблицы.Объект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения"  , Истина);

				Для каждого НаборЗаписей Из СтрокаТаблицы.Объект.Движения Цикл

					НаборЗаписей.Записывать = Истина;
					ТаблицаДвижений = СтрокаТаблицы.Движения.Получить(НаборЗаписей.Метаданные().ПолноеИмя());

					Если НЕ ТаблицаДвижений = Неопределено Тогда

						НаборЗаписей.Загрузить(ТаблицаДвижений);

					КонецЕсли;

				КонецЦикла;

				Попытка

					СтрокаТаблицы.Объект.Записать();
				//	Для отправки "обратно" - удалить регистрацию объекта в этот узел.
				//	Так же будут удалена регистрация и по коллекции "Движения".
					СтрокаСсылки = ТаблицаСсылок.Добавить();
					СтрокаСсылки.Ссылка = СтрокаТаблицы.Объект.Ссылка;
					СтрокаСсылки.ЕстьДвижения = Истина;

				Исключение

						ТекстОшибки = ОписаниеОшибки();
						ЖурналСобытий.Регистрация("GetRequestAvailability.ЗаписьОбъекта", УровеньЖурналаРегистрации.Ошибка
							,
							, ?(СтрокаТаблицы.Объект.Ссылка.Пустая()
								, СтрокаТаблицы.Объект.ПолучитьСсылкуНового()
								, СтрокаТаблицы.Объект.Ссылка)
							,
							, ТекстОшибки
							, СокрЛП(СтрокаТаблицы.Объект)
						);

				КонецПопытки;

			КонецЦикла;

			Если НЕ ТаблицаСсылок.Количество() = 0 Тогда

				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
				СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ТаблицаСсылок, НазначениеТипаXML.Явное);

				ТаблицаСсылок = Неопределено;

				Подключение = СервисыСервер.Подключение("RetailPack");

				ЧтениеJSON = Новый ЧтениеJSON;	//	пытаемся получить таблицу обработанных ссылок.
				Подключение.DeleteChangeRegistrations(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Код, ЗаписьJSON.Закрыть());

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

//	LNK 24.05.2023 14:04:56
Процедура ПроверитьДвиженияДляПодчинённыхДокументов(ЗаказПокупателя)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	НаборЗаписей = РегистрыНакопления.ЗаказыПокупателей.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.ДополнительныеСвойства.Вставить("СлужебнаяЗапись", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииРозницаMagento", Истина);
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	ОбменДаннымиСервер.УстановитьВсехПолучателей(НаборЗаписей.ОбменДанными.Получатели, "ПоМагазину");

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаРегистра.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Регистратор = &ЗаказПокупателя"
	);
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
//	Проверяем - есть ли движения у нашего заказа покупателя?
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	//	заказ не сделал движений!
		
	//	.. получаем регистраторы, сделавшие движения по регистру.
		Запрос = Новый Запрос(ТекстЗапросаДвиженияПодчинённыхПоЗаказуПокупателя());
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда

			Выборка = РезультатЗапроса.Выбрать();

			Пока Выборка.Следующий() Цикл

				Если ТипЗнч(Выборка.Регистратор) = Тип("ДокументСсылка.ЗакрытиеЗаказовПокупателей") Тогда

					//	в этом документе необходимо очистить его содержимое (ну, которое отновится к заказу)
						ОчиститьЗакрытиеЗаказовПокупателей(ЗаказПокупателя, Выборка.Регистратор);

				Иначе	ОчиститьНаборЗаписей(ЗаказПокупателя, Выборка.Регистратор, НаборЗаписей);

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

//	LNK 24.05.2023 14:48:40
Процедура ОчиститьЗакрытиеЗаказовПокупателей(ЗаказПокупателя, Регистратор)

	ДокументОбъект = Регистратор.ПолучитьОбъект();

	ДокументОбъект.ДополнительныеСвойства.Вставить("СлужебнаяЗапись", Истина);
	ДокументОбъект.ДополнительныеСвойства.Вставить("РежимОчисткиЗакрытиеЗаказовПокупателей", Истина);
	ДокументОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);	//	LNK 01.12.2020 06:51:01
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииРозницаMagento", Истина);

	ДокументОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	ОбменДаннымиСервер.УстановитьПолучателейМагазина(ДокументОбъект.ОбменДанными.Получатели, ДокументОбъект.Магазин);

	СтрокиДляУдаления = Новый Массив;

	Для каждого СтрокаТабличнойЧасти Из ДокументОбъект.Реестр Цикл

		Если СтрокаТабличнойЧасти.ЗаказПокупателя = ЗаказПокупателя Тогда

			СтрокиДляУдаления.Добавить(СтрокаТабличнойЧасти);

		КонецЕсли;

	КонецЦикла;

	Для каждого СтрокаТабличнойЧасти Из СтрокиДляУдаления Цикл

		ДокументОбъект.Реестр.Удалить(СтрокаТабличнойЧасти);

	КонецЦикла;

	Если ДокументОбъект.Проведен И НЕ ДокументОбъект.Реестр.Количество() = 0 Тогда

			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);

	Иначе	ДокументОбъект.Записать();

	КонецЕсли;

	Если ДокументОбъект.Реестр.Количество() = 0 Тогда

		ДокументОбъект.УстановитьПометкуУдаления(Истина);

	КонецЕсли;

КонецПроцедуры

Процедура ОчиститьНаборЗаписей(ЗаказПокупателя, Регистратор, НаборЗаписей)

	НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
	НаборЗаписей.Прочитать();

	СтрокиДляУдаления = Новый Массив;

	Для каждого ЗаписьНабора Из НаборЗаписей Цикл

		Если ЗаписьНабора.Заказ = ЗаказПокупателя Тогда

			СтрокиДляУдаления.Добавить(ЗаписьНабора);

		КонецЕсли;

	КонецЦикла;

	Если НЕ СтрокиДляУдаления.Количество() = 0 Тогда

		Для каждого ЗаписьНабора Из СтрокиДляУдаления Цикл

			НаборЗаписей.Удалить(ЗаписьНабора);

		КонецЦикла;

		НаборЗаписей.Записать();

	КонецЕсли;

КонецПроцедуры

//	LNK 24.05.2023 14:15:35
Функция ТекстЗапросаДвиженияПодчинённыхПоЗаказуПокупателя()

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаРегистра.Период КАК Период,
	|	ТаблицаРегистра.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Заказ = &ЗаказПокупателя
	|	И НЕ ТаблицаРегистра.Регистратор = &ЗаказПокупателя"
	;
	Возврат ТекстЗапроса;

КонецФункции


#Область ДляРаботыКоллЦентра

Функция ЯвляетсяСотрудникомКоллЦентра(СотрудникКакПользователь) Экспорт   
	
	СтруктураОтвета = Новый Структура("СотрудникКоллЦентра
										|	, ВыбранТекущийПользовательОтветственным
										|	, НераспределенныеЗаказы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиКоллЦентра.Ссылка КАК Ссылка,
		|	СотрудникиКоллЦентра.Владелец КАК Владелец,
		|	СотрудникиКоллЦентра.ЗаказыПоУмолчанию КАК ЗаказыПоУмолчанию
		|ИЗ
		|	Справочник.СотрудникиКоллЦентра КАК СотрудникиКоллЦентра
		|ГДЕ
		|	СотрудникиКоллЦентра.Владелец = &Владелец
		|	И НЕ СотрудникиКоллЦентра.НеРаботает";
	
	Запрос.УстановитьПараметр("Владелец", СотрудникКакПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		
		СтруктураОтвета.СотрудникКоллЦентра = Справочники.СотрудникиКоллЦентра.ПустаяСсылка();
		СтруктураОтвета.ВыбранТекущийПользовательОтветственным = Ложь;
		
	Иначе 
		Выборка.Следующий();
		СтруктураОтвета.СотрудникКоллЦентра = Выборка.Ссылка;
		СтруктураОтвета.НераспределенныеЗаказы = Выборка.ЗаказыПоУмолчанию;
		СтруктураОтвета.ВыбранТекущийПользовательОтветственным = (Выборка.Владелец = ПараметрыСеанса.ТекущийПользователь);    
		
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции // ЯвляетсяСотрудникомКоллЦентра()

Функция ЯвляетсяСуперВайзеромКоллЦентра(СотрудникКакПользователь) Экспорт
	
	СотрудникКЦ = ЯвляетсяСотрудникомКоллЦентра(СотрудникКакПользователь).СотрудникКоллЦентра;
	
	Возврат СотрудникКЦ.РольСотрудника = Перечисления.РолиСотрудниковКоллЦентра.СуперВайзер;
	
КонецФункции 

Функция СотрудникРаботает(Сотрудник) Экспорт
	
	ДанныеОСотруднике = ДанныеОСотрудникеИзРегистра(Сотрудник, НачалоДня(ТекущаяДата()));
	
	Возврат ДанныеОСотруднике.НаРаботе;
	
КонецФункции // СотрудникРаботает()

Процедура СотрудникНаРаботе(Сотрудник, НаРаботе, ДатаЗаписи = Неопределено) Экспорт
	
	Если ДатаЗаписи = Неопределено Тогда 
		ДатаЗаписи = НачалоДня(ТекущаяДата());
	Иначе 
		ДатаЗаписи = НачалоДня(ДатаЗаписи);
	КонецЕсли;
	
	ДанныеОСотруднике = ДанныеОСотрудникеИзРегистра(Сотрудник, ДатаЗаписи);
	
	ДанныеОСотруднике.НаРаботе = НаРаботе;
	
	ЗаписьВРегистрКоллЦентра(ДанныеОСотруднике, Сотрудник, ДатаЗаписи); 

КонецПроцедуры

Процедура СотрудникНовыйЗаказ(Сотрудник, ДатаЗаписи = Неопределено) Экспорт
	
	Если ДатаЗаписи = Неопределено Тогда 
		ДатаЗаписи = НачалоДня(ТекущаяДата());
	Иначе 
		ДатаЗаписи = НачалоДня(ДатаЗаписи);
	КонецЕсли;
	
	ДанныеОСотруднике = ДанныеОСотрудникеИзРегистра(Сотрудник, ДатаЗаписи);
	
	ДанныеОСотруднике.НовыеЗаказы = ДанныеОСотруднике.НовыеЗаказы + 1;
	
	ЗаписьВРегистрКоллЦентра(ДанныеОСотруднике, Сотрудник, ДатаЗаписи);
	
КонецПроцедуры

Процедура СотрудникИзменениеОтветственного(СотрудникСтарый, СотрудникНовый, ДатаЗаписи) Экспорт 
	
	ДатаЗаписиВРегистр = НачалоДня(ДатаЗаписи);
	
	ДанныеОСотруднике = ДанныеОСотрудникеИзРегистра(СотрудникСтарый, ДатаЗаписиВРегистр);
	
	ДанныеОСотруднике.НовыеЗаказы = ДанныеОСотруднике.НовыеЗаказы - 1;
	
	ЗаписьВРегистрКоллЦентра(ДанныеОСотруднике, СотрудникСтарый, ДатаЗаписиВРегистр);
	
	ДанныеОСотруднике = ДанныеОСотрудникеИзРегистра(СотрудникНовый, ДатаЗаписиВРегистр);
	
	ДанныеОСотруднике.НовыеЗаказы = ДанныеОСотруднике.НовыеЗаказы + 1;
	
	ЗаписьВРегистрКоллЦентра(ДанныеОСотруднике, СотрудникНовый, ДатаЗаписиВРегистр);
	
КонецПроцедуры

Процедура СотрудникОбработанныйЗаказ(Сотрудник, ДатаЗаписи = Неопределено) Экспорт
	
	Если ДатаЗаписи = Неопределено Тогда 
		ДатаЗаписи = НачалоДня(ТекущаяДата());
	Иначе 
		ДатаЗаписи = НачалоДня(ДатаЗаписи);
	КонецЕсли;
	
	ДанныеОСотруднике = ДанныеОСотрудникеИзРегистра(Сотрудник, ДатаЗаписи);
	
	ДанныеОСотруднике.ОтработанныеЗаказы = ДанныеОСотруднике.ОтработанныеЗаказы + 1;
	
	ЗаписьВРегистрКоллЦентра(ДанныеОСотруднике, Сотрудник, ДатаЗаписи);
	
КонецПроцедуры

Процедура ЗаписьВРегистрКоллЦентра(СтруктураЗаписи, Сотрудник, ДатаЗаписи)
	ТекущийПривилегированныйРежим = ПривилегированныйРежим();
	
	УстановитьПривилегированныйРежим(Истина);
	Набор = РегистрыСведений.РаботаСотрудниковКоллЦентра.СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(ДатаЗаписи);
	Набор.Отбор.Сотрудник.Установить(Сотрудник);
	
	Запись = Набор.Добавить();
	Запись.Период = ДатаЗаписи;
	Запись.Сотрудник = Сотрудник;
	Запись.НовыеЗаказы = СтруктураЗаписи.НовыеЗаказы;
	Запись.ОтработанныеЗаказы = СтруктураЗаписи.ОтработанныеЗаказы;
	Запись.НаРаботе = ?(СтруктураЗаписи.Приоритет = 1, Ложь, СтруктураЗаписи.НаРаботе);
	Набор.Записать(); 
	
	УстановитьПривилегированныйРежим(ТекущийПривилегированныйРежим);
	
КонецПроцедуры

Функция ДанныеОСотрудникеИзРегистра(Сотрудник, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботаСотрудниковКоллЦентра.НовыеЗаказы КАК НовыеЗаказы,
		|	РаботаСотрудниковКоллЦентра.ОтработанныеЗаказы КАК ОтработанныеЗаказы,
		|	РаботаСотрудниковКоллЦентра.НаРаботе КАК НаРаботе,
		|	2 КАК Приоритет
		|ИЗ
		|	РегистрСведений.РаботаСотрудниковКоллЦентра КАК РаботаСотрудниковКоллЦентра
		|ГДЕ
		|	РаботаСотрудниковКоллЦентра.Период = &Период
		|	И РаботаСотрудниковКоллЦентра.Сотрудник = &Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	Истина,
		|	1
		|ИЗ
		|	Справочник.СотрудникиКоллЦентра КАК СотрудникиКоллЦентра
		|ГДЕ
		|	СотрудникиКоллЦентра.ЗаказыПоУмолчанию
		|	И СотрудникиКоллЦентра.Ссылка = &Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Период", НачалоДня(Период));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		
		Результат = Новый Структура("НовыеЗаказы, ОтработанныеЗаказы, НаРаботе, Приоритет", 0, 0, Ложь, 0);
		
	Иначе
		
		Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТЗ[0]);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Ответственный за заказ.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект.ЗаказПокупателя - объект
//  ПоУмолчанию - Булево - По умолчанию
//  ПериодДокумента - Неопределено - Период документа
//  Пользователь - Неопределено - Пользователь
// 
// Возвращаемое значение:
//  СправочникСсылка.СотрудникиКоллЦентра - Ответственный за заказ
Функция ОтветственныйЗаЗаказ(ДокументОбъект, ПоУмолчанию = Истина, ПериодДокумента = Неопределено, Пользователь = Неопределено) Экспорт
	
	Результат = Справочники.СотрудникиКоллЦентра.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ТаблицаСотрудников.ВерсияДанных,
		|	ТаблицаСотрудников.Владелец,
		|	ТаблицаСотрудников.ИмяПредопределенныхДанных,
		|	ТаблицаСотрудников.Наименование,
		|	ТаблицаСотрудников.ПометкаУдаления,
		|	ТаблицаСотрудников.Предопределенный,
		|	ТаблицаСотрудников.Ссылка,
		|	ТаблицаСотрудников.РольСотрудника,
		|	ТаблицаСотрудников.ЗаказыПоУмолчанию,
		|	ТаблицаСотрудников.НеРаботает
		|ПОМЕСТИТЬ ТаблицаСотрудников
		|ИЗ
		|	Справочник.СотрудникиКоллЦентра КАК ТаблицаСотрудников
		|ГДЕ
		|	ТаблицаСотрудников.РольСотрудника = &РольДляДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаСотрудников.ВерсияДанных,
		|	ТаблицаСотрудников.Владелец,
		|	ТаблицаСотрудников.ИмяПредопределенныхДанных,
		|	ТаблицаСотрудников.Наименование,
		|	ТаблицаСотрудников.ПометкаУдаления,
		|	ТаблицаСотрудников.Предопределенный,
		|	ТаблицаСотрудников.Ссылка,
		|	ТаблицаСотрудников.РольСотрудника,
		|	ТаблицаСотрудников.ЗаказыПоУмолчанию,
		|	ТаблицаСотрудников.НеРаботает
		|ИЗ
		|	Справочник.СотрудникиКоллЦентра КАК ТаблицаСотрудников
		|ГДЕ
		|	ТаблицаСотрудников.ЗаказыПоУмолчанию
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаботаСотрудниковКоллЦентра.Сотрудник КАК Сотрудник,
		|	РаботаСотрудниковКоллЦентра.НовыеЗаказы + РаботаСотрудниковКоллЦентра.ОтработанныеЗаказы КАК ВсеЗаказы,
		|	1 КАК ПоУмолчанию
		|ПОМЕСТИТЬ ВыбранныеСотрудники
		|ИЗ
		|	РегистрСведений.РаботаСотрудниковКоллЦентра КАК РаботаСотрудниковКоллЦентра
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСотрудников КАК ТаблицаСотрудников
		|		ПО РаботаСотрудниковКоллЦентра.Сотрудник = ТаблицаСотрудников.Ссылка
		|ГДЕ
		|	НЕ ТаблицаСотрудников.НеРаботает
		|	И РаботаСотрудниковКоллЦентра.НаРаботе
		|	И РаботаСотрудниковКоллЦентра.Период = &ПериодРаботы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаСотрудников.Ссылка,
		|	0,
		|	2
		|ИЗ
		|	ТаблицаСотрудников КАК ТаблицаСотрудников
		|ГДЕ
		|	НЕ ТаблицаСотрудников.НеРаботает
		|	И ТаблицаСотрудников.ЗаказыПоУмолчанию
		|	И &ПоУмолчанию
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаСотрудников.Ссылка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказПокупателя.Ссылка),
		|	0
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСотрудников КАК ТаблицаСотрудников
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСотрудниковКоллЦентра КАК РаботаСотрудниковКоллЦентра
		|			ПО ТаблицаСотрудников.Ссылка = РаботаСотрудниковКоллЦентра.Сотрудник
		|		ПО ЗаказПокупателя.Ответственный = ТаблицаСотрудников.Владелец
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ЗаказПокупателя.Дата, ДЕНЬ) = &ПериодДокумента
		|	И НЕ ТаблицаСотрудников.НеРаботает
		|	И НЕ ТаблицаСотрудников.ЗаказыПоУмолчанию
		|	И РаботаСотрудниковКоллЦентра.Период = &ПериодРаботы
		|	И РаботаСотрудниковКоллЦентра.НаРаботе
		|	И ЗаказПокупателя.Контрагент = &Контрагент
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаСотрудников.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыбранныеСотрудники.Сотрудник КАК Сотрудник,
		|	ВыбранныеСотрудники.ВсеЗаказы КАК ВсеЗаказы,
		|	ВыбранныеСотрудники.ПоУмолчанию КАК ПоУмолчанию
		|ИЗ
		|	ВыбранныеСотрудники КАК ВыбранныеСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВыбранныеСотрудники.Сотрудник.Владелец = Пользователи.Ссылка
		|ГДЕ
		|	НЕ Пользователи.Ссылка = &Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоУмолчанию,
		|	ВсеЗаказы";
	
	Если ПериодДокумента = Неопределено Тогда 
		Запрос.УстановитьПараметр("ПериодДокумента", НачалоДня(ТекущаяДатаСеанса())); 
	Иначе 
		Запрос.УстановитьПараметр("ПериодДокумента", НачалоДня(ПериодДокумента)); 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПериодРаботы", НачалоДня(ТекущаяДатаСеанса())); 
	Запрос.УстановитьПараметр("ПоУмолчанию", ПоУмолчанию);
	Запрос.УстановитьПараметр("Контрагент", ДокументОбъект.Контрагент);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Если (ДокументОбъект.ТипОплаты = Перечисления.ТипОплатыЗаказПокупателя.БРПостоплата
			Или ДокументОбъект.ТипОплаты = Перечисления.ТипОплатыЗаказПокупателя.БРПредоплата) Тогда
	
		Запрос.УстановитьПараметр("РольДляДокумента", Перечисления.РолиСотрудниковКоллЦентра.СотрудникЮрЛица);
		
	Иначе
		
		Запрос.УстановитьПараметр("РольДляДокумента", Перечисления.РолиСотрудниковКоллЦентра.Сотрудник);
		
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Сотрудник;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОтветственныйЗаЗаказ()

Процедура ВыборСотрудникаКЦ(ДанныеВыбора, ВсеСотрудники) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиКоллЦентра.Владелец КАК Владелец,
		|	ЕСТЬNULL(РаботаСотрудниковКоллЦентра.НаРаботе, ЛОЖЬ) КАК НаРаботе
		|ПОМЕСТИТЬ СотрудникиКЦ
		|ИЗ
		|	Справочник.СотрудникиКоллЦентра КАК СотрудникиКоллЦентра
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСотрудниковКоллЦентра КАК РаботаСотрудниковКоллЦентра
		|		ПО (РаботаСотрудниковКоллЦентра.Сотрудник = СотрудникиКоллЦентра.Ссылка)
		|			И (РаботаСотрудниковКоллЦентра.Период = &Период)
		|ГДЕ
		|	НЕ СотрудникиКоллЦентра.НеРаботает
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиКЦ.Владелец КАК Ответственный,
		|	СотрудникиКЦ.НаРаботе КАК НаРаботе,
		|	СотрудникиКЦ.Владелец.Наименование КАК ОтветственныйНаименование
		|ИЗ
		|	СотрудникиКЦ КАК СотрудникиКЦ
		|ГДЕ
		|	(СотрудникиКЦ.НаРаботе
		|			ИЛИ &ВсеСотрудники)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтветственныйНаименование";
	
	Запрос.УстановитьПараметр("ВсеСотрудники", ВсеСотрудники);
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ответственный, Выборка.ОтветственныйНаименование);
	КонецЦикла; 

КонецПроцедуры

Функция ЗаполненностьДокументаДляЗапроса(АктивныйДокумент) Экспорт
	
	ЗапросДоступностиРазрешен = Новый Структура("СтрокиЗаполнены, ВсеОтменены", Ложь, Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ЗаказПокупателяТовары.Ссылка) КАК Строки,
	|	СУММА(ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Отменено
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|			КОГДА НЕ ЗаказПокупателяТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ТОГДА ВЫБОР
	|					КОГДА ЗаказПокупателяТовары.Самовывоз
	|					И НЕ ЗаказПокупателяТовары.МагазинПолучатель = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|					ИЛИ НЕ ЗаказПокупателяТовары.Самовывоз
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ) КАК Склады,
	|	СУММА(ВЫБОР
	|		КОГДА ЗаказПокупателяТовары.Отменено
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтрокаОтмена
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", АктивныйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ЗапросДоступностиРазрешен.СтрокиЗаполнены = (Выборка.Строки = Выборка.Склады);
		ЗапросДоступностиРазрешен.ВсеОтменены = (Выборка.Строки = Выборка.СтрокаОтмена);
		
	КонецЦикла;
	
	Возврат ЗапросДоступностиРазрешен;
	
КонецФункции

Функция ПолучитьСостаяниеЗаказаПокупателя(АктивныйДокумент) Экспорт
	
	Результат = Перечисления.СостоянияЗаказовПокупателей.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.КлючевыеАтрибутыЗаказовПокупателей.СрезПоследних КАК КлючевыеАтрибутыЗаказовПокупателейСрезПоследних
		|ГДЕ
		|	КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.ЗаказПокупателя = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", АктивныйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат = Выборка.Состояние;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Процедура ЗаполнитьКлючСвязиЗапросаДоступности(ТабличнаяЧасть, Перезаполнить = Ложь) Экспорт

	Если Перезаполнить = Истина Тогда

		КлючСвязиЗапросаДоступности = 0;

		Для каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл

			КлючСвязиЗапросаДоступности = КлючСвязиЗапросаДоступности + 1;
			СтрокаТабличнойЧасти.КлючСвязиЗапросаДоступности = КлючСвязиЗапросаДоступности;

		КонецЦикла;

	Иначе

		ДанныеКлючей = ПолучитьДанныеКлючейСвязи(ТабличнаяЧасть, "КлючСвязиЗапросаДоступности");

		Если НЕ ДанныеКлючей.ВсёХорошо Тогда

		//	Первым делом уничтожим возможные повторы в исходной таблице.

			Для каждого КлючСвязи Из ДанныеКлючей.Повторы Цикл

				СтрокиТабличнойЧасти = ТабличнаяЧасть.НайтиСтроки(Новый Структура("КлючСвязиЗапросаДоступности", КлючСвязи));

				Индекс = СтрокиТабличнойЧасти.Количество() - 1;

				Пока Индекс > 0 Цикл

					СтрокиТабличнойЧасти[Индекс].КлючСвязиЗапросаДоступности = 0;
					Индекс = Индекс - 1;

				КонецЦикла;

			КонецЦикла;

		//	Теперь устанавливаем нулевые позиции ключей с учётом пропущенных.
			КлючСвязиЗапросаДоступности = ДанныеКлючей.КлючМаксимальный;	//	дальше будем идти с пре-итерацией в 1

			Для каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл

				Если СтрокаТабличнойЧасти.КлючСвязиЗапросаДоступности <= 0 Тогда

					Если НЕ ДанныеКлючей.Пропуски.Количество() = 0 Тогда

						СтрокаТабличнойЧасти.КлючСвязиЗапросаДоступности = ДанныеКлючей.Пропуски[0];
						ДанныеКлючей.Пропуски.Удалить(0);

					Иначе

						КлючСвязиЗапросаДоступности = КлючСвязиЗапросаДоступности + 1;
						СтрокаТабличнойЧасти.КлючСвязиЗапросаДоступности = КлючСвязиЗапросаДоступности;

					КонецЕсли;

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры 

Функция ПолучитьДанныеКлючейСвязи(КоллекцияКлючей, ИмяКлюча)

	ДанныеКлючей = Новый Структура(
		"КлючМаксимальный, ВсёХорошо, Повторы, Пропуски"
		, 0
		, Истина
		, Новый Массив
		, Новый Массив
	);

	ТаблицаКлючей = Новый ТаблицаЗначений;
	ТаблицаКлючей.Колонки.Добавить(ИмяКлюча , Новый ОписаниеТипов("Число"));
	ТаблицаКлючей.Колонки.Добавить("Счетчик", Новый ОписаниеТипов("Число"));

	КонтрольПропусков = Новый Соответствие;

	Для каждого СтрокаКоллекции Из КоллекцияКлючей Цикл

		Если СтрокаКоллекции[ИмяКлюча] > 0 Тогда

			СтрокаТаблицы = ТаблицаКлючей.Добавить();
			СтрокаТаблицы[ИмяКлюча] = СтрокаКоллекции[ИмяКлюча];
			СтрокаТаблицы.Счетчик	= 1;

			КонтрольПропусков.Вставить(СтрокаКоллекции[ИмяКлюча], Истина);

		Иначе

			ДанныеКлючей.ВсёХорошо = Ложь;

		КонецЕсли;

	КонецЦикла;

	Если НЕ ТаблицаКлючей.Количество() = 0 Тогда

		ТаблицаКлючей.Свернуть(ИмяКлюча, "Счетчик");
		ТаблицаКлючей.Сортировать(ИмяКлюча);

		ДанныеКлючей.КлючМаксимальный = ТаблицаКлючей[ТаблицаКлючей.Количество() - 1][ИмяКлюча];

		Для каждого СтрокаТаблицы Из ТаблицаКлючей Цикл

			Если НЕ СтрокаТаблицы.Счетчик = 1 Тогда

				ДанныеКлючей.Повторы.Добавить(СтрокаТаблицы[ИмяКлюча]);
				ДанныеКлючей.ВсёХорошо = Ложь;

			КонецЕсли;

		КонецЦикла;

		Для НомерСтроки = 1 По ДанныеКлючей.КлючМаксимальный Цикл

			Если КонтрольПропусков.Получить(НомерСтроки) = Неопределено Тогда

				ДанныеКлючей.Пропуски.Добавить(НомерСтроки);

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Возврат ДанныеКлючей;

КонецФункции

Процедура АвтоматическоеИзменениеСтатусов() Экспорт

	Запрос = Новый Запрос;
	//0
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.ЗаказПокупателя КАК ДокументЗаказа
		|ИЗ
		|	РегистрСведений.КлючевыеАтрибутыЗаказовПокупателей.СрезПоследних КАК КлючевыеАтрибутыЗаказовПокупателейСрезПоследних
		|ГДЕ
		|	КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовПокупателей.ГотовКПродаже)
		|	И КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.ЗаказПокупателя.Проведен";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//1
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.ЗаказПокупателя КАК ДокументЗаказа
		|ИЗ
		|	РегистрСведений.КлючевыеАтрибутыЗаказовПокупателей.СрезПоследних КАК КлючевыеАтрибутыЗаказовПокупателейСрезПоследних
		|ГДЕ
		|	КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовПокупателей.ГотовКПеремещению)
		|	И КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.ЗаказПокупателя.Проведен";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//2
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.ЗаказПокупателя КАК ДокументЗаказа
		|ИЗ
		|	РегистрСведений.КлючевыеАтрибутыЗаказовПокупателей.СрезПоследних КАК КлючевыеАтрибутыЗаказовПокупателейСрезПоследних
		|ГДЕ
		|	КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовПокупателей.ГотовКДоставке)
		|	И КлючевыеАтрибутыЗаказовПокупателейСрезПоследних.ЗаказПокупателя.Проведен";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//3
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваровТовары.Ссылка КАК ДокументЗаказа,
		|	СостояниеСтрокЗаказаПокупателя.Отправлен КАК Отправлен
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСтрокЗаказаПокупателя КАК СостояниеСтрокЗаказаПокупателя
		|		ПО ЗапросДоступностиТоваровТовары.Ссылка = СостояниеСтрокЗаказаПокупателя.ЗапросДоступностиТоваров
		|		И ЗапросДоступностиТоваровТовары.КлючСвязи = СостояниеСтрокЗаказаПокупателя.КлючСвязи
		|ГДЕ
		|	ЗапросДоступностиТоваровТовары.Ссылка.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ВыданДоставке)
		|	И ЗапросДоступностиТоваровТовары.Ссылка.Проведен
		|ИТОГИ
		|ПО
		|	ДокументЗаказа";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//4
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваровТовары.Ссылка КАК ДокументЗаказа,
		|	СостояниеСтрокЗаказаПокупателя.Получен КАК Получен
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСтрокЗаказаПокупателя КАК СостояниеСтрокЗаказаПокупателя
		|		ПО ЗапросДоступностиТоваровТовары.Ссылка = СостояниеСтрокЗаказаПокупателя.ЗапросДоступностиТоваров
		|		И ЗапросДоступностиТоваровТовары.КлючСвязи = СостояниеСтрокЗаказаПокупателя.КлючСвязи
		|ГДЕ
		|	ЗапросДоступностиТоваровТовары.Ссылка.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отправлен)
		|	И ЗапросДоступностиТоваровТовары.Ссылка.Проведен
		|ИТОГИ
		|ПО
		|	ДокументЗаказа";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//5
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	АртибутыЗаказа.ЗаказПокупателя КАК ДокументЗаказа,
		|	ЗапросДоступностиТоваров.Ссылка КАК ЗапросДоступности
		|ИЗ
		|	РегистрСведений.КлючевыеАтрибутыЗаказовПокупателей.СрезПоследних КАК АртибутыЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|		ПО АртибутыЗаказа.ЗаказПокупателя = ЗапросДоступностиТоваров.ДокументОснование
		|		И (НЕ
		|			(ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отменён)
		|		ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Удалён)))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ДокументЗаказа
		|		ПО АртибутыЗаказа.ЗаказПокупателя = ДокументЗаказа.Ссылка
		|ГДЕ
		|	АртибутыЗаказа.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовПокупателей.ГотовКЗакрытию)
		|	И АртибутыЗаказа.ЗаказПокупателя.Проведен
		|ИТОГИ
		|ПО
		|	ДокументЗаказа";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//6
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваров.Ссылка КАК ДокументЗапроса,
		|	ЗаказПокупателя.СтатусОплаты КАК СтатусОплаты,
		|	ЗаказПокупателя.ТипОплаты КАК ТипОплаты
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ЗапросДоступностиТоваров.ДокументОснование = ЗаказПокупателя.Ссылка
		|ГДЕ
		|	ЗапросДоступностиТоваров.Проведен
		|	И ЗапросДоступностиТоваров.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипДоставкиЗаказПокупателя.Самовывоз)
		|	И (ЗапросДоступностиТоваров.МагазинОтправитель = ЗапросДоступностиТоваров.МагазинПолучатель
		|	И ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Согласован)
		|	ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Получен))
		|	И ЗаказПокупателя.Проведен";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//7
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваров.Ссылка КАК ДокументЗапроса,
		|	ЗапросДоступностиТоваров.ДокументОснование КАК ДокументЗаказа
		|ИЗ
		|	РегистрСведений.СтатусыЭН КАК СтатусыТТН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|			ПО ЭлектроннаяНакладная.ДокументОснование = ЗапросДоступностиТоваров.Ссылка
		|			И
		|				(ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отправлен))
		|		ПО СтатусыТТН.ДокументРегистратор = ЭлектроннаяНакладная.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыСтатусовТТН КАК КодыСтатусовТТН
		|		ПО СтатусыТТН.СтатусЭН = КодыСтатусовТТН.Ссылка
		|		И (КодыСтатусовТТН.СтатусПосылки = ЗНАЧЕНИЕ(Перечисление.СтатусыПосылокСлужбыДоставки.Получена))
		|ГДЕ
		|	ЗапросДоступностиТоваров.Проведен
		|	И ЗапросДоступностиТоваров.ДокументОснование.Проведен
		|	И НЕ ЗапросДоступностиТоваров.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипДоставкиЗаказПокупателя.Самовывоз)";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//8
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваров.Ссылка КАК ДокументЗапроса
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|			ПО ЗапросДоступностиТоваров.МагазинОтправитель = Склады.Ссылка
		|		ПО ЗаказПокупателя.Ссылка = ЗапросДоступностиТоваров.ДокументОснование
		|		И
		|			(ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Согласован))
		|ГДЕ
		|	ЗаказПокупателя.Проведен
		|	И ЗапросДоступностиТоваров.Проведен
		|	И ВЫБОР
		|		КОГДА Склады.НазначениеСклада ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ
		|		НЕ Склады.НазначениеСклада = ЗНАЧЕНИЕ(Перечисление.НазначенияСкладов.УправляющаяСистема)
		|	КОНЕЦ
		|	И НЕ ЗапросДоступностиТоваров.ОператорДоставки = ЗНАЧЕНИЕ(Перечисление.ОператорыДоставки.ВнутренняяЛогистика)
		|	И выбор
		|		КОГДА ЗаказПокупателя.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипОплатыЗаказПокупателя.Наличные)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЗаказПокупателя.СтатусОплаты = ЗНАЧЕНИЕ(Перечисление.СтатусОплаты.Оплачен)
		|	КОНЕЦ";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//9
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаказПокупателя.Ссылка КАК ДокументЗаказа
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.Доставка)
		|	И ЗаказПокупателя.Проведен";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//10
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ЗапросДоступностиТоваров.ДокументОснование = ЗаказПокупателя.Ссылка
		|		И (ЗаказПокупателя.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.Закрыт))
		|		И (НЕ (ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Закрыт)
		|		ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Удалён)
		|		ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отменён)))
		|ГДЕ
		|	ЗаказПокупателя.Проведен
		|	И ЗапросДоступностиТоваров.Проведен";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//13
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокуменЗаказ.Ссылка КАК ДокументЗаказа
		|ПОМЕСТИТЬ ДокументыЗаказов
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ДокуменЗаказ
		|ГДЕ
		|	(ДокуменЗаказ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.Продажа)
		|	ИЛИ ДокуменЗаказ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.Доставка)
		|	ИЛИ ДокуменЗаказ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.Перемещение))
		|	И ДокуменЗаказ.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыТовары.КлючСвязиЗапросаДоступности КАК КлючСвязиЗапросаДоступности,
		|	ДокументыЗаказов.ДокументЗаказа КАК ДокументЗаказа,
		|	ЗапросДоступностиТовары.Ссылка КАК ЗапросДоступностиЗаказа
		|ПОМЕСТИТЬ ПроданныеСтроки
		|ИЗ
		|	ДокументыЗаказов КАК ДокументыЗаказов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказыТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекТовары
		|			ПО ЗаказыТовары.КлючСвязи = ЧекТовары.КлючСвязи
		|			И ЗаказыТовары.Ссылка = ЧекТовары.Ссылка.ЗаказПокупателя
		|			И ЧекТовары.Ссылка.Проведен
		|			И ЧекТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа)
		|			И ЧекТовары.Количество = ЗаказыТовары.Количество
		|			И ЧекТовары.Номенклатура = ЗаказыТовары.Номенклатура
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТовары
		|			ПО ЗаказыТовары.Ссылка = ЗапросДоступностиТовары.Ссылка.ДокументОснование
		|			И ЗаказыТовары.КлючСвязиЗапросаДоступности = ЗапросДоступностиТовары.КлючСвязи
		|		ПО ДокументыЗаказов.ДокументЗаказа = ЗаказыТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПроданныеСтроки.КлючСвязиЗапросаДоступности КАК КлючСвязиЗапросаДоступности,
		|	ПроданныеСтроки.ДокументЗаказа КАК ДокументЗаказа,
		|	ПроданныеСтроки.ЗапросДоступностиЗаказа КАК ЗапросДоступностиЗаказа,
		|	СостояниеСтрок.Продано КАК Продано
		|ИЗ
		|	ПроданныеСтроки КАК ПроданныеСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСтрокЗаказаПокупателя КАК СостояниеСтрок
		|		ПО ПроданныеСтроки.КлючСвязиЗапросаДоступности = СостояниеСтрок.КлючСвязи
		|		И ПроданныеСтроки.ДокументЗаказа = СостояниеСтрок.ЗаказПокупателя
		|		И ПроданныеСтроки.ЗапросДоступностиЗаказа = СостояниеСтрок.ЗапросДоступностиТоваров
		|ГДЕ
		|	НЕ СостояниеСтрок.Продано";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//14
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваровТовары.Ссылка КАК ДокументЗапроса,
		|	СостояниеСтрокЗаказаПокупателя.ЗаказПокупателя КАК ДокументЗаказа,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваровТовары.Ссылка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПеремещениеЕсть,
		|	ВЫБОР
		|		КОГДА ЗапросДоступностиТоваровТовары.Ссылка.МагазинОтправитель.Магазин.СкладУправляющейСистемы ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЦентральныйСклад
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСтрокЗаказаПокупателя КАК СостояниеСтрокЗаказаПокупателя
		|		ПО ЗапросДоступностиТоваровТовары.Ссылка = СостояниеСтрокЗаказаПокупателя.ЗапросДоступностиТоваров
		|		И ЗапросДоступностиТоваровТовары.КлючСвязи = СостояниеСтрокЗаказаПокупателя.КлючСвязи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ПО ЗапросДоступностиТоваровТовары.Ссылка = ПеремещениеТоваровТовары.Ссылка.ДокументОснование
		|		И (ПеремещениеТоваровТовары.Номенклатура = ЗапросДоступностиТоваровТовары.Номенклатура)
		|		И (НЕ ПеремещениеТоваровТовары.Ссылка.ПометкаУдаления)
		|ГДЕ
		|	(ЗапросДоступностиТоваровТовары.Ссылка.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Выдан)
		|	ИЛИ НЕ
		|		ЗапросДоступностиТоваровТовары.Ссылка.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипДоставкиЗаказПокупателя.Самовывоз)
		|	И
		|		ЗапросДоступностиТоваровТовары.Ссылка.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Получен))
		|	И ЗапросДоступностиТоваровТовары.Ссылка.Проведен
		|ИТОГИ
		|ПО
		|	ДокументЗапроса,
		|	ДокументЗаказа";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//15
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваров.Ссылка КАК ДокументЗапроса,
		|	ЗапросДоступностиТоваров.ДокументОснование КАК ДокументЗаказа
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЭН.СрезПоследних КАК СтатусыЭНСрезПоследних
		|			ПО ЭлектроннаяНакладная.Ссылка = СтатусыЭНСрезПоследних.ДокументРегистратор
		|		ПО ЗапросДоступностиТоваров.Ссылка = ЭлектроннаяНакладная.ДокументОснование
		|ГДЕ
		|	ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ВыданДоставке)
		|	И СтатусыЭНСрезПоследних.СтатусЭН.СтатусПосылки = ЗНАЧЕНИЕ(Перечисление.СтатусыПосылокСлужбыДоставки.ВДороге)
		|	И ЗапросДоступностиТоваров.Проведен
		|	И ЗапросДоступностиТоваров.ДокументОснование.Проведен";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//16
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваров.Ссылка КАК ДокументЗапроса
		|ИЗ
		|	РегистрСведений.СтатусыЭН.СрезПоследних КАК СтатусыЭНСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|			ПО ЭлектроннаяНакладная.ДокументОснование = ЗапросДоступностиТоваров.Ссылка
		|		ПО СтатусыЭНСрезПоследних.ДокументРегистратор = ЭлектроннаяНакладная.Ссылка
		|ГДЕ
		|	(СтатусыЭНСрезПоследних.СтатусЭН.СтатусПосылки = ЗНАЧЕНИЕ(Перечисление.СтатусыПосылокСлужбыДоставки.ВДороге)
		|	ИЛИ СтатусыЭНСрезПоследних.СтатусЭН.СтатусПосылки = ЗНАЧЕНИЕ(Перечисление.СтатусыПосылокСлужбыДоставки.Доставлена)
		|	ИЛИ СтатусыЭНСрезПоследних.СтатусЭН.СтатусПосылки = ЗНАЧЕНИЕ(Перечисление.СтатусыПосылокСлужбыДоставки.Получена))
		|	И ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.КОтправке)
		|	И НЕ ЗапросДоступностиТоваров.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипДоставкиЗаказПокупателя.Самовывоз)
		|	И ЗапросДоступностиТоваров.Проведен";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//17
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваровТовары.Ссылка КАК ДокументЗапроса,
		|	ЕСТЬNULL(СостояниеСтрокЗаказаПокупателя.Продано, ЛОЖЬ) КАК Продано,
		|	ЕСТЬNULL(СостояниеСтрокЗаказаПокупателя.СогласованоВNavision, ЛОЖЬ) КАК СогласованоВNavision
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСтрокЗаказаПокупателя КАК СостояниеСтрокЗаказаПокупателя
		|		ПО ЗапросДоступностиТоваровТовары.Ссылка = СостояниеСтрокЗаказаПокупателя.ЗапросДоступностиТоваров
		|		И ЗапросДоступностиТоваровТовары.КлючСвязи = СостояниеСтрокЗаказаПокупателя.КлючСвязи
		|ГДЕ
		|	(ЗапросДоступностиТоваровТовары.Ссылка.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ЧекВКЦ)
		|	ИЛИ
		|		ЗапросДоступностиТоваровТовары.Ссылка.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ПродажаНаКассе))
		|	И ЗапросДоступностиТоваровТовары.Ссылка.Проведен
		|	И НЕ (ЗапросДоступностиТоваровТовары.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Отменён)
		|	ИЛИ ЗапросДоступностиТоваровТовары.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваров.Удалён))
		|ИТОГИ
		|ПО
		|	ДокументЗапроса";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//19
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка,
		|	СУММА(ВЫБОР
		|		КОГДА ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Удалён)
		|		ИЛИ ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отменён)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Удаленные,
		|	КОЛИЧЕСТВО(ЗапросДоступностиТоваров.Ссылка) КАК ВсегоЗапросов,
		|	СУММА(ВЫБОР
		|		КОГДА ЗапросДоступностиТоваров.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Закрыт)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Закрытые
		|ПОМЕСТИТЬ ЗакрытыеЗапросы
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ЗапросДоступностиТоваров.ДокументОснование = ЗаказПокупателя.Ссылка
		|ГДЕ
		|	НЕ (ЗаказПокупателя.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.Закрыт)
		|	ИЛИ ЗаказПокупателя.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.Отменён))
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателя.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакрытыеЗапросы.Ссылка КАК ДокументЗаказа,
		|	ВЫБОР
		|		КОГДА ЗакрытыеЗапросы.ВсегоЗапросов - (ЗакрытыеЗапросы.Удаленные + ЗакрытыеЗапросы.Закрытые) = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗакрытьЗаказ
		|ИЗ
		|	ЗакрытыеЗапросы КАК ЗакрытыеЗапросы
		|ГДЕ
		|	ЗакрытыеЗапросы.Закрытые > 0";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//20
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ
		|	ТаблицаОрдеры.ДокументОснование КАК ДокументОснование,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА ТаблицаОрдеры.Проведен
		|		И ТаблицаУчтено.Объект ЕСТЬ NULL
		|			ТОГДА 2
		|		КОГДА ТаблицаУчтено.Объект ЕСТЬ НЕ NULL
		|		И НЕ ТаблицаУчтено.УчтеноNavision
		|			ТОГДА 3
		|		КОГДА ТаблицаУчтено.УчтеноNavision
		|			ТОГДА 4
		|		ИНАЧЕ 1
		|	КОНЕЦ) КАК НомерСтатуса,
		|	ТаблицаОрдеры.ДокументЗапроса КАК ДокументЗапроса
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТаблицаОрдеры.ДокументОснование КАК ДокументОснование,
		|		ТаблицаОрдеры.Ссылка КАК Ордер,
		|		ТаблицаОрдеры.Проведен КАК Проведен,
		|		ТаблицаОрдеры.Магазин КАК Магазин,
		|		ТаблицаДоступности.Ссылка КАК ДокументЗапроса
		|	ИЗ
		|		Документ.ПриходныйОрдерНаТовары КАК ТаблицаОрдеры
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ТаблицаПеремещения
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ТаблицаДоступности
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлючевыеАтрибутыЗапросовДоступности.СрезПоследних КАК ТаблицаАтрибутов
		|					ПО ТаблицаДоступности.Ссылка = ТаблицаАтрибутов.ЗапросДоступности
		|				ПО ТаблицаПеремещения.ДокументОснование = ТаблицаДоступности.Ссылка
		|			ПО ТаблицаОрдеры.ДокументОснование = ТаблицаПеремещения.Ссылка
		|	ГДЕ
		|		НЕ ТаблицаОрдеры.ПометкаУдаления
		|		И
		|			ТаблицаАтрибутов.ОправленоВNavision = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросаДоступностиВNavision.ПроверкаВозможностиЗакрытияВNavision)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ТаблицаОрдеры.ДокументОснование,
		|		ТаблицаОрдеры.Ссылка,
		|		ТаблицаОрдеры.Проведен,
		|		ТаблицаОрдеры.Магазин,
		|		ТаблицаДоступности.Ссылка
		|	ИЗ
		|		Документ.РасходныйОрдерНаТовары КАК ТаблицаОрдеры
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ТаблицаПеремещения
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров КАК ТаблицаДоступности
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлючевыеАтрибутыЗапросовДоступности.СрезПоследних КАК ТаблицаАтрибутов
		|					ПО ТаблицаДоступности.Ссылка = ТаблицаАтрибутов.ЗапросДоступности
		|				ПО ТаблицаПеремещения.ДокументОснование = ТаблицаДоступности.Ссылка
		|			ПО ТаблицаОрдеры.ДокументОснование = ТаблицаПеремещения.Ссылка
		|	ГДЕ
		|		НЕ ТаблицаОрдеры.ПометкаУдаления
		|		И
		|			ТаблицаАтрибутов.ОправленоВNavision = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросаДоступностиВNavision.ПроверкаВозможностиЗакрытияВNavision)) КАК
		|		ТаблицаОрдеры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектУчтенВNavision КАК ТаблицаУчтено
		|		ПО (ТаблицаУчтено.Объект ССЫЛКА Документ.ПриходныйОрдерНаТовары
		|		ИЛИ ТаблицаУчтено.Объект ССЫЛКА Документ.РасходныйОрдерНаТовары)
		|		И ТаблицаОрдеры.Ордер = ТаблицаУчтено.Объект
		|		И ТаблицаОрдеры.Магазин = ТаблицаУчтено.Магазин
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОрдеры.ДокументОснование,
		|	ТаблицаОрдеры.ДокументЗапроса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	4,
		|	ТаблицаДоступности.Ссылка
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров КАК ТаблицаДоступности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлючевыеАтрибутыЗапросовДоступности.СрезПоследних КАК ТаблицаАтрибутов
		|		ПО (ТаблицаДоступности.Ссылка = ТаблицаАтрибутов.ЗапросДоступности)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|		ПО (ТаблицаДоступности.МагазинОтправитель = Склады.Ссылка)
		|ГДЕ
		|	ТаблицаАтрибутов.ОправленоВNavision = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросаДоступностиВNavision.ПроверкаВозможностиЗакрытияВNavision)
		|	И Склады.НазначениеСклада = ЗНАЧЕНИЕ(Перечисление.НазначенияСкладов.УправляющаяСистема)
		|ИТОГИ
		|ПО
		|	ДокументЗапроса";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//22
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ
		|	ОплатаЗаказаКлиента.ЗаказКлиента КАК ЗаказКлиента,
		|	СУММА(ВЫБОР
		|		КОГДА ОплатаЗаказаКлиента.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыОплатыЗаказаПокупателя.Оплата)
		|			ТОГДА ОплатаЗаказаКлиента.Сумма
		|		ИНАЧЕ -ОплатаЗаказаКлиента.Сумма
		|	КОНЕЦ) КАК Сумма,
		|	ЗаказПокупателя.СуммаДокумента + ЗаказПокупателя.СуммаДоставки КАК СуммаДокумента
		|ПОМЕСТИТЬ ТаблицаОплат
		|ИЗ
		|	РегистрСведений.ОплатаЗаказаКлиента КАК ОплатаЗаказаКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО (ОплатаЗаказаКлиента.ЗаказКлиента = ЗаказПокупателя.Ссылка)
		|ГДЕ
		|	НЕ ОплатаЗаказаКлиента.Отменён
		|	И ОплатаЗаказаКлиента.СтатусОплаты = ЗНАЧЕНИЕ(Перечисление.СтатусОплаты.Оплачен)
		|	И ЗаказПокупателя.СтатусОплаты = ЗНАЧЕНИЕ(Перечисление.СтатусОплаты.НеОплачен)
		|	И ЗаказПокупателя.УчетнаяСистема = ЗНАЧЕНИЕ(Перечисление.УчетныеСистемыКомпании.Розница)
		|СГРУППИРОВАТЬ ПО
		|	ОплатаЗаказаКлиента.ЗаказКлиента,
		|	ЗаказПокупателя.СуммаДокумента + ЗаказПокупателя.СуммаДоставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатаЗаказаКлиента.НомерОплаты КАК НомерОплаты,
		|	ОплатаЗаказаКлиента.ТипОплаты КАК ТипОплаты,
		|	ОплатаЗаказаКлиента.Сумма КАК Сумма,
		|	ОплатаЗаказаКлиента.СтатусОплаты КАК СтатусОплаты,
		|	ОплатаЗаказаКлиента.Отменён КАК Отменён,
		|	ОплатаЗаказаКлиента.ВидОплаты КАК ВидОплаты,
		|	ОплатаЗаказаКлиента.ДатаОплаты КАК ДатаОплаты,
		|	ОплатаЗаказаКлиента.ДатаСоздания КАК ДатаСоздания,
		|	ОплатаЗаказаКлиента.ИДОплаты КАК ИДОплаты,
		|	ТаблицаОплат.ЗаказКлиента КАК ДокументЗаказа
		|ИЗ
		|	ТаблицаОплат КАК ТаблицаОплат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОплатаЗаказаКлиента КАК ОплатаЗаказаКлиента
		|		ПО ТаблицаОплат.ЗаказКлиента = ОплатаЗаказаКлиента.ЗаказКлиента
		|ГДЕ
		|	ТаблицаОплат.Сумма = ТаблицаОплат.СуммаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОплатаЗаказаКлиента.НомерОплаты
		|ИТОГИ
		|ПО
		|	ДокументЗаказа";
	
	Запрос.Текст = Запрос.Текст + 
		";
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";

	//23
	Запрос.Текст = Запрос.Текст + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗапросДоступностиТоваровТовары.Ссылка КАК ДокументЗаказа,
		|	СостояниеСтрокЗаказаПокупателя.Отправлен КАК Отправлен
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСтрокЗаказаПокупателя КАК СостояниеСтрокЗаказаПокупателя
		|		ПО ЗапросДоступностиТоваровТовары.Ссылка = СостояниеСтрокЗаказаПокупателя.ЗапросДоступностиТоваров
		|		И ЗапросДоступностиТоваровТовары.КлючСвязи = СостояниеСтрокЗаказаПокупателя.КлючСвязи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|		ПО ЗапросДоступностиТоваровТовары.Ссылка.МагазинОтправитель = Склады.Ссылка,
		|	РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитикаСрезПоследних
		|ГДЕ
		|	Склады.НазначениеСклада = ЗНАЧЕНИЕ(Перечисление.НазначенияСкладов.УправляющаяСистема)
		|	И НЕ ЗапросДоступностиТоваровТовары.Ссылка.МагазинПолучатель = УчетнаяПолитикаСрезПоследних.ИнтернетМагазин
		|	И ЗапросДоступностиТоваровТовары.Ссылка.Проведен
		|	И
		|		ЗапросДоступностиТоваровТовары.Ссылка.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Сборка)
		|ИТОГИ
		|ПО
		|	ДокументЗаказа";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();

#Область ПереводЗаказаВПродажу

	Выборка = РезультатыЗапроса[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
		
			ДокументЗаказа = Выборка.ДокументЗаказа.ПолучитьОбъект();
			ДокументЗаказа.Статус = Перечисления.СтатусыЗаказовПокупателей.Продажа;
			ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказаВПродажу", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗаказПокупателя
				, Выборка.ДокументЗаказа
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗаказаВПеремещение

	Выборка = РезультатыЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
		
			ДокументЗаказа = Выборка.ДокументЗаказа.ПолучитьОбъект();
			ДокументЗаказа.Статус = Перечисления.СтатусыЗаказовПокупателей.Перемещение;
			ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение);

		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказаВПеремещение", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗаказПокупателя
				, Выборка.ДокументЗаказа
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗаказаВДоставку

	Выборка = РезультатыЗапроса[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
		
			ДокументЗаказа = Выборка.ДокументЗаказа.ПолучитьОбъект();
			ДокументЗаказа.Статус = Перечисления.СтатусыЗаказовПокупателей.Доставка;
			ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение);

		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказаВДоставку", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗаказПокупателя
				, Выборка.ДокументЗаказа
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗаказаОтправлен
	// Изменение статуса запроса доступности при отправке на магазин 

	ВыборкаДокументЗаказа = РезультатыЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументЗаказа.Следующий() Цикл

		Выборка = ВыборкаДокументЗаказа.Выбрать();
		
		Если Выборка.Количество() = 1 Тогда
			
			Выборка.Следующий();
			
			Если Выборка.Отправлен Тогда
		
				Попытка
		
					ДокументОбъект = Выборка.ДокументЗаказа.ПолучитьОбъект();
					ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отправлен;
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
				Исключение
		
					ТекстОшибки = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказаОтправлен", УровеньЖурналаРегистрации.Ошибка
						, Метаданные.Документы.ЗапросДоступностиТоваров
						, Выборка.ДокументЗаказа
						, ТекстОшибки
					);
					
				КонецПопытки;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;  

#КонецОбласти	

#Область ПереводЗаказаПолучен

	// Изменение статуса запроса доступности при получении магазином

	ВыборкаДокументЗаказа = РезультатыЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументЗаказа.Следующий() Цикл

		Выборка = ВыборкаДокументЗаказа.Выбрать();
		
		Если Выборка.Количество() = 1 Тогда
			
			Выборка.Следующий();
			
			Если Выборка.Получен Тогда
		
				Попытка
		
					ДокументОбъект = Выборка.ДокументЗаказа.ПолучитьОбъект();
					ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ТоварВМагазине;
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
				Исключение
		
					ТекстОшибки = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказаПолучен", УровеньЖурналаРегистрации.Ошибка
						, Метаданные.Документы.ЗапросДоступностиТоваров
						, Выборка.ДокументЗаказа
						, ТекстОшибки
					);
					
				КонецПопытки;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;  

#КонецОбласти

#Область ПереводЗаказаЗакрыт

	ВыборкаДокументЗаказа = РезультатыЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументЗаказа.Следующий() Цикл
		
		Попытка
		
			ДокументЗаказа = ВыборкаДокументЗаказа.ДокументЗаказа.ПолучитьОбъект();
			ДокументЗаказа.Статус = Перечисления.СтатусыЗаказовПокупателей.Закрыт;
			ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение);
	
			Выборка = ВыборкаДокументЗаказа.Выбрать();
		
			Пока Выборка.Следующий() Цикл
			
				Попытка
			
					ДокументЗапросДоступности = Выборка.ЗапросДоступности.ПолучитьОбъект();
					ДокументЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Закрыт;
					ДокументЗапросДоступности.Записать(РежимЗаписиДокумента.Проведение);
		
				Исключение
		
					ТекстОшибки = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказаЗакрыт", УровеньЖурналаРегистрации.Ошибка
						, Метаданные.Документы.ЗапросДоступностиТоваров
						, Выборка.ЗапросДоступности
						, ТекстОшибки
					);
					
				КонецПопытки;

			КонецЦикла;
		
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказаЗакрыт", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗаказПокупателя
				, ВыборкаДокументЗаказа.ДокументЗаказа
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗапросаДоступностиДляЧастичнойПродажи

	СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПустаяСсылка();

	Выборка = РезультатыЗапроса[6].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ТипОплаты = Перечисления.ТипОплатыЗаказПокупателя.Наличные Тогда
			СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПродажаНаКассе;
		ИначеЕсли Выборка.СтатусОплаты = Перечисления.СтатусОплаты.Оплачен Тогда 
			СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПродажаБезнал;
		КонецЕсли;
		
		Если Не СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПустаяСсылка() Тогда
		
			Попытка
			
				ДокументЗапроса = Выборка.ДокументЗапроса.ПолучитьОбъект();
				ДокументЗапроса.СтатусЗапроса = СтатусЗапроса;
				ДокументЗапроса.Записать(РежимЗаписиДокумента.Проведение);
			
			Исключение
	
				ТекстОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗапросаДоступностиДляЧастичнойПродажи", УровеньЖурналаРегистрации.Ошибка
					, Метаданные.Документы.ЗапросДоступностиТоваров
					, Выборка.ДокументЗапроса
					, ТекстОшибки
				);
				
			КонецПопытки;

		КонецЕсли;
		
	КонецЦикла;

#КонецОбласти

#Область ПереводЗапросаДоступностиДоставлено

	Выборка = РезультатыЗапроса[7].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
				
			Для Каждого СтрокаТЧ Из Выборка.ДокументЗапроса.Товары Цикл

				Если Не СтрокаТЧ.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Согласован Тогда
					Продолжить;	
				КонецЕсли;
				
				СтрокаЗаписиВРегистр = РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ИнициализацияСтрокиЗаписи();
				СтрокаЗаписиВРегистр.ЗаказПокупателя = Выборка.ДокументЗаказа;
				СтрокаЗаписиВРегистр.ЗапросДоступностиТоваров = Выборка.ДокументЗапроса;
				СтрокаЗаписиВРегистр.КлючСвязи = СтрокаТЧ.КлючСвязи;
				СтрокаЗаписиВРегистр.Доставлено = Истина;
				
				РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ЗаписьВРегистрСтроки(СтрокаЗаписиВРегистр);

			КонецЦикла;
	
			ДокументЗапроса = Выборка.ДокументЗапроса.ПолучитьОбъект();
			ДокументЗапроса.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Получен;
			ДокументЗапроса.Записать(РежимЗаписиДокумента.Проведение);
				
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗапросаДоступностиДоставлено", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗапросДоступностиТоваров
				, Выборка.ДокументЗапроса
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗапросаДоступностиСборка

	Выборка = РезультатыЗапроса[8].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
				
			ДокументЗапроса = Выборка.ДокументЗапроса.ПолучитьОбъект();
			ДокументЗапроса.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Сборка;
			ДокументЗапроса.Записать(РежимЗаписиДокумента.Проведение);
				
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗапросаДоступностиСборка", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗапросДоступностиТоваров
				, Выборка.ДокументЗапроса
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗаказКЗакрытиюПриДоставке

	Выборка = РезультатыЗапроса[9].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
				
			НовоеСостояние = Документы.ЗаказПокупателя.ПолучитьСостояниеЗаказаПокупателя(Выборка.ДокументЗаказа);
			
			Если НовоеСостояние.Состояние = Перечисления.СостоянияЗаказовПокупателей.ГотовКЗакрытию Тогда
				
				ДокументЗаказа = Выборка.ДокументЗаказа.ПолучитьОбъект();
	
				Для Каждого СтрокаОплаты Из ДокументЗаказа.ОплатаЗаказа Цикл
					
					Если СтрокаОплаты.ТипОплаты = Перечисления.ТипОплатыЗаказПокупателя.Наличные
							И СтрокаОплаты.ВидОплаты = Перечисления.ВидыОплатыЗаказаПокупателя.Оплата
							И Не СтрокаОплаты.Отменён Тогда
						СтрокаОплаты.СтатусОплаты = Перечисления.СтатусОплаты.Оплачен;
					КонецЕсли;
					
				КонецЦикла;
				
				ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
				
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказКЗакрытиюПриДоставке", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗаказПокупателя
				, Выборка.ДокументЗаказа
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

#КонецОбласти

#Область ПереводВсехЗапросовВЗакрыт

	Выборка = РезультатыЗапроса[10].Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Попытка
					
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Закрыт;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводВсехЗапросовВЗакрыт", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗапросДоступностиТоваров
				, Выборка.Ссылка
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;  

#КонецОбласти	

#Область ПроверкаПродажиПоЧеку
	
	ТаблицаЗаказов = Новый ТаблицаЗначений();
	ТаблицаЗаказов.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));

	Выборка = РезультатыЗапроса[13].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
						
			СтрокаЗаписиВРегистр = РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ИнициализацияСтрокиЗаписи();
			СтрокаЗаписиВРегистр.ЗаказПокупателя = Выборка.ДокументЗаказа;
			СтрокаЗаписиВРегистр.ЗапросДоступностиТоваров = Выборка.ЗапросДоступностиЗаказа;
			СтрокаЗаписиВРегистр.КлючСвязи = Выборка.КлючСвязиЗапросаДоступности;
			СтрокаЗаписиВРегистр.Продано = Истина;
			Если Выборка.ЗапросДоступностиЗаказа.ТипДоставки = Перечисления.ТипДоставкиЗаказПокупателя.Самовывоз Тогда
				СтрокаЗаписиВРегистр.Доставлено = Истина;
			КонецЕсли;
	
			РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ЗаписьВРегистрСтроки(СтрокаЗаписиВРегистр);
			
			СтрокаЗаказов = ТаблицаЗаказов.Добавить();
			СтрокаЗаказов.Заказ = Выборка.ДокументЗаказа;
					
		Исключение

			ТекстОшибки = Выборка.ДокументЗаказа + " " + Выборка.ЗапросДоступностиЗаказа + " " + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПроверкаПродажиПоЧеку", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.РегистрыСведений.СостояниеСтрокЗаказаПокупателя
				, 
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

	ТаблицаЗаказов.Свернуть("Заказ");
	
	Для Каждого СтрокаЗаказов Из ТаблицаЗаказов Цикл
		
		Попытка
						
			ДокументЗаказа = СтрокаЗаказов.Заказ.ПолучитьОбъект();
			ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение);
					
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПроверкаПродажиПоЧеку", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗаказПокупателя
				, СтрокаЗаказов.Заказ
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

#КонецОбласти	

#Область ПереводЗапросаДоступностиПолученоПриБезнальнойВыдаче

	ВыборкаДокументЗапроса = РезультатыЗапроса[14].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументЗапроса.Следующий() Цикл
	
		ВыборкаДокументЗаказа = ВыборкаДокументЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаДокументЗаказа.Следующий() Цикл	
			
			Выборка = ВыборкаДокументЗаказа.Выбрать();
	
			Если Выборка.Количество() = 1 Тогда
			
				Пока Выборка.Следующий() Цикл
					
					Если Выборка.ПеремещениеЕсть Или Выборка.ЦентральныйСклад Тогда

						Для Каждого СтрокаТЧ Из Выборка.ДокументЗапроса.Товары Цикл
		
							Попытка
						
								Если Не СтрокаТЧ.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Согласован Тогда
									Продолжить;	
								КонецЕсли;
								
								СтрокаЗаписиВРегистр = РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ИнициализацияСтрокиЗаписи();
								СтрокаЗаписиВРегистр.ЗаказПокупателя = Выборка.ДокументЗаказа;
								СтрокаЗаписиВРегистр.ЗапросДоступностиТоваров = Выборка.ДокументЗапроса;
								СтрокаЗаписиВРегистр.КлючСвязи = СтрокаТЧ.КлючСвязи;
								СтрокаЗаписиВРегистр.Получен = Истина;
								
								РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ЗаписьВРегистрСтроки(СтрокаЗаписиВРегистр);
					
							Исключение
					
								ТекстОшибки = Выборка.ДокументЗаказа + " " + Выборка.ДокументЗапроса + " " + ОписаниеОшибки();
								ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗапросаДоступностиПолученоПриБезнальнойВыдаче", УровеньЖурналаРегистрации.Ошибка
									, Метаданные.РегистрыСведений.СостояниеСтрокЗаказаПокупателя
									, 
									, ТекстОшибки
								);
								
							КонецПопытки;

						КонецЦикла;
		
						Попытка
						
							ДокументЗапроса = Выборка.ДокументЗапроса.ПолучитьОбъект();
							ДокументЗапроса.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ЧекВКЦ;
							ДокументЗапроса.Записать(РежимЗаписиДокумента.Проведение);
					
						Исключение
				
							ТекстОшибки = ОписаниеОшибки();
							ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗапросаДоступностиПолученоПриБезнальнойВыдаче", УровеньЖурналаРегистрации.Ошибка
								, Метаданные.Документы.ЗапросДоступностиТоваров
								, Выборка.ДокументЗапроса
								, ТекстОшибки
							);
							
						КонецПопытки;

					КонецЕсли;

				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

#КонецОбласти

#Область ПереводЗапросаДоступностиОтправленногоСлужбойДоставки

	Выборка = РезультатыЗапроса[15].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого СтрокаТЧ Из Выборка.ДокументЗапроса.Товары Цикл
		
			Попытка
						
				Если Не СтрокаТЧ.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваров.Согласован Тогда
					Продолжить;	
				КонецЕсли;
				
				СтрокаЗаписиВРегистр = РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ИнициализацияСтрокиЗаписи();
				СтрокаЗаписиВРегистр.ЗаказПокупателя = Выборка.ДокументЗаказа;
				СтрокаЗаписиВРегистр.ЗапросДоступностиТоваров = Выборка.ДокументЗапроса;
				СтрокаЗаписиВРегистр.КлючСвязи = СтрокаТЧ.КлючСвязи;
				СтрокаЗаписиВРегистр.Отправлен = Истина;
				
				РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ЗаписьВРегистрСтроки(СтрокаЗаписиВРегистр);
					
			Исключение
	
				ТекстОшибки = Выборка.ДокументЗаказа + " " + Выборка.ДокументЗапроса + " " + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗапросаДоступностиОтправленногоСлужбойДоставки", УровеньЖурналаРегистрации.Ошибка
					, Метаданные.РегистрыСведений.СостояниеСтрокЗаказаПокупателя
					, 
					, ТекстОшибки
				);
				
			КонецПопытки;

		КонецЦикла;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗапросаДоступностиОтправленаСЦентральногоСкладаСлужбойДоставки

	Выборка = РезультатыЗапроса[16].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
						
			ДокументОбъект = Выборка.ДокументЗапроса.ПолучитьОбъект();
			ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ВыданДоставке;
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗапросаДоступностиОтправленаСЦентральногоСкладаСлужбойДоставки", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗапросДоступностиТоваров
				, Выборка.ДокументЗапроса
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗапросаДоступностиВЗакрыт

	ВыборкаДокументЗапроса = РезультатыЗапроса[17].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументЗапроса.Следующий() Цикл
		
		Выборка = ВыборкаДокументЗапроса.Выбрать();
	
		Если Выборка.Количество() = 1 Тогда
		
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Продано И Выборка.СогласованоВNavision Тогда
		
					Попытка
						
						ДокументЗапроса = Выборка.ДокументЗапроса.ПолучитьОбъект();
						ДокументЗапроса.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Закрыт;
						ДокументЗапроса.Записать(РежимЗаписиДокумента.Проведение);
					
					Исключение
			
						ТекстОшибки = ОписаниеОшибки();
						ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗапросаДоступностиВЗакрыт", УровеньЖурналаРегистрации.Ошибка
							, Метаданные.Документы.ЗапросДоступностиТоваров
							, Выборка.ДокументЗапроса
							, ТекстОшибки
						);
						
					КонецПопытки;

				КонецЕсли;

			КонецЦикла;
		
		КонецЕсли;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗаказКЗакрытиюПриЗакрытыхЗапросахДоступности

	Выборка = РезультатыЗапроса[19].Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЗакрытьЗаказ Тогда
		
			Попытка
						
				ДокументЗаказа = Выборка.ДокументЗаказа.ПолучитьОбъект();
				ДокументЗаказа.Статус = Перечисления.СтатусыЗаказовПокупателей.Закрыт;
				ДокументЗаказа.Записать(РежимЗаписиДокумента.Проведение);
					
			Исключение
	
				ТекстОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказКЗакрытиюПриЗакрытыхЗапросахДоступности", УровеньЖурналаРегистрации.Ошибка
					, Метаданные.Документы.ЗаказПокупателя
					, Выборка.ДокументЗаказа
					, ТекстОшибки
				);
				
			КонецПопытки;

		КонецЕсли;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗапросаДляЗакрытияВNavision

	ВыборкаДокументЗапроса = РезультатыЗапроса[20].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументЗапроса.Следующий() Цикл

		ВыборкаДетальныеЗаписи = ВыборкаДокументЗапроса.Выбрать();
		
		МожноЗакрывать = Истина;
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Не ВыборкаДетальныеЗаписи.НомерСтатуса = 4 Тогда
				
				МожноЗакрывать = Ложь;
				
			КонецЕсли;

		КонецЦикла;
		
		Если МожноЗакрывать Тогда
	
			СтруктураАтрибутов = РегистрыСведений.КлючевыеАтрибутыЗапросовДоступности.ИнициализацияСтруктурыЗаписиРегистра(ВыборкаДокументЗапроса.ДокументЗапроса);
			СтруктураАтрибутов.ОправленоВNavision = Перечисления.СтатусыЗапросаДоступностиВNavision.ГотовКЗакрытиюВNavision;
			РегистрыСведений.КлючевыеАтрибутыЗапросовДоступности.ЗаписьКлючевыхАтребутовЗапросаДоступности(СтруктураАтрибутов);
			ПланыОбмена.ЗарегистрироватьИзменения(ВнешниеИсточникиПовтИсп.СписокУзловNavision(), ВыборкаДокументЗапроса.ДокументЗапроса);
		КонецЕсли;

	КонецЦикла;

#КонецОбласти

#Область ПереводЗаказаВОплачен
	// Изменение статуса запроса доступности при отправке на магазин 

	ВыборкаДокументЗаказа = РезультатыЗапроса[22].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаДокументЗаказа.Следующий() Цикл
		
		Попытка
						
			ДокументОбъект = ВыборкаДокументЗаказа.ДокументЗаказа.ПолучитьОбъект();
			ДокументОбъект.ОплатаЗаказа.Очистить();
	
			Выборка = ВыборкаДокументЗаказа.Выбрать();
	
			Пока Выборка.Следующий() Цикл
	
				НоваяСтрока = ДокументОбъект.ОплатаЗаказа.Добавить();
	
				НоваяСтрока.ВидОплаты = Выборка.ВидОплаты;
				НоваяСтрока.ИДОплаты = Выборка.ИДОплаты;
				НоваяСтрока.НомерОплаты = Выборка.НомерОплаты;
				НоваяСтрока.Отменён = Выборка.Отменён;
				НоваяСтрока.СтатусОплаты = Выборка.СтатусОплаты;
				НоваяСтрока.Сумма = Выборка.Сумма;
				НоваяСтрока.ТипОплаты = Выборка.ТипОплаты;
			
			КонецЦикла;
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
		Исключение

			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказаВОплачен", УровеньЖурналаРегистрации.Ошибка
				, Метаданные.Документы.ЗаказПокупателя
				, ВыборкаДокументЗаказа.ДокументЗаказа
				, ТекстОшибки
			);
			
		КонецПопытки;

	КонецЦикла;  

#КонецОбласти	

#Область ПереводЗаказаОтправленДляЦеннтральногоСклада

	// Изменение статуса запроса доступности при получении магазином

	ВыборкаДокументЗаказа = РезультатыЗапроса[23].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокументЗаказа.Следующий() Цикл

		Выборка = ВыборкаДокументЗаказа.Выбрать();
		
		Если Выборка.Количество() = 1 Тогда
			
			Выборка.Следующий();
			
			Если Выборка.Отправлен Тогда
		
				Попытка
						
					ДокументОбъект = Выборка.ДокументЗаказа.ПолучитьОбъект();
					ДокументОбъект.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Отправлен;
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				Исключение
		
					ТекстОшибки = ОписаниеОшибки();
					ЗаписьЖурналаРегистрации("АвтоСтатусы.ПереводЗаказаВОплачен", УровеньЖурналаРегистрации.Ошибка
						, Метаданные.Документы.ЗапросДоступностиТоваров
						, Выборка.ДокументЗаказа
						, ТекстОшибки
					);
					
				КонецПопытки;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;  

#КонецОбласти

КонецПроцедуры

Процедура АвтоматическаяПродажаПоЧеку() Экспорт
	
	ТаблицаЗаказов = Новый ТаблицаЗначений();
	ТаблицаЗаказов.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	
#Область ПроверкаПродажиПоЧеку

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокуменЗаказ.Ссылка КАК ДокументЗаказа
		|ПОМЕСТИТЬ ДокументыЗаказов
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ДокуменЗаказ
		|ГДЕ
		|	ДокуменЗаказ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПокупателей.Продажа)
		|	И ДокуменЗаказ.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыТовары.КлючСвязиЗапросаДоступности КАК КлючСвязиЗапросаДоступности,
		|	ДокументыЗаказов.ДокументЗаказа КАК ДокументЗаказа,
		|	ЗапросДоступностиТовары.Ссылка КАК ЗапросДоступностиЗаказа
		|ПОМЕСТИТЬ ПроданныеСтроки
		|ИЗ
		|	ДокументыЗаказов КАК ДокументыЗаказов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказыТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекТовары
		|			ПО ЗаказыТовары.КлючСвязи = ЧекТовары.КлючСвязи
		|			И ЗаказыТовары.Ссылка = ЧекТовары.Ссылка.ЗаказПокупателя
		|			И (ЧекТовары.Ссылка.Проведен)
		|			И (ЧекТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа))
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросДоступностиТоваров.Товары КАК ЗапросДоступностиТовары
		|			ПО ЗаказыТовары.Ссылка = ЗапросДоступностиТовары.Ссылка.ДокументОснование
		|			И ЗаказыТовары.КлючСвязиЗапросаДоступности = ЗапросДоступностиТовары.КлючСвязи
		|		ПО ДокументыЗаказов.ДокументЗаказа = ЗаказыТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроданныеСтроки.КлючСвязиЗапросаДоступности КАК КлючСвязиЗапросаДоступности,
		|	ПроданныеСтроки.ДокументЗаказа КАК ДокументЗаказа,
		|	ПроданныеСтроки.ЗапросДоступностиЗаказа КАК ЗапросДоступностиЗаказа,
		|	СостояниеСтрок.Продано КАК Продано
		|ИЗ
		|	ПроданныеСтроки КАК ПроданныеСтроки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСтрокЗаказаПокупателя КАК СостояниеСтрок
		|		ПО (ПроданныеСтроки.КлючСвязиЗапросаДоступности = СостояниеСтрок.КлючСвязи)
		|		И (ПроданныеСтроки.ДокументЗаказа = СостояниеСтрок.ЗаказПокупателя)
		|		И (ПроданныеСтроки.ЗапросДоступностиЗаказа = СостояниеСтрок.ЗапросДоступностиТоваров)
		|ГДЕ
		|	НЕ СостояниеСтрок.Продано";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаЗаписиВРегистр = РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ИнициализацияСтрокиЗаписи();
		СтрокаЗаписиВРегистр.ЗаказПокупателя = Выборка.ДокументЗаказа;
		СтрокаЗаписиВРегистр.ЗапросДоступностиТоваров = Выборка.ЗапросДоступностиЗаказа;
		СтрокаЗаписиВРегистр.КлючСвязи = Выборка.КлючСвязиЗапросаДоступности;
		СтрокаЗаписиВРегистр.Продано = Истина;
		
		РегистрыСведений.СостояниеСтрокЗаказаПокупателя.ЗаписьВРегистрСтроки(СтрокаЗаписиВРегистр);
		
		СтрокаЗаказов = ТаблицаЗаказов.Добавить();
		СтрокаЗаказов.Заказ = Выборка.ДокументЗаказа;
	
	КонецЦикла;
	
#КонецОбласти	

#Область ПерепроведениеИзмененногоЗаказа

	ТаблицаЗаказов.Свернуть("Заказ");
	
	Для Каждого СтрокаЗаказов Из ТаблицаЗаказов Цикл
		
//		ДокументЗаказа = СтрокаЗаказов.Заказ.ПолучитьОбъект();
//		ДокументЗаказа.Записать();
		
	КонецЦикла;

#КонецОбласти

КонецПроцедуры

Процедура СозданиеПеремещений() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗДТ.Ссылка КАК Ссылка,
		|	ЗДТ.Номенклатура.ВидНоменклатуры КАК Проект
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров.Товары КАК ЗДТ
		|ГДЕ
		|	(ЗДТ.Ссылка.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.КОтправке)
		|	И ЗДТ.Ссылка.МагазинОтправитель = &ТекМагазин
		|	ИЛИ ЗДТ.Ссылка.СтатусЗапроса = ЗНАЧЕНИЕ(Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ПродажаБезнал))";

	Запрос.УстановитьПараметр("ТекМагазин", ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
//		ТекМагазин = (Выборка.Ссылка.МагазинОтправитель = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);
//		ВсеВОдномМагазине = (Выборка.Ссылка.МагазинОтправитель = Выборка.Ссылка.МагазинПолучатель);
		
//		Если Выборка.Ссылка.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.КОтправке
//					И ТекМагазин
//				Или Выборка.Ссылка.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.ПродажаБезнал
//					И (Не ТекМагазин Или ВсеВОдномМагазине) Тогда
			
			НовыйДокумент = Документы.ПеремещениеТоваров.СоздатьДокумент();
			НовыйДокумент.Заполнить(Выборка.Ссылка);
			ПеремещениеУжеЕсть = Ложь;
			НовыйДокумент.ДополнительныеСвойства.Свойство("ПеремещениеУжеЕсть", ПеремещениеУжеЕсть);
			Если Не ПеремещениеУжеЕсть Тогда
				НовыйДокумент.ДополнительныеСвойства.Вставить("ПропуститьКонтрольДоступногоКоличества", Истина);
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;

//		КонецЕсли;

	КонецЦикла;
			
КонецПроцедуры

Функция ПолучитьЗаказДляПеремещения(НомерЗапросаДоступности) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаказКлиента", Документы.ЗаказПокупателя.ПустаяСсылка());
	Результат.Вставить("ЗапросДоступности", Документы.ЗапросДоступностиТоваров.ПустаяСсылка());

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ЗаказПокупателя.Ссылка КАК ЗаказКлиента,
		|	ЗапросДоступностиТоваров.Ссылка КАК ЗапросДоступности
		|ИЗ
		|	Документ.ЗапросДоступностиТоваров КАК ЗапросДоступностиТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ЗапросДоступностиТоваров.ДокументОснование = ЗаказПокупателя.Ссылка
		|ГДЕ
		|	ЗапросДоступностиТоваров.Номер = &Номер";
	
	Запрос.УстановитьПараметр("Номер", НомерЗапросаДоступности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Результат.ЗаказКлиента = Выборка.ЗаказКлиента;
		Результат.ЗапросДоступности = Выборка.ЗапросДоступности;

	КонецЕсли;

	Возврат Результат;
	
КонецФункции

#КонецОбласти