&НаКлиенте	//	LNK 06.06.2019 14:51:42
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел()
		Тогда

		ПоказатьОповещениеПользователя("Отказано!",, "Команда предназначена для использования в периферийных узлах.", БиблиотекаКартинок.Ошибка32);

	Иначе
		//А++ 20241018 по задаче  https://awdev.atlassian.net/browse/RETAIL1C-866
		Если ПроверитьРоли() Тогда
			ОткрытьФорму("ОбщаяФорма.ПолучитьЧекИзЦентральногоУзла", Новый Структура, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		Иначе
			ПоказатьОповещениеПользователя("Denied!",, НСтр("ru = '""Нет прав!!!""'; uk = 'Немає прав!'"), БиблиотекаКартинок.Ошибка32);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьРоли() //А++ 20241018 по задаче  https://awdev.atlassian.net/browse/RETAIL1C-866
	Возврат (РольДоступна("АдминистраторСистемы") или РольДоступна("Администрирование") или НЕ РольДоступна("ПолучениеЧековИзЦентральнойБазы"));
КонецФункции
