&НаКлиенте	//	LNK 06.06.2019 14:51:42
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		ПоказатьОповещениеПользователя("Отказано!",, "Команда предназначена для использования в периферийных узлах.", БиблиотекаКартинок.Ошибка32);

	Иначе

		ОткрытьФорму("ОбщаяФорма.ПолучитьЧекИзЦентральногоУзла", Новый Структура, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

	КонецЕсли;

КонецПроцедуры
