//	LNK 18.07.2018 15:23:18
Функция Ping()

	Возврат Истина;

КонецФункции

//	LNK 19.07.2018 13:00:54
Функция AcceptData(IDNode, RequestData)

	УстановитьПривилегированныйРежим(Истина);

	ДанныеОтвета = Новый Структура(
		"НомерПринятого, СписокОшибок"
		, 0, Новый Массив);
	УзелПолучатель  = ОбменДаннымиЗУП.ПолучитьОбъектУзла(ОбщегоНазначенияКлиентСервер.ДесериализоватьJSON(IDNode));
	ДанныеСообщения = ОбщегоНазначенияКлиентСервер.ДесериализоватьJSON(RequestData).Получить();

	ОбменДаннымиЗУП.ВыполнитьЗагрузкуДанныхДляУзла(УзелПолучатель, ДанныеСообщения, ДанныеОтвета);

	Возврат ОбщегоНазначенияКлиентСервер.СериализоватьJSON(ДанныеОтвета);

КонецФункции

//	LNK 30.07.2018 10:51:51
Функция NumberAccepted(IDNode)

	УстановитьПривилегированныйРежим(Истина);

	УзелПолучатель = ОбменДаннымиЗУП.ПолучитьОбъектУзла(ОбщегоНазначенияКлиентСервер.ДесериализоватьJSON(IDNode));

	Возврат УзелПолучатель.НомерПринятого;

КонецФункции
