
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ТехническаяПоддержкаВызовСервера.ОтладочныйРежимРаботы() Тогда

		Отказ = Истина;
		Сообщить("Отказ! Работа разрешена только в отладочном режиме.");

	КонецЕсли;

КонецПроцедуры

#Область ПоддержкаОбщегоФункционалаФормы

&НаСервере	//	LNK 23.07.2019 13:21:56
Функция ЭтотОбъект(ТекущийОбъект = Неопределено) 

	Если ТекущийОбъект = Неопределено Тогда

		Возврат РеквизитФормыВЗначение("Объект");

	КонецЕсли;

	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");

	Возврат Неопределено;

КонецФункции

&НаСервере
Функция ПолноеИмяФормы(Имя)

	Возврат ЭтотОбъект().ПолноеИмя() + ".Форма." + Имя;

КонецФункции // ПолноеИмяФормы()

#КонецОбласти

&НаКлиенте
Процедура Подтвердить(Команда)

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("НомерТелефона", НомерТелефона);

	ОткрытьФорму(ПолноеИмяФормы("Аутентификация"), ПараметрыОткрытия, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВводДанныхКонтрагента(Команда)

	Перем ДокументПродажи;

	ПараметрыОткрытия = Новый Структура(
		"ДанныеКонтрагента, ДокументПродажи, НазначениеДанных"
		, ПолучитьДанныеКонтрагента(ДокументПродажи)
		, ДокументПродажи
		, ПредопределенноеЗначение("Перечисление.НазначениеКонтрагентовОтложенных.ПроверкаВРознице")
	);

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикВводаДанныхКонтрагентаЗавершение", ЭтотОбъект);

	ОткрытьФорму(ПолноеИмяФормы("ВводДанныхКонтрагента"), ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте	//	LNK 15.08.2019 11:08:09
Процедура ОбработчикВводаДанныхКонтрагентаЗавершение(СоставДанных, ДополнительныеПараметры)	Экспорт

//	ДанныеКонтрагента.НомерТелефона = "";

	Если ТипЗнч(СоставДанных) = Тип("Структура") Тогда

		Если НЕ СоставДанных.Ошибка = Истина Тогда


		Иначе

			ЭтоОшибка   = Истина;
			ТекстОшибки = СоставДанных.ОписаниеОшибки;

		КонецЕсли;

	Иначе

		ЭтоОшибка   = Ложь;
		ТекстОшибки = "Ввод данных нового пользователя прерван без применения.";

	КонецЕсли;

	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда

		ПоказатьОповещениеПользователя("Действие не выполнено",, ТекстОшибки, ?(ЭтоОшибка, БиблиотекаКартинок.Предупреждение32, БиблиотекаКартинок.ИнформацияНовости32Анимированная));

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКонтрагента(ДокументПродажи)

	ДанныеКонтрагента = ОбменMicrosoftDynamicsСервер.ИнициализацияДанныхКонтрагента();
	ДанныеКонтрагента.НомерТелефона = ОтправкаSMS.ПодготовитьНомерТелефона(НомерТелефона);

	ДокументПродажи = Документы.ЧекККМ.ПолучитьСсылку();

	Возврат ДанныеКонтрагента;

КонецФункции

&НаКлиенте
Процедура ВерификацияДержателяКарты(Команда)

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИнформационнаяКарта", Карта);
	ПараметрыОткрытия.Вставить("Магазин", Магазин);
	
	ОткрытьФорму(ПолноеИмяФормы("ВерификацияДержателяКарты")
		, ПараметрыОткрытия
		, ЭтотОбъект
		, "ВерификацияДержателяКарты"
		,
		,
		,
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);

КонецПроцедуры




