
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ          

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Перем времИмяУстройства, времАдресУстройства,времПортУстройства,времСОМПорт, времОтладка, времПодключениеПоСети;
	Перем времДлительностьТаймаута;
	
	Перем МассивНалоговыхСтавок;
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	
	//ЗначениеПараметров  = Параметры.ПараметрыОбработки;
	
	Параметры.Свойство("Идентификатор", Идентификатор);
	Заголовок = НСтр("ru='ДП'") + " """ + Строка(Идентификатор) + """";

	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;
	
	Элементы.ТестУстройства.Видимость    = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);
	Элементы.УстановитьДрайвер.Видимость = (ПараметрыСеанса.РабочееМестоКлиента = Идентификатор.РабочееМесто);
	
	
	
	Параметры.Свойство("ИдентификаторУстройства", времИмяУстройства);
	Параметры.Свойство("ИмяУстройства"			, времИмяУстройства);
	Параметры.Свойство("АдресУстройства"		, времАдресУстройства);
	Параметры.Свойство("ПортУстройства"			, времПортУстройства);
	Параметры.Свойство("Отладка"				, времОтладка);
	Параметры.Свойство("Кассир"					, Кассир);
	Параметры.Свойство("Организация"			, Организация);     
	Параметры.Свойство("ЕДРПОУ"					, ЕДРПОУ);     
	Параметры.Свойство("ФискальныйНомерУстройства"	, ФискальныйНомерУстройства);     
	
	
	//Параметры.Свойство("ДлительностьТаймаута"				, времДлительностьТаймаута);
	//Параметры.Свойство("ПодключениеПоСети"		, времПодключениеПоСети);
	Параметры.Свойство("ТаблицаНалоговыхСтавок", МассивНалоговыхСтавок);
	Если ТипЗнч(МассивНалоговыхСтавок) = Тип("Массив") Тогда                    
		МассивВТаблицу(МассивНалоговыхСтавок);	
	КонецЕсли;
	
	
	ИдентификаторУстройства = ?(времИмяУстройства = Неопределено, "", времИмяУстройства); 
	ИмяУстройства	= ?(времИмяУстройства = Неопределено, "", времИмяУстройства);	
	АдресУстройства	= ?(времАдресУстройства = Неопределено, "localhost", времАдресУстройства);
	ПортУстройства	= ?(времПортУстройства = Неопределено, 8080, времПортУстройства);
	Отладка			= ?(времОтладка = Неопределено, Ложь, времОтладка); 
	ДлительностьТаймаута			= ?(времДлительностьТаймаута = Неопределено, 60, времДлительностьТаймаута); 
	
	Элементы.АдресУстройства.Видимость = Истина;
	Элементы.ПортУстройства.Видимость = Истина;
	
КонецПроцедуры

// Процедура - обработчик события "Перед открытием" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИнформациюОДрайвере();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьДрайвер(Команда)
	
	МенеджерОборудованияКлиент.УстановитьДрайвер(Идентификатор);
	
	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)
    
	РезультатТеста = Неопределено;
	ДемонстрационныйРежим = "";
	Элементы.ГруппаДемонстрационныйРежим.Видимость = Ложь;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;
	ПараметрыУстройства = Неопределено;
	ОписаниеОшибки = "";

	
	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("CheckHealth",
																   ВходныеПараметры,
																   ВыходныеПараметры,
																   Идентификатор,
																   ПолучитьНастройки()); 
	Если Не Результат Тогда															   
		Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(Идентификатор,"CheckHealth", 
																			ВходныеПараметры, 
																			ВыходныеПараметры);
	КонецЕсли;
	
	
	ДополнительноеОписание = "";
	Если ТипЗнч(ВыходныеПараметры) = Тип("Массив") Тогда
		
		Если  ВыходныеПараметры.Количество() >= 2 Тогда
			ДополнительноеОписание = ДополнительноеОписание + НСтр("ru = 'Дополнительное описание:'") + " " + ВыходныеПараметры[1];
		КонецЕсли;
		
		Если  ВыходныеПараметры.Количество() >= 3 И НЕ ПустаяСтрока(ВыходныеПараметры[2])  Тогда
			ДемонстрационныйРежим = ВыходныеПараметры[2];
			// ДополнительноеОписание = ДополнительноеОписание + Символы.ПС + НСтр("ru = 'Ограничение:'") + " " + ВыходныеПараметры[2];
			Элементы.ГруппаДемонстрационныйРежим.Видимость = Истина;
		КонецЕсли;
		
	КонецЕсли;
		
	ТекстСообщения = ?(Результат,  НСтр("ru = 'Тест успешно выполнен.%ДополнительноеОписание%'"),
	                               НСтр("ru = 'Тест не пройден.%ДополнительноеОписание%'"));
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
	                             "", Символы.ПС + ДополнительноеОписание));
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

// Процедура представляет обработчик события "Нажатие" кнопки
//
&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()
	
	Параметры.ПараметрыНастройки.Добавить(Идентификатор	, "Идентификатор");
	//Параметры.ПараметрыНастройки.Добавить(ИмяУстройства	, "ИдентификаторУстройства");
	Параметры.ПараметрыНастройки.Добавить(АдресУстройства	, "АдресУстройства");
	Параметры.ПараметрыНастройки.Добавить(ПортУстройства	, "ПортУстройства");
	Параметры.ПараметрыНастройки.Добавить(ФискальныйНомерУстройства			, "ФискальныйНомерУстройства");
	Параметры.ПараметрыНастройки.Добавить(Кассир			, "Кассир");
	Параметры.ПараметрыНастройки.Добавить(ЕДРПОУ			, "ЕДРПОУ");
	Параметры.ПараметрыНастройки.Добавить(Организация		, "Организация");
	Параметры.ПараметрыНастройки.Добавить(ТаблицуВМассив(ТаблицаНалоговыхСтавок), "ТаблицаНалоговыхСтавок");
	//Параметры.ПараметрыНастройки.Добавить(ДлительностьТаймаута		, "ДлительностьТаймаута");
	
	//Закрыть(ПолучитьНастройки());   
	Закрыть(КодВозвратаДиалога.ОК);   

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПолучитьНастройки()
	            
	ПараметрыДрайвера = Новый Структура;
	ПараметрыДрайвера.Вставить("АдресУстройства", АдресУстройства);
	ПараметрыДрайвера.Вставить("ПортУстройства", ПортУстройства);
	ПараметрыДрайвера.Вставить("ФискальныйНомерУстройства", ФискальныйНомерУстройства);
	ПараметрыДрайвера.Вставить("Кассир", Кассир);
	ПараметрыДрайвера.Вставить("ЕДРПОУ", ЕДРПОУ);
	ПараметрыДрайвера.Вставить("Организация", Организация);
	ПараметрыДрайвера.Вставить("ТаблицаНалоговыхСтавок", ТаблицаНалоговыхСтавок);
	ПараметрыДрайвера.Вставить("Отладка", Отладка);
	//ПараметрыДрайвера.Вставить("ДлительностьТаймаута", ДлительностьТаймаута);
	

	Возврат ПараметрыДрайвера;
	
КонецФункции


&НаКлиенте
Процедура ОбновитьИнформациюОДрайвере()

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;
	ПараметрыУстройства = Новый Структура("АдресУстройства,ПортУстройства",ЭтотОбъект.АдресУстройства,ЭтотОбъект.ПортУстройства);
	
	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьОписаниеДрайвера",
																   ВходныеПараметры,
																   ВыходныеПараметры,
																   Идентификатор,
																   ПараметрыУстройства); 
	Если Не Результат Тогда															   
		Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(Идентификатор,"ПолучитьОписаниеДрайвера", 
																			ВходныеПараметры, 
																			ВыходныеПараметры);
	КонецЕсли;
	
	Если Результат  Тогда
		ОписаниеДрайвера_ = ВыходныеПараметры[1];
		
		ДрайверУстановлен         = Истина;       
		НаименованиеДрайвера		= ОписаниеДрайвера_.Наименование;
		ВерсияДрайвера = ОписаниеДрайвера_.Версия;
		Организация = ОписаниеДрайвера_.Организация;
		ЕДРПОУ = ОписаниеДрайвера_.ЕДРПОУ;
		Кассир = ОписаниеДрайвера_.Кассир;
		ФискальныйНомерУстройства =  ОписаниеДрайвера_.ФискальныйНомерУстройства;
		ОписаниеДрайвера = "Зарегестрировано на: "+ОписаниеДрайвера_.Организация+ Символы.ПС
								+"ЕДРПОУ: "+ОписаниеДрайвера_.ЕДРПОУ+Символы.ПС
								+"Налоговая: "+ОписаниеДрайвера_.Налоговая+Символы.ПС
								+"Адрес налоговой: "+ОписаниеДрайвера_.АдресНалоговой+Символы.ПС
								+"ПРРО №: "+ОписаниеДрайвера_.ФискальныйНомерУстройства+Символы.ПС
								+"Кассир: "+ОписаниеДрайвера_.Кассир+Символы.ПС
								+"Подпись кассира действителна до: "+ОписаниеДрайвера_.ДействителенДо;
		
	Иначе
		Если ВыходныеПараметры.Количество() > 1 И ЗначениеЗаполнено(ВыходныеПараметры[1]) Тогда
			ОписаниеОшибки = ВыходныеПараметры[1];
			ПоказатьОповещениеПользователя(ОписаниеОшибки,,,,СтатусОповещенияПользователя.Важное);
		КонецЕсли;
		
		ДрайверУстановлен = Ложь;
		ВерсияДрайвера  = НСтр("ru='Не определена'");
	КонецЕсли;
	
	Элементы.Драйвер.ЦветТекста = ?(ВерсияДрайвера = НСтр("ru='Не определена'"), ЦветОшибки, ЦветТекста);
	Элементы.Версия.ЦветТекста  = Элементы.Драйвер.ЦветТекста ;
	Элементы.НаименованиеДрайвера.ЦветТекста = ?(НаименованиеДрайвера = НСтр("ru='Не определено'"), ЦветОшибки, ЦветТекста);
	Элементы.ОписаниеДрайвера.ЦветТекста     = ?(ОписаниеДрайвера     = НСтр("ru='Не определено'"), ЦветОшибки, ЦветТекста);
	Элементы.ОписаниеДрайвера.Видимость = НЕ ПустаяСтрока(ОписаниеДрайвера);
	
	Элементы.УстановитьДрайвер.Доступность = Не (ДрайверУстановлен = НСтр("ru='Установлен'"));
	Элементы.ТестУстройства.Доступность = (НЕ ДрайверУстановлен = НСтр("ru='Не установлен'")) 
	                                      И (НЕ ИнтеграционнаяБиблиотека ИЛИ (ИнтеграционнаяБиблиотека И ОсновнойДрайверУстановлен))
   
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОписаниеОшибки = "";
	РезультатЭТ = МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(ЭтотОбъект,
																							Идентификатор,
																							ОписаниеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьНалоговыеСтавки(Команда)
	ОбновитьНалоговыеСтавки();	
КонецПроцедуры                

&НаКлиенте
Процедура ОбновитьНалоговыеСтавки()
	Если Не ДрайверУстановлен Тогда
		Возврат;
	КонецЕсли;
	
	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;
	ПараметрыУстройства = Неопределено;
	ОписаниеОшибки = "";

	
	//Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(Идентификатор,"GetTaxRate", 
	//																		ВходныеПараметры, 
	//																		ВыходныеПараметры);
	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("GetTaxRateTable",
																   ВходныеПараметры,
																   ВыходныеПараметры,
																   Идентификатор,
																   ПараметрыУстройства); 

	Если Не Результат Тогда
		ОписаниеОшибки = ВыходныеПараметры[1];	
		ПоказатьОповещениеПользователя("Не удалось получить налоговые ставки"+Символы.ПС+ОписаниеОшибки);
		Возврат;
	КонецЕсли;  
	
	МассивНалоговыхСтавок = ВыходныеПараметры[2];
	Для Каждого СтруктураСтавки Из МассивНалоговыхСтавок Цикл
		НайденныеСтроки = ТаблицаНалоговыхСтавок.НайтиСтроки(Новый Структура("КодНалога",СтруктураСтавки.КодНалога));
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаНалоговойСтавки = ТаблицаНалоговыхСтавок.Добавить();
		Иначе
			СтрокаНалоговойСтавки = НайденныеСтроки[0];
		КонецЕсли;                                     
		ЗаполнитьЗначенияСвойств(СтрокаНалоговойСтавки,СтруктураСтавки);
		
	КонецЦикла;
	
	
КонецПроцедуры                

&НаКлиенте
Функция ТаблицуВМассив(ТЗ_Ставки)
	МассивСтрок = Новый Массив;
	Для Каждого Строка_ Из ТЗ_Ставки Цикл
		СтруктураСтроки = Новый Структура("КодНалога,Наименование,Ставка,Акциз,СтавкаВ1С");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки,Строка_);
		МассивСтрок.Добавить(СтруктураСтроки);
	КонецЦикла;

	Возврат МассивСтрок;
КонецФункции

&НаСервере
Процедура МассивВТаблицу(МассивСтрок)
	Для Каждого СтруктураСтроки Из МассивСтрок Цикл
		СтрокаТаблицы = ТаблицаНалоговыхСтавок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы,СтруктураСтроки);
	КонецЦикла;

КонецПроцедуры
