#Область СлужебныеПроцедурыИФункции

#Область ПроцедураУстановкиПериодаРассчитанныхИтогов

//	Обработчик регламентного задания "УстановкаПериодаРассчитанныхИтогов".
Процедура УстановкаПериодаРассчитанныхИтоговОбработчикЗадания() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	УстановитьПериодРассчитанныхИтогов();

КонецПроцедуры

//	Для внутреннего использования.
Процедура УстановитьПериодРассчитанныхИтогов() Экспорт
	
	МинимальныйПериодРассчитанныхИтогов = ОбщегоНазначенияРТповтИсп.ПолучитьУчетнуюПолитику().МинимальныйПериодРассчитанныхИтогов;
	Если Не ЗначениеЗаполнено(МинимальныйПериодРассчитанныхИтогов) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСеанса = ТекущаяДатаСеанса();
	МаксимальныйПериод	= КонецМесяца(ДобавитьМесяц(ДатаСеанса, -1));
	МинимальныйПериод	= НачалоМесяца(ДобавитьМесяц(ДатаСеанса, -МинимальныйПериодРассчитанныхИтогов));

//	Расчет итогов для регистров накопления.
	ВидОстатки = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки;

	ИмяСобытия	  = "RECALC_TOTALS";

	ЖурналСобытий.Регистрация(ИмяСобытия, УровеньЖурналаРегистрации.Информация
		,
		, МаксимальныйПериод
		,
		, "Начало. Запущена процедура пересчёта итогов на '" + Формат(МаксимальныйПериод, "ДФ=dd.MM.yyyy") + "'"
		, МаксимальныйПериод
		, Истина
		, Ложь
	);

//	---------------------------------------------------------------------------------------

	Для Каждого РегистрМетаданные Из Метаданные.РегистрыНакопления Цикл

		Если НЕ РегистрМетаданные.ВидРегистра = ВидОстатки Тогда

			Продолжить;

		КонецЕсли;
		
		РегистрНакопленияМенеджер = РегистрыНакопления[РегистрМетаданные.Имя];

		Если РегистрМетаданные.Имя = "ПродажиПоДисконтнымКартам"
				ИЛИ РегистрМетаданные.Имя = "ПродажиПоДисконтнымКартамСкидка" Тогда

			Продолжить;

		КонецЕсли;

		Если РегистрНакопленияМенеджер.ПолучитьМаксимальныйПериодРассчитанныхИтогов() < МаксимальныйПериод
				И РегистрНакопленияМенеджер.ПолучитьИспользованиеИтогов() Тогда

			ТекстОтвета = СтрШаблон("Пересчёт регистра %1. Процедура пересчёта итогов с %2 по %3"
				, РегистрМетаданные.ПолноеИмя()
				, Формат(МинимальныйПериод, "ДФ=dd.MM.yyyy")
				, Формат(МаксимальныйПериод, "ДФ=dd.MM.yyyy"));

			ЖурналСобытий.Регистрация(ИмяСобытия, УровеньЖурналаРегистрации.Информация
				, РегистрМетаданные
				, МаксимальныйПериод
				,
				, ТекстОтвета
				, РегистрМетаданные.ПолноеИмя()
				, Истина
				, Ложь
			);

			
			РегистрНакопленияМенеджер.УстановитьМинимальныйИМаксимальныйПериодыРассчитанныхИтогов(МинимальныйПериод
					, МаксимальныйПериод);

		КонецЕсли;

		Если РегистрНакопленияМенеджер.ПолучитьИспользованиеТекущихИтогов() Тогда

			РегистрНакопленияМенеджер.ПересчитатьТекущиеИтоги();

		КонецЕсли;

	КонецЦикла;

//	---------------------------------------------------------------------------------------

	ТекстОтвета = СтрШаблон("Завершение. Процедура пересчёта итогов с %1 по %2"
		, Формат(МинимальныйПериод, "ДФ=dd.MM.yyyy")		, Формат(МаксимальныйПериод, "ДФ=dd.MM.yyyy"));

	ЖурналСобытий.Регистрация(ИмяСобытия
		, УровеньЖурналаРегистрации.Информация
		,
		, МаксимальныйПериод
		,
		, ТекстОтвета
		, МаксимальныйПериод
		, Истина
		, Ложь
	);

КонецПроцедуры

#КонецОбласти
	
#КонецОбласти
