
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданиеФорматаЗаписиКодаМагнитныхКарт" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

//Процедура - обработчик команды "ОткрытьПомощникНастройки"
//
&НаКлиенте
Процедура ОткрытьПомощникНастройки(Команда)
	
	ОткрытьФорму("РегистрСведений.ФорматыЗаписиКодовМагнитныхКарт.Форма.ФормаПомощникаСозданияЗаписи",, ЭтотОбъект, УникальныйИдентификатор);

КонецПроцедуры
