////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с банками".
// Процедуры и функции получения, сортировки данных классификатора
// банков, запись полученных данных в справочник КлассификаторБанков,
// обработка данных справочника КлассификаторБанков.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Работа с данными справочника КлассификаторБанков

// Получает данные из справочника КлассификаторБанков по значениям КодБанка и КоррСчета 
// 
// Параметры
//  КодБанка		 - Строка					   - Значение кода банка (МФО)
//  КоррСчет	 - Строка					   - Значение корр.счета
//  ЗаписьОБанке - СправочникСсылка или строка - результат выборки
Процедура ПолучитьДанныеКлассификатора(КодБанка = "", КоррСчет = "", ЗаписьОБанке) Экспорт
	Если Не ПустаяСтрока(КодБанка) Тогда
		КлассификаторБанков   = Справочники.КлассификаторБанков;
		ЗаписьОБанке		  = КлассификаторБанков.НайтиПоКоду(КодБанка);
		Если ЗаписьОБанке.Пустая() Тогда
			ЗаписьОБанке = "";
		КонецЕсли;	
	ИначеЕсли Не ПустаяСтрока(КоррСчет) Тогда
		КлассификаторБанков   = Справочники.КлассификаторБанков;
		ЗаписьОБанке		  = КлассификаторБанков.НайтиПоРеквизиту("КоррСчет", КоррСчет);
		Если ЗаписьОБанке.Пустая() Тогда
			ЗаписьОБанке = "";
		КонецЕсли;	
	Иначе
		ЗаписьОБанке = "";
	КонецЕсли;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// См. описание этой же процедуры в модуле СтандартныеПодсистемыСервер.
Процедура ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики) Экспорт
	
	// КЛИЕНТСКИЕ ОБРАБОТЧИКИ.
	
	КлиентскиеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриНачалеРаботыСистемы"].Добавить(
		"РаботаСБанкамиКлиент");
	
	// СЕРВЕРНЫЕ ОБРАБОТЧИКИ.
	
	СерверныеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиентаПриЗапуске"].Добавить(
		"РаботаСБанками");
		
КонецПроцедуры

// Заполняет параметры, которые используется клиентским кодом на запуске конфигурации.
//
// Параметры:
//   Параметры (Структура) Параметры запуска.
//
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	
КонецПроцедуры

// Добавляет в таблицу информацию о регламентных заданиях подсистемы для модели сервиса.
//
// Параметры:
//   ТаблицаИспользования (ТаблицаЗначений) Таблица регламентных заданий.
//      |- РегламентноеЗадание (Строка) Имя предопределенного регламентного задания.
//      |- Использование       (Булево) Истина, если регламентное задание должно
//                                      выполняться в модели сервиса.
//
Процедура ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования) Экспорт
	
	
КонецПроцедуры

// Заполняет массив типов неразделенных данных. Он используется при обновлении ссылок 
// при загрузке-выгрузке конфигурации
// 
// Параметры:
//    МассивТипов - массив
//
Процедура ПриОпределенииСтандартныхТиповОбщихДанных(Знач МассивТипов) Экспорт
	
	МассивТипов.Добавить(Тип("СправочникСсылка.КлассификаторБанков"));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ



////////////////////////////////////////////////////////////////////////////////
// Работа с данными диска ИТС


////////////////////////////////////////////////////////////////////////////////
// Запись обработанных данных


////////////////////////////////////////////////////////////////////////////////
// Прочие процедуры и функции


