#Область ОбработчикиОсновныхСобытийФормы

//	LNK 17.03.2017 16:33:30
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Магазин = ПараметрыСеанса.ТекущийМагазин;
		Элементы.ОтборМагазин.ТолькоПросмотр = Истина;

	КонецЕсли;

КонецПроцедуры

//	LNK 17.03.2017 16:35:04
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОтборМагазинПриИзменении(Неопределено);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

			Настройки.Вставить("Магазин", ПараметрыСеанса.ТекущийМагазин);

	Иначе	Магазин = Настройки.Получить("Магазин");

	КонецЕсли;
	
	УстановитьОтборДинамическогоСписка("Магазин");
	//+HVOYA YURA G. 28.09.2016 21:19:11
	ТолькоРаботающие = Истина;
	ОтфильтроватьПоУволенным(ТолькоРаботающие);
	//-HVOYA YURA G. 28.09.2016 21:19:13
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПользовательИзменилТекущуюОрганизацию" Тогда

		Если НЕ Магазин = Параметр.Магазин Тогда

			Магазин = Параметр.Магазин;
			ОтборМагазинПриИзменении(Неопределено);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборМагазинПриИзменении(Элемент)
	//+HVOYA YURA G. 26.09.2016 11:24:59
	Список.Отбор.Элементы.Очистить();
	//-HVOYA YURA G. 26.09.2016 11:25:03
	
	УстановитьОтборДинамическогоСписка("Магазин");
	
	//+HVOYA YURA G. 28.09.2016 23:59:28
		Если ТолькоРаботающие Тогда
			
			ОтфильтроватьПоУволенным(ТолькоРаботающие)
			
		КонецЕсли;	
	//-HVOYA YURA G. 28.09.2016 23:59:29
	
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ИмяРеквизита)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		ИмяРеквизита, 
		ЭтотОбъект[ИмяРеквизита], 
		ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]));
		
КонецПроцедуры

//+HVOYA YURA G. 26.09.2016 11:12:03
&НаКлиенте
Процедура ТолькоРаботающиеПриИзменении(Элемент)

		Если ТолькоРаботающие Тогда
			
			ОтфильтроватьПоУволенным(ТолькоРаботающие)
		Иначе
			//Список.Отбор.Элементы.Очистить();
		
		  //УстановитьОтборДинамическогоСписка("Магазин");
		  ОтборМагазинПриИзменении(Элемент)
		КонецЕсли;	
		
КонецПроцедуры
	
&НаСервере
Процедура ОтфильтроватьПоУволенным(hiТолькоРаботающие)
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Уволен");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = hiТолькоРаботающие;
		ЭлементОтбора.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура hiПечатьЭтикеток(Команда)
	ЗначенияСписка = Элементы.Список.ВыделенныеСтроки;
	ФормаПечати = ПолучитьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма.Форма");
		Для  Индекс = 0 По ЗначенияСписка.Количество() - 1 Цикл
	    Сотрудник = ЗначенияСписка[Индекс];
		Штрихкод = ПолучитьШтрихкод(Сотрудник);
		Стр = ФормаПечати.Объект.Товары.Добавить();
		Стр.Номенклатура = Сотрудник;
		Стр.Штрихкод  = Штрихкод;
	КонецЦикла;
	ФормаПечати.Открыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьШтрихкод(Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформационныеКарты.Ссылка КАК ВладелецКарты
		|ИЗ
		|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
		|ГДЕ
		|	ИнформационныеКарты.ВладелецКарты.Ссылка = &Ссылка
		|	И ИнформационныеКарты.ТипКарты = &ТипКарты";
	
	Запрос.УстановитьПараметр("Ссылка", Сотрудник.Ссылка);
	Запрос.УстановитьПараметр("ТипКарты", Перечисления.ТипыИнформационныхКарт.Регистрационная);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	ВладелецКарты = ВыборкаДетальныеЗаписи.ВладелецКарты
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец
		|	И Штрихкоды.ТипШтрихкода = &ТипШтрихкода";
	
	Запрос.УстановитьПараметр("Владелец", ВладелецКарты);
	Запрос.УстановитьПараметр("ТипШтрихкода", ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Штрихкод
	КонецЕсли;
	

КонецФункции

//-HVOYA YURA G. 26.09.2016 11:12:12



