//	LNK 20.05.2019 14:53:49
Процедура ПроверитьРегламентВыполненияАлгоритмов()	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ВыполнениеАлгоримов);

	Если НЕ РегламентноеЗадание.Использование ИЛИ НЕ РегламентноеЗадание.Ключ = "ExecutionOfAlgorithms" Тогда

		РегламентноеЗадание.Использование = Истина;
		РегламентноеЗадание.Наименование  = "Алгоритмы (обязательный регламент)";
		РегламентноеЗадание.Ключ          = "ExecutionOfAlgorithms";

		ДниНедели = Новый Массив;
		ДниНедели.Добавить(1);
		ДниНедели.Добавить(2);
		ДниНедели.Добавить(3);
		ДниНедели.Добавить(4);
		ДниНедели.Добавить(5);
		ДниНедели.Добавить(6);
		ДниНедели.Добавить(7);

		РегламентноеЗадание.Расписание.ДниНедели = ДниНедели;

		РегламентноеЗадание.Расписание.ПериодПовтораДней = 1;
		РегламентноеЗадание.Расписание.ДеньНеделиВМесяце = 0;
		РегламентноеЗадание.Расписание.ДеньВМесяце       = 0;

		РегламентноеЗадание.Расписание.ДатаНачала  = НачалоГода(ТекущаяДата());
		РегламентноеЗадание.Расписание.ВремяНачала = '00010101';
		РегламентноеЗадание.Расписание.ВремяКонца  = '00010101';
		РегламентноеЗадание.Расписание.ПериодПовтораВТечениеДня = 60;

		РегламентноеЗадание.Расписание.ДетальныеРасписанияДня.Очистить();

		РегламентноеЗадание.Параметры.Очистить();
		РегламентноеЗадание.Параметры.Добавить();
		РегламентноеЗадание.Параметры[0] = "все";

		РегламентноеЗадание.Записать();

	КонецЕсли;

КонецПроцедуры
