#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Функция возвращает хозяйственную операцию по умолчанию
//
// Параметры
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации
//
// Возвращаемое значение:
//   СправочникСсылка.ХозяйственныеОперации
//
Функция ПолучитьОперациюПоУмолчанию(ХозяйственнаяОперация) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	АналитикаХозяйственныхОпераций.Ссылка КАК АналитикаХозяйственнойОперации
	|ИЗ
	|	Справочник.АналитикаХозяйственныхОпераций КАК АналитикаХозяйственныхОпераций
	|ГДЕ
	|	АналитикаХозяйственныхОпераций.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И НЕ АналитикаХозяйственныхОпераций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		АналитикаХозяйственнойОперации = Выборка.АналитикаХозяйственнойОперации;
	Иначе
		АналитикаХозяйственнойОперации = Справочники.АналитикаХозяйственныхОпераций.ПустаяСсылка();
	КонецЕсли;
	
	Возврат АналитикаХозяйственнойОперации;
	
КонецФункции

// Процедура заполняет предопределенные элементы статей движения денежных средств.
//
Процедура ЗаполнитьПредопределенные() Экспорт
	
	Соответствие = Новый Соответствие;

	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ВозвратОтПокупателя,
		Перечисления.ХозяйственныеОперации.ВозвратОтПокупателя);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ВозвратПоставщику,
		Перечисления.ХозяйственныеОперации.ВозвратПоставщику);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.КомплектацияНоменклатуры,
		Перечисления.ХозяйственныеОперации.КомплектацияНоменклатуры);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ОприходованиеТоваров,
		Перечисления.ХозяйственныеОперации.Оприходование);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ОприходованиеПоИнвентаризации,
		Перечисления.ХозяйственныеОперации.ОприходованиеПоИнвентаризации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПеремещениеТоваров,
		Перечисления.ХозяйственныеОперации.ПеремещениеТоваров);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов,
		Перечисления.ХозяйственныеОперации.ПогашениеПодарочныхСертификатов);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПоступлениеТоваров,
		Перечисления.ХозяйственныеОперации.ПоступлениеТоваров);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.РеализацияТоваров,
		Перечисления.ХозяйственныеОперации.РеализацияТоваров);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПередачаПодарочныхСертификатовВПодарок,
		Перечисления.ХозяйственныеОперации.РеализацияТоваров);	//	LNK 15.05.2021 06:38:28
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПродажаПодаркаПодарочныйСертификат,
		Перечисления.ХозяйственныеОперации.РеализацияТоваров);	//	LNK 17.05.2021 06:51:49
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.СкидкиПодарки,
		Перечисления.ХозяйственныеОперации.СписаниеНаЗатраты);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПередачаТоваровДоРеализации,
		Перечисления.ХозяйственныеОперации.ПередачаТоваровДоРеализации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПередачаТоваровПослеРеализации,
		Перечисления.ХозяйственныеОперации.ПередачаТоваровПослеРеализации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПриемТоваровОтДругойОрганизации,
		Перечисления.ХозяйственныеОперации.ПриемТоваровОтДругойОрганизации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПересортицаТоваров,
		Перечисления.ХозяйственныеОперации.ПересортицаТоваров);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.СписаниеПоИнвентаризации,
		Перечисления.ХозяйственныеОперации.СписаниеПоИнвентаризации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.СписаниеНаЗатраты,
		Перечисления.ХозяйственныеОперации.СписаниеНаЗатраты);
		
	Для Каждого Элемент Из Соответствие Цикл
	
		СправочникОбъект = Элемент.Ключ.ПолучитьОбъект();
		Если НЕ СправочникОбъект.ХозяйственнаяОперация = Элемент.Значение Тогда
			СправочникОбъект.ХозяйственнаяОперация = Элемент.Значение;
			Попытка
				СправочникОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
