#Область ОбработчикиСобытийФормы

&НаСервере	//	LNK 27.05.2020 09:09:52
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры

&НаКлиенте	//	LNK 30.07.2021 13:10:39
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "УслугаБанкаИзменение" Тогда

		Элементы.Список.Обновить();

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

&НаКлиенте	//	LNK 08.01.2020 11:32:03
Процедура КомандаСоздатьОплатаЧастями(Команда)

	НовыйЭлементУслугаБанка("ОплатаЧастями");

КонецПроцедуры

&НаКлиенте	//	LNK 08.01.2020 11:32:59
Процедура КомандаСоздатьКредит(Команда)

	НовыйЭлементУслугаБанка("Кредит");

КонецПроцедуры

&НаКлиенте	//	LNK 13.11.2020 06:22:19
Процедура КомандаСоздатьПакетМалыша(Команда)

	НовыйЭлементУслугаБанка("ПакетМалыша");

КонецПроцедуры

&НаКлиенте	//	LNK 08.01.2020 11:39:47
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если НЕ Копирование И НЕ Группа Тогда
		
		Отказ = Истина;
		НовыйЭлементУслугаБанка("ОплатаЧастями");
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте	//	LNK 08.01.2020 11:41:00
Процедура НовыйЭлементУслугаБанка(ИмяПеречисления)

	СтруктураПараметры = Новый Структура("Основание", Новый Структура);
	СтруктураПараметры.Основание.Вставить("ТипУслуги", ПредопределенноеЗначение("Перечисление.ТипыУслугБанка." + ИмяПеречисления));

	ОткрытьФорму("Справочник.УслугиБанка.ФормаОбъекта", СтруктураПараметры, Элементы.Список);

КонецПроцедуры


