
Функция ПолучитьQRкод(QRСтрока, УровеньКоррекции, Размер) Экспорт
	ГенераторQRКода = ПолучитьГенераторQRкода();
	Если ГенераторQRКода = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ДвоичныеДанныеКартинки = ГенераторQRКода.GenerateQRCode(QRСтрока, УровеньКоррекции, Размер);
	Исключение
		сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ДвоичныеДанныеКартинки;
	
КонецФункции	

Функция ПолучитьГенераторQRкода() Экспорт
	лМакетКомпоненты = ПолучитьОбщийМакет("КомпонентаПечатиQRКода");
	лАдрес = ПоместитьВоВременноеХранилище(лМакетКомпоненты);
	ГенераторQRкода = Неопределено;
	попытка
		Если ПодключитьВнешнююКомпоненту(лАдрес,"QR") тогда
			ГенераторQRкода = Новый("AddIn.QR.QRCodeExtension");
		иначе
			Сообщить("Не удалось подключить компоненту генерации QR кода");		
		конецЕсли;
	исключение
		Сообщить(ОписаниеОшибки());	
	КонецПопытки;
	возврат ГенераторQRкода;
КонецФункции	

Функция ПолучитьТабличныйДокументЧек(ОтветККМ, ПараметрыЗакрытия, ТекстЗаголовка = "", URL = "") Экспорт

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Чек_Накладная";
	
	Макет = ПолучитьОбщийМакет("ПРРО_ШаблонЧекаDeviceManagerФискальныйРегистратор");
	
	URL = "";
	КодЧекаККМ = "";
	printinfo= "";
	goods ="";
	pays ="";
	taxes ="";

	Если ЗначениеЗаполнено(ОтветККМ) Тогда

		Попытка

			сОтветККМ =  РасшифроватьJSON(ОтветККМ);
			сИнфо = сОтветККМ.Получить("info");

			Если НЕ сИнфо = Неопределено И ТипЗнч(сИнфо) = Тип("Соответствие") Тогда

				URL = ПолучитьЗначениеСоответствия(сИнфо, "qr", URL);
				КодЧекаККМ = ПолучитьЗначениеСоответствия(сИнфо, "doccode", КодЧекаККМ);

			КонецЕсли;

		Исключение

		КонецПопытки;

		Если НЕ сИнфо = Неопределено И ТипЗнч(сИнфо) = Тип("Соответствие") Тогда
			
			task =  ПолучитьЗначениеСоответствия(сИнфо, "task", "");
			ЭтоВозврат = task = 2;
			
			//printinfo
			printinfo = ПолучитьЗначениеСоответствия(сИнфо, "printinfo", printinfo);
			
			Если НЕ printinfo = Неопределено И ТипЗнч(printinfo) = Тип("Соответствие") Тогда
				
				goods =  ПолучитьЗначениеСоответствия(printinfo, "goods", goods);
				pays =  ПолучитьЗначениеСоответствия(printinfo, "pays", pays);
				taxes =  ПолучитьЗначениеСоответствия(printinfo, "taxes", taxes);
				
				
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
			ОбластьМакета.Параметры.fis_code = ПолучитьЗначениеСоответствия(printinfo, "fis_code", ""); 
			ОбластьМакета.Параметры.name = ПолучитьЗначениеСоответствия(printinfo, "name", ""); 
			ОбластьМакета.Параметры.shopad = ПолучитьЗначениеСоответствия(printinfo, "shopad", ""); 
			ОбластьМакета.Параметры.shopname = ПолучитьЗначениеСоответствия(printinfo, "shopname", ""); 
			ОбластьМакета.Параметры.vat_code = ПолучитьЗначениеСоответствия(printinfo, "vat_code", ""); 
			ОбластьМакета.Параметры.fisid = СтрЗаменить(ПолучитьЗначениеСоответствия(printinfo, "fisid", ""),Символы.НПП,""); 
			//"fisid"
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Пробел");
			ТабДокумент.Вывести(ОбластьМакета);		
			
			Для каждого СтрокаТоваров ИЗ goods Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Товар");
				ОбластьМакета.Параметры.cnt = Формат(ПолучитьЗначениеСоответствия(СтрокаТоваров, "cnt", ""),"ЧДЦ=3"); 
				ОбластьМакета.Параметры.price = Формат(ПолучитьЗначениеСоответствия(СтрокаТоваров, "price", ""),"ЧДЦ=2");  			
				ТабДокумент.Вывести(ОбластьМакета);
				
				code2 = ПолучитьЗначениеСоответствия(СтрокаТоваров, "code2", "");
				Если ЗначениеЗаполнено(code2) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("УКТЗЕД");
					ОбластьМакета.Параметры.code2 = СокрЛП(code2);
					ТабДокумент.Вывести(ОбластьМакета);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("ТоварИмя");
				
				ОбластьМакета.Параметры.name = ПолучитьЗначениеСоответствия(СтрокаТоваров, "name", ""); 
				//"code2" "code1" "code3"
				
				ОбластьМакета.Параметры.cost =  Формат(ПолучитьЗначениеСоответствия(СтрокаТоваров, "cost", ""),"ЧДЦ=2");  
				ОбластьМакета.Параметры.taxlit = ПолучитьЗначениеСоответствия(СтрокаТоваров, "taxlit", ""); 
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				disc = ПолучитьЗначениеСоответствия(СтрокаТоваров, "disc", ""); 
				Если ЗначениеЗаполнено(disc) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Скидка");
					ОбластьМакета.Параметры.disc = Формат(disc,"ЧДЦ=2"); 
					ОбластьМакета.Параметры.taxlit = ПолучитьЗначениеСоответствия(СтрокаТоваров, "taxlit", ""); 
					
					ТабДокумент.Вывести(ОбластьМакета);		
				КонецЕсли;
				
				comment = ПолучитьЗначениеСоответствия(СтрокаТоваров, "comment", ""); 
				Если ЗначениеЗаполнено(comment) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Комментарий");
					ОбластьМакета.Параметры.comment = comment; 
					
					ТабДокумент.Вывести(ОбластьМакета);		
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("ПробелУзкий");
				ТабДокумент.Вывести(ОбластьМакета);		
				
			КонецЦикла;

			ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));		

			Для каждого СтрокаОплат ИЗ pays Цикл

				ОбластьМакета = Макет.ПолучитьОбласть("Оплата");
				ОбластьМакета.Параметры.sum = Формат(ПолучитьЗначениеСоответствия(СтрокаОплат, "sum", ""),"ЧДЦ=2")+" грн.";  
				ОбластьМакета.Параметры.type = ПолучитьЗначениеСоответствия(СтрокаОплат, "typen", ""); 
				//"info" "typ"
				
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
			
			sum_topay =  ПолучитьЗначениеСоответствия(printinfo, "sum_topay", "");
			sum_0 = ПолучитьЗначениеСоответствия(printinfo, "sum_0", "");
			sum_disc = ПолучитьЗначениеСоответствия(printinfo,"sum_disc", "");
			round = sum_0-sum_topay -sum_disc;
			
			Если round <> 0 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Округления");
				ОбластьМакета.Параметры.round = Формат(round, "ЧДЦ=2");  
				ТабДокумент.Вывести(ОбластьМакета);	
			КонецЕсли;

			ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));		
			
			ОбластьМакета = Макет.ПолучитьОбласть("Итог");
			ОбластьМакета.Параметры.sum_topay = Формат(sum_0-sum_disc,"ЧДЦ=2")+" грн.";  
			ТабДокумент.Вывести(ОбластьМакета);	

			ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));		
			
			Для каждого СтрокаНалогов ИЗ taxes Цикл
				tax_sum = Формат(ПолучитьЗначениеСоответствия(СтрокаНалогов, "tax_sum", ""),"ЧДЦ=2");  
				Если ЗначениеЗаполнено(tax_sum) Тогда
					
					ОбластьМакета = Макет.ПолучитьОбласть("Налог");
					ОбластьМакета.Параметры.tax_percent = Формат(ПолучитьЗначениеСоответствия(СтрокаНалогов, "tax_percent", ""),"ЧДЦ=2");  
					ОбластьМакета.Параметры.tax_name = ПолучитьЗначениеСоответствия(СтрокаНалогов, "tax_name", ""); 
					ОбластьМакета.Параметры.tax_sum = Формат(ПолучитьЗначениеСоответствия(СтрокаНалогов, "tax_sum", ""),"ЧДЦ=2");  
					//"gr_code" "base_sum"
					
					ТабДокумент.Вывести(ОбластьМакета);
				КонецЕсли;

				ex_sum = ПолучитьЗначениеСоответствия(СтрокаНалогов, "ex_sum", "");

				Если ЗначениеЗаполнено(ex_sum) Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Акциз");
					ОбластьМакета.Параметры.ex_percent = Формат(ПолучитьЗначениеСоответствия(СтрокаНалогов, "ex_percent", ""),"ЧДЦ=2");  
					ОбластьМакета.Параметры.ex_name = ПолучитьЗначениеСоответствия(СтрокаНалогов, "ex_name", ""); 
					ОбластьМакета.Параметры.ex_sum = Формат(ex_sum,"ЧДЦ=2");  
					
					ТабДокумент.Вывести(ОбластьМакета);
					
				КонецЕсли

			КонецЦикла;

			ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));		

			ОбластьМакета = Макет.ПолучитьОбласть("КОплате");
			Если ЭтоВозврат Тогда
				ОбластьМакета.Параметры.ДоОплаты = "До повернення"
			Иначе
				ОбластьМакета.Параметры.ДоОплаты = "До сплати"
			КонецЕсли;
			ОбластьМакета.Параметры.sum_topay = Формат(ПолучитьЗначениеСоответствия(printinfo, "sum_topay", ""), "ЧДЦ=2") + " грн."; 
			ТабДокумент.Вывести(ОбластьМакета);	

			Если ПараметрыЗакрытия.ПечатьПодвала = Истина Тогда	//	LNK 25.03.2022 10:19:48

				ОбластьМакета = Макет.ПолучитьОбласть("ПодвалИнфо|Тело");
				ОбластьМакета.Параметры.ТекстПодвала = Символы.ПС + СокрЛП(ПараметрыЗакрытия.ТекстПодвала);

				ТабДокумент.Вывести(ОбластьМакета);	

				ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));		

			КонецЕсли;

			ОбластьМакета = Макет.ПолучитьОбласть("ФНомер");
			ОбластьМакета.Параметры.fn = ПолучитьЗначениеСоответствия(printinfo, "fisn", ""); 
			ОбластьМакета.Параметры.dt = ПолучитьЗначениеСоответствия(printinfo, "dt", ""); 
			ТабДокумент.Вывести(ОбластьМакета);	
			
			Если ЗначениеЗаполнено(URL) Тогда

				РазмерQRВПискселях = 250;
				ДанныеQRКода = ПолучитьQRкод(URL, 0, РазмерQRВПискселях);
				
				Область = Макет.ПолучитьОбласть("Картинка"); 
				Рисунок = Область.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка); 
				
				Рисунок.Верх = 0; 
				Рисунок.Высота = 59; 
				Рисунок.Ширина = 59;         
				Рисунок.Лево = 8; 
				
				Рисунок.ГраницаСверху = Ложь;
				Рисунок.ГраницаСнизу = Ложь;
				Рисунок.ГраницаСлева = Ложь;
				Рисунок.ГраницаСправа = Ложь;
				
				
				Рисунок.Картинка = Новый Картинка(ДанныеQRКода);
				
				ТабДокумент.АвтоМасштаб = Истина;
				ТабДокумент.ОтображатьСетку = Ложь;
				
				ТабДокумент.Вывести(Область);

			Иначе

				ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));		

			КонецЕсли;

			ОбластьМакета = Макет.ПолучитьОбласть("Подвал2");
			//ОбластьМакета.Параметры.isOffline = Формат(ПолучитьЗначениеСоответствия(printinfo, "isOffline", ""),"ЧДЦ=2"); 
			ОбластьМакета.Параметры.Онлайн =  ?(НЕ ПолучитьЗначениеСоответствия(printinfo, "isOffline", ""),"Онлайн","Офлайн"); 		
			//ОбластьМакета.Параметры.mac = ПолучитьЗначениеСоответствия(printinfo, "mac", ""); 
			ОбластьМакета.Параметры.fisid = СтрЗаменить(ПолучитьЗначениеСоответствия(printinfo, "fisid", ""),Символы.НПП,"");
			ТекстЗаголовка = "ФН " + ОбластьМакета.Параметры.fisid;
			
			Если ЭтоВозврат Тогда
				ОбластьМакета.Параметры.Чек = "ВИДАТКОВИЙ ЧЕК"
			Иначе
				ОбластьМакета.Параметры.Чек = "ФІСКАЛЬНИЙ ЧЕК"
			КонецЕсли;

			ОбластьМакета.Параметры.manuf = ПолучитьЗначениеСоответствия(printinfo, "manuf", ""); 
			ТабДокумент.Вывести(ОбластьМакета);	

		КонецЕсли;

	Иначе 

		Сообщить("Документ не фискализирован, печать невозможна");
		
	КонецЕсли;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьЧека()

//	LNK 08.04.2022 07:32:37
Функция ПолучитьТабличныйДокументОтчет(НаименованиеОтчета, сИнфо)	Экспорт

	Макет = ПолучитьОбщийМакет("ПРРО_ШаблонЧекаDeviceManagerФискальныйРегистратор");
//	Макет = ПолучитьМакет("ПРРО_ШаблонЧекаDeviceManagerФискальныйРегистратор");
	ТабличныйДокумент = Новый ТабличныйДокумент;

	printinfo = ПолучитьЗначениеСоответствия(сИнфо, "printheader", Новый Соответствие);
	taxes	  = ПолучитьЗначениеСоответствия(сИнфо, "taxes", "");
	pays	  = ПолучитьЗначениеСоответствия(сИнфо, "pays", "");
	money	  = ПолучитьЗначениеСоответствия(сИнфо, "money", "");

	Область = Макет.ПолучитьОбласть("Шапка|Тело");
	Область.Параметры.name		= НаименованиеОтчета
					+ Символы.ПС + ОбщегоНазначенияКлиентСервер.REPEAT("-", 62)
					+ Символы.ПС + ПолучитьЗначениеСоответствия(printinfo, "name", ""); 
	Область.Параметры.fis_code	= ПолучитьЗначениеСоответствия(printinfo, "fis_code", ""); 
	Область.Параметры.shopad	= ПолучитьЗначениеСоответствия(printinfo, "shopad", ""); 
	Область.Параметры.shopname	= ПолучитьЗначениеСоответствия(printinfo, "shopname", ""); 
	Область.Параметры.vat_code	= ПолучитьЗначениеСоответствия(printinfo, "vat_code", ""); 
	Область.Параметры.fisid = СтрЗаменить(ПолучитьЗначениеСоответствия(printinfo, "fisid", ""),Символы.НПП,""); 
	//"fisid"
	
	ТабличныйДокумент.Вывести(Область);
	
	Если НЕ money.Количество() = 0 Тогда

		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Пробел|Тело"));		

		Область = Макет.ПолучитьОбласть("О_Текст|Тело");
		Область.Параметры.Комментарий = ОбщегоНазначенияКлиентСервер.PAD("------Внесення\винесення:", 55, Ложь, "-");
		ТабличныйДокумент.Вывести(Область);

		Область = Макет.ПолучитьОбласть("Оплата|Тело");

		Для каждого СтрокаОплат ИЗ money Цикл

			sum_p = Формат(ПолучитьЗначениеСоответствия(СтрокаОплат, "sum_p", 0), "ЧДЦ=2; ЧН=0.00");
			sum_m = Формат(ПолучитьЗначениеСоответствия(СтрокаОплат, "sum_m", 0), "ЧДЦ=2; ЧН=0.00");

			Если ЗначениеЗаполнено(sum_p) Тогда

				Область.Параметры.type = "Внесення";
				Область.Параметры.sum  = sum_p;
				ТабличныйДокумент.Вывести(Область);

			КонецЕсли;

			Если ЗначениеЗаполнено(sum_m) Тогда

				Область.Параметры.type = "Винесення";
				Область.Параметры.sum  = sum_m;
				ТабличныйДокумент.Вывести(Область);

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

	Если НЕ pays.Количество() = 0 Тогда

		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Пробел|Тело"));		

		Область = Макет.ПолучитьОбласть("О_Текст|Тело");
		Область.Параметры.Комментарий = ОбщегоНазначенияКлиентСервер.PAD("------Оплати:", 60, Ложь, "-");
		ТабличныйДокумент.Вывести(Область);

		Область = Макет.ПолучитьОбласть("Оплата|Тело");

		Для каждого СтрокаОплат ИЗ pays Цикл

			sum_p = Формат(ПолучитьЗначениеСоответствия(СтрокаОплат, "sum_p", ""), "ЧДЦ=2; ЧН=0.00");
			sum_m = Формат(ПолучитьЗначениеСоответствия(СтрокаОплат, "sum_m", ""), "ЧДЦ=2; ЧН=0.00");

			Если ЗначениеЗаполнено(sum_p) Тогда

				Область.Параметры.type = "Cума продажів: " + ПолучитьЗначениеСоответствия(СтрокаОплат, "name", "");
				Область.Параметры.sum  = sum_p;
				ТабличныйДокумент.Вывести(Область);

			КонецЕсли;
			
			Если ЗначениеЗаполнено(sum_m) Тогда

				Область.Параметры.type = "Cума повернення: " + ПолучитьЗначениеСоответствия(СтрокаОплат, "name", "");
				Область.Параметры.sum  = sum_m;
				ТабличныйДокумент.Вывести(Область);

			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;

	Если НЕ taxes.Количество() = 0 Тогда

		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Пробел|Тело"));		

		Область = Макет.ПолучитьОбласть("О_Текст|Тело");
		Область.Параметры.Комментарий = ОбщегоНазначенияКлиентСервер.PAD("------Податки:", 60, Ложь, "-");
		ТабличныйДокумент.Вывести(Область);

		Область = Макет.ПолучитьОбласть("Оплата|Тело");

		Для каждого СтрокаНалогов ИЗ taxes Цикл

			base_sum_p = Формат(ПолучитьЗначениеСоответствия(СтрокаНалогов, "base_sum_p", ""), "ЧДЦ=2; ЧН=0.00");  
			tax_sum	   = Формат(ПолучитьЗначениеСоответствия(СтрокаНалогов, "tax_sum_p" , ""), "ЧДЦ=2; ЧН=0.00");  

			Если ЗначениеЗаполнено(base_sum_p) Тогда

				Область.Параметры.type = "Cума продажів:";
				Область.Параметры.sum  = Формат(base_sum_p, "ЧДЦ=2; ЧН=0.00");
				ТабличныйДокумент.Вывести(Область);

				Область.Параметры.type = "Cума податку (" + ПолучитьЗначениеСоответствия(СтрокаНалогов, "tax_fname", "") + ")";
				Область.Параметры.sum  = Формат(tax_sum, "ЧДЦ=2; ЧН=0.00");
				ТабличныйДокумент.Вывести(Область);

			КонецЕсли;
			
			base_sum_m = Формат(ПолучитьЗначениеСоответствия(СтрокаНалогов, "base_sum_m", ""), "ЧДЦ=2; ЧН=0.00");  
			tax_sum	   = Формат(ПолучитьЗначениеСоответствия(СтрокаНалогов, "tax_sum_m" , ""), "ЧДЦ=2; ЧН=0.00");  

			Если ЗначениеЗаполнено(base_sum_m) Тогда

				Область.Параметры.type = "Cума повернення:";
				Область.Параметры.sum  = Формат(base_sum_m, "ЧДЦ=2; ЧН=0.00");
				ТабличныйДокумент.Вывести(Область);

				Область.Параметры.type = "Cума податку (" + ПолучитьЗначениеСоответствия(СтрокаНалогов, "tax_name", "") + ")";
				Область.Параметры.sum  = Формат(tax_sum, "ЧДЦ=2; ЧН=0.00");
				ТабличныйДокумент.Вывести(Область);

			КонецЕсли;

			ex_sum = ПолучитьЗначениеСоответствия(СтрокаНалогов, "ex_sum_p", "");

			Если ЗначениеЗаполнено(ex_sum) Тогда				

				Область.Параметры.type = "Cума:";
				Область.Параметры.sum  = Формат(base_sum_p, "ЧДЦ=2; ЧН=0.00");
				ТабличныйДокумент.Вывести(Область);

				Область.Параметры.type = "Cума податку (" + ПолучитьЗначениеСоответствия(СтрокаНалогов, "ex_name", "") + ")";
				Область.Параметры.sum  = Формат(ex_sum, "ЧДЦ=2; ЧН=0.00");
				ТабличныйДокумент.Вывести(Область);

			КонецЕсли		

		КонецЦикла;

	КонецЕсли;

	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Пробел|Тело"));		

	Область = Макет.ПолучитьОбласть("О_Текст|Тело");
	Область.Параметры.Комментарий = ОбщегоНазначенияКлиентСервер.PAD("------Сейф:", 61, Ложь, "-");
	ТабличныйДокумент.Вывести(Область);

	Область = Макет.ПолучитьОбласть("Оплата|Тело");

	safe = ПолучитьЗначениеСоответствия(сИнфо, "safe", 0);

	Область.Параметры.type = "Залишок у каcі:";
	Область.Параметры.sum  = Формат(safe, "ЧДЦ=2; ЧН=0.00");
	ТабличныйДокумент.Вывести(Область);
	
	КодОтчета	= ПолучитьЗначениеСоответствия(сИнфо, "doccode", "");
	НомерОтчета	= ПолучитьЗначениеСоответствия(сИнфо, "docno", "");
	ДатаОтчета	= ПолучитьЗначениеСоответствия(сИнфо, "dt", "");

	Область = Макет.ПолучитьОбласть("О_Текст|Тело");
	Область.Параметры.Комментарий = ДатаОтчета;
	ТабличныйДокумент.Вывести(Область);

	Если ЗначениеЗаполнено(КодОтчета) Тогда

		Область.Параметры.Комментарий = "No." + НомерОтчета + "; Код: " + КодОтчета;
		ТабличныйДокумент.Вывести(Область);

	КонецЕсли;

	Возврат ТабличныйДокумент;

КонецФункции

Функция ПолучитьЗначениеСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Значение = Соответствие.Получить(Ключ);
	Если Значение = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Возврат Значение;
КонецФункции


Функция РасшифроватьJSON(jsonString) Экспорт
	__jsonString = strReplace(jsonString, Символ(65279), "");
	jsonReader = new JSONReader;
	jsonReader.УстановитьСтроку(__jsonString);
	Возврат readJSON(jsonReader, true);
КонецФункции

Функция ПолучитьУИДЧека(Ссылка) Экспорт

	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМ") Тогда

		Возврат Ссылка.Номер + "-" + Ссылка.УникальныйИдентификатор();

	КонецЕсли;

	Возврат Новый УникальныйИдентификатор;

КонецФункции

//	LNK 19.02.2022 06:07:25
//	Используется при формировании данных для ФР
Функция ПолучитьПараметрТипыОплаты(Идентификатор)	Экспорт

	ПараметрыУстройства = МенеджерОборудованияСервер.ПолучитьПараметрыУстройства(Идентификатор);

	Если НЕ ТипЗнч(ПараметрыУстройства) = Тип("Структура")	Тогда

		ПараметрыУстройства = Новый Структура;

	КонецЕсли;

	Если НЕ ПараметрыУстройства.Свойство("ТаблицаТиповОплат") Тогда

		МассивТипыОплат = Новый Массив;
		МассивТипыОплат.Добавить(ОбщегоНазначенияКлиентСервер.AAD(0, Перечисления.ТипыОплатЧекаККМ.Наличные));
		МассивТипыОплат.Добавить(ОбщегоНазначенияКлиентСервер.AAD(1, Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта));
		МассивТипыОплат.Добавить(ОбщегоНазначенияКлиентСервер.AAD(2, Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта));
		МассивТипыОплат.Добавить(ОбщегоНазначенияКлиентСервер.AAD(3, Перечисления.ТипыОплатЧекаККМ.Предоплата));
		МассивТипыОплат.Добавить(ОбщегоНазначенияКлиентСервер.AAD(4, Перечисления.ТипыОплатЧекаККМ.Послеплата));
		МассивТипыОплат.Добавить(ОбщегоНазначенияКлиентСервер.AAD(5, Перечисления.ТипыОплатЧекаККМ.БанковскийКредит));
		МассивТипыОплат.Добавить(ОбщегоНазначенияКлиентСервер.AAD(6, Перечисления.ТипыОплатЧекаККМ.ПодарочныйСертификат));

		ПараметрыУстройства.Вставить("ТаблицаТиповОплат", МассивТипыОплат);

	КонецЕсли;

	ПараметрТипыОплат = Новый Массив;
//	Порядок элементов имеет значение!

	Для каждого ЭлементМассива Из ПараметрыУстройства.ТаблицаТиповОплат Цикл

		ПараметрТипыОплат.Добавить(Новый Структура(
			"ID, ТипОплаты"
			, ЭлементМассива[0], ЭлементМассива[1]
			)
		);

	КонецЦикла;

	Возврат ПараметрТипыОплат;

КонецФункции

//	LNK 25.03.2022 10:30:43
Процедура ОтправитьУведомлениеПокупателю(НомерТелефона, Контрагент, ДанныеПротокола, ВидСообщения, ИмяКомпьютера = "", СообщитьОбОшибке = Ложь)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Подключение = СервисыСервер.Подключение("RetailPack", СервисыСервер.Таймаут("RetailPack.SendSMS.Timeout"));

	ДанныеОтправителя = ОбщегоНазначенияКлиентСервер.СериализоватьJSON(
		Новый Структура(
			"ЭлементСтруктуры, Магазин, ИмяКомпьютера, Контрагент, Пользователь, ДанныеПротокола"
			, ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ЭлементСтруктуры
			, ПараметрыСеанса.ТекущийМагазин
			, ИмяКомпьютера
			, Контрагент
			, ПараметрыСеанса.ТекущийПользователь
			, ДанныеПротокола	//	специфика РегистрыСведений.ПротоколСообщений
		)
	);

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Подключение.SendSMS(ОбщегоНазначенияКлиентСервер.РеквизитПеречисления(ВидСообщения)
			, ОтправкаSMS.ПодготовитьНомерТелефона(НомерТелефона)
			, ДанныеПротокола.URL
			, Ложь
			, ДанныеОтправителя
		)
	);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();

	Если Результат.Ошибка И СообщитьОбОшибке Тогда

		Сообщить(Результат.ОписаниеОшибки);

	КонецЕсли;

КонецПроцедуры

//	LNK 25.12.2022 06:07:01
Функция ПолучитьДанныеЧека(ДокументСсылка)	Экспорт

	//ДанныеПротокола = Новый Структура(
	//	"Объект, URL, ДанныеPDF"
	//	, ПараметрыЗакрытия.Объект
	//	, URL
	//	, ПотокБуффер.ЗакрытьИПолучитьДвоичныеДанные()
	//);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаПротокола.Контрагент КАК Контрагент,
	|	ТаблицаПротокола.ВидСообщения КАК ВидСообщения,
	|	ТаблицаПротокола.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ПротоколСообщений КАК ТаблицаПротокола
	|ГДЕ
	|	ТаблицаПротокола.Объект = &ДокументСсылка"
	);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл


	КонецЦикла;

	Возврат Новый Структура;

КонецФункции

















