//	LNK 13.03.2017 07:56:41
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Отправитель = Неопределено Тогда

		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

			ЗаписьНабора.ДатаИзменения = ТекущаяДата();

		КонецЦикла;

	КонецЕсли;

//	LNK 13.03.2017 08:00:35
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.Свойство("РегистрацияПередачиВNavision") Тогда

		ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);

	КонецЕсли;

//	---------------------------------------------------------------------------------------


КонецПроцедуры
