#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.РекламныйМатериал КАК РекламныйМатериал,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.РекламнаяПлоскость КАК РекламнаяПлоскость,
	|	СУММА(ОтгрузкаРекламныхМатериаловРекламныеМатериалы.Количество) КАК Количество,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Магазин КАК Магазин,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.ДокументПриемки КАК ДокументПриемки,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Дата КАК Период,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.ДокументРаспоряжение КАК ДокументРаспоряжение
	|ИЗ
	|	Документ.ОтгрузкаРекламныхМатериалов.РекламныеМатериалы КАК ОтгрузкаРекламныхМатериаловРекламныеМатериалы
	|ГДЕ
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.РекламнаяПлоскость,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.РекламныйМатериал,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Организация,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Магазин,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Дата,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.ДокументПриемки,
	|	ОтгрузкаРекламныхМатериаловРекламныеМатериалы.ДокументРаспоряжение"
	);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Результаты = Запрос.ВыполнитьПакет();

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРекламныеМатериалыКОтгрузке", Результаты[0].Выгрузить());

КонецПроцедуры

#КонецОбласти

#КонецЕсли


