#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);

	УстановитьМагазинУзла(Магазин, Параметры);	//	LNK 26.11.2022 06:31:33

	УстановитьОрганизацию();
	УстановитьОтборДинамическихСписков();
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

//	LNK 26.04.2017 08:26:42
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПользовательИзменилТекущуюОрганизацию" Тогда

		Если НЕ Организация = Параметр.Организация Тогда

			Организация = Параметр.Организация;
			Магазин     = Параметр.Магазин;

			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Владелец", Организация, ЗначениеЗаполнено(Организация));
			ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Магазин", Магазин, ЗначениеЗаполнено(Магазин));

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	УстановитьМагазинУзла(Магазин, Параметры);	//	LNK 26.11.2022 06:31:33
	Настройки.Вставить("Магазин", Магазин);		//	LNK 26.11.2022 06:45:09

	УстановитьОрганизацию();
	УстановитьОтборДинамическихСписков();
	ОбновитьЭлементыФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ИменаКолонок = Новый Массив;
	ИменаКолонок.Добавить("Магазин");
	ИменаКолонок.Добавить("ПодключаемоеОборудование");

	РаботаСФормамиКлиент.ОбработчикСобытияСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ИменаКолонок,, Элементы);

КонецПроцедуры

#КонецОбласти
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте	//	LNK 16.11.2023 13:55:05
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	УстановитьОтборДинамическихСписков()
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборМагазинПриИзменении(Элемент)
	
	УстановитьОтборДинамическихСписков()
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбновитьЭлементыФормы()

	Перем МассивВсехРеквизитов, МассивРеквизитов, ДополнительныеСкрываемыеЭлементы;

	Параметры.Свойство("ДополнительныеСкрываемыеЭлементы", ДополнительныеСкрываемыеЭлементы);
	
	Справочники.КассыККМ.ПолучитьМассивыРеквизитовЗависимыхОтКассыУправляющейСистемы(
		Список,
		МассивВсехРеквизитов,
		МассивРеквизитов,
		ДополнительныеСкрываемыеЭлементы);
		
	ДенежныеСредстваСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы,
		МассивВсехРеквизитов,
		МассивРеквизитов
	);

КонецПроцедуры

// Процедура устанавливает организацию в форме по данным переданного отбора.
//
&НаСервере
Процедура УстановитьОрганизацию()
	
	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Если Параметры.Свойство("Отбор")
		   И Параметры.Отбор.Свойство("Владелец") Тогда

			Организация = Параметры.Отбор.Владелец;

		КонецЕсли;

	Иначе	Организация = ПараметрыСеанса.ТекущаяОрганизация;

	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервереБезКонтекста	//	LNK 26.11.2022 06:31:38
Процедура УстановитьМагазинУзла(Магазин, Параметры)

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Если Параметры.Свойство("Отбор")
			И Параметры.Отбор.Свойство("Магазин") Тогда

			Магазин = Параметры.Отбор.Магазин;

		КонецЕсли;

	Иначе	Магазин = ПараметрыСеанса.ТекущийМагазин;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция МассивДинамическихСписковДляУстановкиОтбора()

	МассивСписков = Новый Массив;
	МассивСписков.Добавить(Список);
	
	Возврат МассивСписков;

КонецФункции

&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	Для Каждого ДинамическийСписок Из МассивДинамическихСписковДляУстановкиОтбора() Цикл
		
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок, "Владелец", Организация, ЗначениеЗаполнено(Организация), ВидСравненияКомпоновкиДанных.Равно);
		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(ДинамическийСписок, "Магазин", Магазин , ЗначениеЗаполнено(Магазин), ВидСравненияКомпоновкиДанных.Равно);
		
	КонецЦикла;
	
КонецПроцедуры



















