#Область ОбработчикиСобытийФормы

&НаСервере	//	LNK 25.03.2022 07:56:21
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	Параметры.Свойство("ТекстЗаголовка"		, Заголовок);
	Параметры.Свойство("ТабличныйДокумент"	, ТабличныйДокумент);

КонецПроцедуры

&НаКлиенте	//	LNK 25.03.2022 07:56:21
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

#КонецОбласти