
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КодСекрет = Параметры.КодПодтверждения;
	
КонецПроцедуры

&НаКлиенте
Процедура КодПодтвержденияПриИзменении(Элемент)
	Если ПроверитьКодНаСервере(КодПодтверждения) Тогда
		ЭтаФорма.Закрыть(Новый Структура("Успешно",Истина));
	Иначе
		Элементы.Информация.Заголовок = "Код подтверждения не верный!";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьКодНаСервере(КодПодтверждения)
	Возврат КодПодтверждения = КодСекрет;
КонецФункции