#Область ОбработчикиОсновныхСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	Если Параметры.Свойство("Заголовок") Тогда

		Заголовок = Параметры.Заголовок;

	КонецЕсли;

	Если Параметры.Свойство("Приглашение") Тогда

		Элементы.ВводимоеЗначение.Заголовок = Параметры.Приглашение;

	КонецЕсли;

	Если Параметры.Свойство("ВводимоеЗначение") Тогда

		ВводимоеЗначение = Параметры.ВводимоеЗначение;

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти

&НаКлиенте
Процедура ПринятьЗначение(Команда)

	Закрыть(?(ПустаяСтрока(ВводимоеЗначение), Ложь, СокрЛП(ВводимоеЗначение)));

КонецПроцедуры



