//	LNK 14.09.2018 14:04:25
Функция ПолучитьУзел_TSD_DEPOT()	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ТранспортТерминалов.Ссылка, Ведущая.ТекущийУзел) КАК ТекущийУзел
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(ПланОбмена.ТранспортТерминалов.ПустаяСсылка) КАК ТекущийУзел,
	|		0 КАК НомерСообщения) КАК Ведущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.ТранспортТерминалов КАК ТранспортТерминалов
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ ТранспортТерминалов.ЭтотУзел"
	);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Возврат Выборка.ТекущийУзел;

КонецФункции // ПолучитьУзел_TSD_DEPOT()

//	LNK 14.09.2018 14:04:29
Функция ПолучитьДанныеУзла(УзелИнформационнойБазы)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	""ТранспортТерминалов"" КАК Имя,
	|	ТаблицаУзлов.Ссылка КАК Узел,
	|	ТаблицаУзлов.Код КАК Код,
	|	ТаблицаУзлов.Наименование КАК Наименование,
	|	ТаблицаУзлов.ПометкаУдаления КАК ПометкаУдаления,
	|	ТаблицаУзлов.НомерОтправленного КАК НомерОтправленного,
	|	ТаблицаУзлов.НомерПринятого КАК НомерПринятого
	|ИЗ
	|	ПланОбмена.ПоМагазину КАК ТаблицаУзлов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураУзлов КАК ТаблицаСтруктуры
	|		ПО ТаблицаУзлов.Код = ТаблицаСтруктуры.Код
	|ГДЕ
	|	ТаблицаУзлов.Ссылка = &ТекущийУзел"
	);
	Запрос.УстановитьПараметр("ТекущийУзел", УзелИнформационнойБазы);

	Результат = Запрос.Выполнить();

	ДанныеУзла = Новый Структура;

	Для каждого Колонка Из Результат.Колонки Цикл

		ДанныеУзла.Вставить(Колонка.Имя, Колонка.ТипЗначения.ПривестиЗначение());

	КонецЦикла;

	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда

		ЗаполнитьЗначенияСвойств(ДанныеУзла, Выборка);

		Для каждого Колонка Из Результат.Колонки Цикл

			Если Колонка.ТипЗначения.СодержитТип(Тип("РезультатЗапроса")) Тогда

				ДанныеУзла[Колонка.Имя] = Выборка[Колонка.Имя].Выгрузить();

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	
	Возврат ДанныеУзла;

КонецФункции // ПолучитьДанныеУзла()
