
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПолеПоступлениеТоваров = Новый ПолеКомпоновкиДанных("ПоступлениеТоваров");
	
	ПараметрПоступлениеТоваров = КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы.Найти(ПолеПоступлениеТоваров);
	
	Если ПараметрПоступлениеТоваров <> Неопределено И ЗначениеЗаполнено(ПараметрПоступлениеТоваров.Значение) Тогда
		ОбщегоНазначенияРТСервер.ВывестиОснованиеОтчета(ДокументРезультат, ПараметрПоступлениеТоваров.Значение);
	Иначе
		ОбщегоНазначенияРТСервер.ВывестиДатуФормированияОтчета(ДокументРезультат);
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
