
Процедура ПриЗаписи(Отказ, Замещение)
	
//	LNK 10.08.2017 06:50:52
	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

//	Попытка	
//		СделатьЗаписьВДатаИзмененияСегментов(ЭтотОбъект.Отбор.Сегмент.Значение,ЭтотОбъект.Отбор.Номенклатура.Значение);
//Исключение
//	
//КонецПопытки
	
КонецПроцедуры


Процедура СделатьЗаписьВДатаИзмененияСегментов(Сегмент,Номенклатура);
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействиеСкидокНаценок.Магазин
		|ИЗ
		|	РегистрСведений.ДействиеСкидокНаценок КАК ДействиеСкидокНаценок
		|ГДЕ
		|	ДействиеСкидокНаценок.СкидкаНаценка.СегментНоменклатурыПредоставления = &СегментНоменклатурыПредоставления
		|	И СкидкаНаценка.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И (ДействиеСкидокНаценок.Период <= &КонецДня
		|			ИЛИ ДействиеСкидокНаценок.ДатаОкончания >= &НачалоДня)";
	
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("СегментНоменклатурыПредоставления", Сегмент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ДатаИзмененияСегментов.СоздатьНаборЗаписей(); 

		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Отбор.Магазин.Установить(ВыборкаДетальныеЗаписи.Магазин);

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Магазин = ВыборкаДетальныеЗаписи.Магазин;
		НоваяЗапись.Номенклатура = Номенклатура;
		НоваяЗапись.Дата = ТекущаяДатаСеанса(); 

		НаборЗаписей.Записать();	
	КонецЦикла;
	
	
	
	
КонецПроцедуры
