
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)   
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(ПараметрКоманды);
	
	МассивНепроведенныхДокументов = ФормированиеПечатныхФормСервер.ПолучитьМассивНепроведенныхДокументов(МассивДокументов);
	
	Если МассивНепроведенныхДокументов.Количество() > 0 Тогда

		Если МассивНепроведенныхДокументов.Количество() = 1 Тогда
			ТекстВопроса = НСтр("ru = 'Печать возможна только после проведения документа, провести документ?'")
		Иначе
			ТекстВопроса = НСтр("ru = 'Печать возможна только после проведения документов, провести документы?'")
		КонецЕсли;

		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			МассивНепроведенныхДокументов = ФормированиеПечатныхФормСервер.ПровестиДокументы(МассивНепроведенныхДокументов);
		КонецЕсли;

	КонецЕсли;

	Если МассивНепроведенныхДокументов.Количество() = 0 Тогда

		МассивСертификатов = СформироватьСертификаты(ПараметрКоманды);	

	КонецЕсли; 
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок = "Выберите папку для сохранения сертификатов";
	
	Если МассивСертификатов.Количество() > 0 Тогда 
		
		Если ДиалогВыбора.Выбрать() Тогда
			КаталогСохранения = ДиалогВыбора.Каталог;
			
			Для Каждого Эл Из МассивСертификатов Цикл
				
				ИмяФайла = Эл.ИмяФайла + ".pdf"; 
				АдресХранилища = Эл.АдресХранилища;
				
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
				
				ПолныйПутьКФайлу = КаталогСохранения + "\" + ИмяФайла;
				
				ДвоичныеДанные.Записать(ПолныйПутьКФайлу);
				
			КонецЦикла;
			
			ПоказатьПредупреждение(, "Файлы успешно сохранены в каталог: " + КаталогСохранения);   
			
		КонецЕсли;	
		
	КонецЕсли;			
	
КонецПроцедуры 

&НаСервере
Функция СформироватьСертификаты(ПараметрКоманды) Экспорт   
		
	Возврат Документы.РеализацияТоваров.СформироватьСертификаты(ПараметрКоманды);
	
КонецФункции	


