&НаСервере	//	LNK 12.12.2019 12:01:49
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;
	
	ЭтотОбъект().Журнал(ИмяФормы + ".ПриСозданииНаСервере");	//	LNK 02.08.2019 10:56:00

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаСервере	//	LNK 16.07.2019 11:09:02
Функция ЭтотОбъект(ТекущийОбъект = Неопределено) 

	Если ТекущийОбъект = Неопределено Тогда

		Возврат РеквизитФормыВЗначение("Объект");

	КонецЕсли;

	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");

	Возврат Неопределено;

КонецФункции

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаСервере
Процедура РесурсMicrosoftDynamicsПриИзмененииНаСервере(Доступен)

	ОбменMicrosoftDynamicsСервер.ИзменитьДоступностьMicrosoftDynamics(Доступен, Истина);

КонецПроцедуры

&НаКлиенте
Процедура РесурсMicrosoftDynamicsПриИзменении(Элемент)

	РесурсMicrosoftDynamicsПриИзмененииНаСервере(РесурсMicrosoftDynamics = 1);

	УстановитьОформлениеЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОформлениеЭлементов()

	Если РесурсMicrosoftDynamicsДоступен() Тогда

			РесурсMicrosoftDynamics = 1;

	Иначе	РесурсMicrosoftDynamics = 0;
	
	КонецЕсли;

	Элементы.РесурсMicrosoftDynamics.Доступность = (Пароль = УправлениеДоступомВызовСервера.ВременныйПароль());

КонецПроцедуры

&НаСервереБезКонтекста
Функция РесурсMicrosoftDynamicsДоступен()

	Возврат Константы.РесурсMicrosoftDynamicsДоступен.Получить();

КонецФункции






