////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбменДаннымиСервер.ФормаНастройкиУзловПриСозданииНаСервере(ЭтотОбъект, Отказ);
	
	// Задание значений по умолчанию
	Если НЕ ЗначениеЗаполнено(ДатаНачалаВыгрузкиДокументов) Тогда
		ДатаНачалаВыгрузкиДокументов = НачалоГода(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РежимВыгрузкиПриНеобходимости) Тогда
		РежимВыгрузкиПриНеобходимости = Перечисления.РежимыВыгрузкиОбъектовОбмена.ВыгружатьПриНеобходимости;
	КонецЕсли;
	
	ПолучитьОписаниеКонтекста();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ИспользоватьОтборПоВидамЦен		= Не ОбменДаннымиКлиент.ВТаблицеОтмеченыВсеЭлементы(ВидыЦен);
	ИспользоватьОтборПоОрганизациям	= Не ОбменДаннымиКлиент.ВТаблицеОтмеченыВсеЭлементы(Организации);
	ИспользоватьОтборПоКассам       = Не ОбменДаннымиКлиент.ВТаблицеОтмеченыВсеЭлементы(Кассы);
	
	ПолучитьОписаниеКонтекста();
	
	ОбменДаннымиКлиент.ФормаНастройкиУзловКомандаЗакрытьФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеМагазины(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Истина, "Магазины");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеМагазины(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Ложь, "Магазины");
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеВидыЦен(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Истина, "ВидыЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеВидыЦен(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Ложь, "ВидыЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеОрганизации(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Истина, "Организации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеОрганизации(Команда)
	
	
	ВключитьОтключитьВсеЭлементыВТаблице(Ложь, "Организации");
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеКассы(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Истина, "Кассы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеКассы(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Ложь, "Кассы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПолучитьОписаниеКонтекста()
	// дата начала выгрузки документов
	Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиДокументов) Тогда
		ДатаНачалаВыгрузкиДокументовОписание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Данные будут синхронизироваться, начиная с %1'"),
			Формат(ДатаНачалаВыгрузкиДокументов, "ДЛФ=DD")
		);
	Иначе
		ДатаНачалаВыгрузкиДокументовОписание = НСтр("ru = 'Данные будут синхронизироваться за весь период ведения учета в программах'");
	КонецЕсли;
	
	Если ВыгружатьСебестоимость Тогда
		ВыгружатьСебестоимостьОписание = НСтр("ru = 'Выгрузка себестоимости: включено'");
	Иначе
		ВыгружатьСебестоимостьОписание = НСтр("ru = 'Выгрузка себестоимости: выключено'");
	КонецЕсли;	
	
	// отбор по Организациям
	Если ИспользоватьОтборПоОрганизациям Тогда
		ОрганизацииОписание = НСтр("ru = 'Только по организациям:'") + Символы.ПС + ИспользуемыеЭлементы("Организации");
	Иначе
		ОрганизацииОписание = НСтр("ru = 'По всем организациям.'");
	КонецЕсли;
	
	// отбор по Кассам
	Если ИспользоватьОтборПоКассам Тогда
		КассыОписание = НСтр("ru = 'Только по кассам:'") + Символы.ПС + ИспользуемыеЭлементы("Кассы");
	Иначе
		КассыОписание = НСтр("ru = 'По всем кассам.'");
	КонецЕсли;
	
	// отбор по Видам цен
	Если ИспользоватьОтборПоВидамЦен Тогда
		ВидыЦенОписание = НСтр("ru = 'Только по видам цен:'") + Символы.ПС + ИспользуемыеЭлементы("ВидыЦен");
	Иначе
		ВидыЦенОписание = НСтр("ru = 'По всем видам цен.'");
	КонецЕсли;
	
	// отбор по Магазинам
	//Если ИспользоватьОтборПоСкладам Тогда
	//	МагазиныОписание = НСтр("ru = 'Только по розничным магазинам:'") + Символы.ПС + ИспользуемыеЭлементы("Магазины");
	//Иначе
	//	МагазиныОписание = НСтр("ru = 'По всем розничным магазинам.'");
	//КонецЕсли;
	
	ОписаниеКонтекста = (""
		+ ДатаНачалаВыгрузкиДокументовОписание
		+ Символы.ПС
		+ Символы.ПС
		+ ОрганизацииОписание
		+ Символы.ПС
		+ Символы.ПС
		+ КассыОписание
		+ Символы.ПС
		+ Символы.ПС
		+ ВидыЦенОписание
		+ Символы.ПС
		+ Символы.ПС
		//+ МагазиныОписание
	);
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтключитьВсеЭлементыВТаблице(Включить, ИмяТаблицы)
	
	Для Каждого ЭлементКоллекции Из ЭтотОбъект[ИмяТаблицы] Цикл
		
		ЭлементКоллекции.Использовать = Включить;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИспользуемыеЭлементы(ИмяТаблицы)
	
	Возврат СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(
			ЭтотОбъект[ИмяТаблицы].Выгрузить(Новый Структура("Использовать", Истина)).ВыгрузитьКолонку("Представление"),
			Символы.ПС
	);
	
КонецФункции
