
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ТекДата", НачалоДня(ТекущаяДата()));
КонецПроцедуры

&НаКлиенте
Процедура НачатьРаботу(Команда)
	Если Не Элементы.Список.ТекущаяСтрока = Неопределено Тогда 
		ЗаказыПокупателейСервер.СотрудникНаРаботе(Элементы.Список.ТекущаяСтрока, Истина);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьРаботу(Команда)
	Если Не Элементы.Список.ТекущаяСтрока = Неопределено Тогда 
		ЗаказыПокупателейСервер.СотрудникНаРаботе(Элементы.Список.ТекущаяСтрока, Ложь);
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры
