#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьВерсиюДанных(ОбъектСсылка)	Экспорт

	УстановитьПривилегированныйРежим(Истина);
	#Если _ Тогда
	ОбъектСсылка = Документы.ПеремещениеТоваров.ПустаяСсылка();
	#КонецЕсли

	ВерсияДанных = "";

	Попытка

		НекоторыйОбъект	= ОбъектСсылка.ПолучитьОбъект();
		ВерсияДанных	= НекоторыйОбъект.ВерсияДанных;

	Исключение

		ТекстОшибки  = ОписаниеОшибки();
		ВерсияДанных = "";

	КонецПопытки;

	Возврат ВерсияДанных;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
