#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьВерсиюДанных(ОбъектСсылка)	Экспорт

	УстановитьПривилегированныйРежим(Истина);
	#Если _ Тогда
	ОбъектСсылка = Документы.ПеремещениеТоваров.ПустаяСсылка();
	#КонецЕсли

	ВерсияДанных = "";

	Попытка

		НекоторыйОбъект	= ОбъектСсылка.ПолучитьОбъект();
		ВерсияДанных	= НекоторыйОбъект.ВерсияДанных;

	Исключение

		ТекстОшибки  = ОписаниеОшибки();
		ВерсияДанных = "";

	КонецПопытки;

	Возврат ВерсияДанных;

КонецФункции

//	LNK 27.01.2023 06:31:44
Функция ПолучитьУчтеноNavisionДляОснования(ДокументСсылка)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаДокументы.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ Фильтр
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокументы.ДокументОснование
	|ИЗ
	|	Документ.РасходныйОрдерНаТовары КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Ссылка = &ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРегистра.УчтеноNavision КАК УчтеноNavision
	|ИЗ
	|	РегистрСведений.ОбъектУчтенВNavision КАК ТаблицаРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Фильтр КАК Фильтр
	|		ПО ТаблицаРегистра.Объект = Фильтр.ДокументОснование
	|			И (ТаблицаРегистра.УчтеноNavision)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Фильтр"
	);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат НЕ РезультатЗапроса.Пустой();

КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
	
#КонецЕсли
