
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//	LNK 20.04.2017 10:37:06
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка ИЛИ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "СлужебныйРежимЗаписи", Ложь) = Истина Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "Организация");

		Если ЗначениеЗаполнено(Организация) И НЕ Организация = Владелец Тогда

			Владелец = Организация;
			Сообщить("Установлен новый владелец по магазину - «" + Владелец + "»");

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

//	LNK 20.04.2017 10:37:12
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка ИЛИ ОбщегоНазначенияКлиентСервер.ЗначениеКлючаСтруктуры(ДополнительныеСвойства, "СлужебныйРежимЗаписи", Ложь) = Истина Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("Владелец", Владелец);
		ДанныеЗаполнения.Свойство("Магазин", Магазин);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	КассаУправляющейСистемы = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитов;
	
	Справочники.Кассы.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		ЭтотОбъект,
		МассивВсехРеквизитов,
		МассивРеквизитов
	);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ОбщегоНазначенияРТКлиентСервер.ЗаполнитьМассивНепроверяемыхРеквизитов(
		МассивВсехРеквизитов,
		МассивРеквизитов,
		МассивНепроверяемыхРеквизитов
	);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры
