
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Если  Параметры.Отбор.Свойство("Номенклатура") Тогда
			
			Номенклатура = Параметры.Отбор.Номенклатура;
			Если Номенклатура = Неопределено 
				ИЛИ Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
				
				ТекстЗаголовка = НСтр("ru = 'Для элемента: ""%Номенклатура%"" комплектующие не задаются'");
				ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Номенклатура%", Строка(Номенклатура));
				АвтоЗаголовок = Ложь;
				Заголовок     = ТекстЗаголовка;
				Элементы.Список.ТолькоПросмотр = Истина;
				
			Иначе
				
				ТекстЗаголовка = НСтр("ru = 'Комплектующие (%Номенклатура%)'");
				ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Номенклатура%", Строка(Номенклатура));
				АвтоЗаголовок = Ложь;
				Заголовок     = ТекстЗаголовка;
				ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
					Список, 
					"Номенклатура", 
					Номенклатура, 
					ЗначениеЗаполнено(Номенклатура));
				
			КонецЕсли;
			
		Элементы.БыстрыеОтборы.Видимость = Ложь;
		
		КонецЕсли;
				
	КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборНоменклатураПриИзменении(Элемент)
	
	ПриИзмененииОтборНоменклатура();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработкаТабличнойЧастиТоварыКлиент.ВыбратьХарактеристикуНоменклатуры(ЭтотОбъект, Элемент, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОтборХарактеристикаПриИзменении(Элемент)
	
	УстановитьОтборДинамическогоСписка("Характеристика");
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьОтборДинамическогоСписка(ИмяРеквизита)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		ИмяРеквизита, 
		ЭтотОбъект[ИмяРеквизита], 
		ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита]));
		
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОтборНоменклатура()
	
	РезультатПроверки = Справочники.Номенклатура.ПроверитьПринадлежностьХарактеристикиИУпаковкиВладельцу(Номенклатура, Характеристика, Неопределено);

	Характеристика = РезультатПроверки.Характеристика;
	УстановитьОтборДинамическогоСписка("Характеристика");
	УстановитьОтборДинамическогоСписка("Номенклатура");
		
КонецПроцедуры
