///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если (Не Пользователи.РолиДоступны("ПрименениеЦенНоменклатуры") 
		И НЕ Пользователи.РолиДоступны("ЧтениеЦенНоменклатуры"))
		И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда
		
		ТекстОшибки = НСтр("ru='Нет прав на применение цен номенклатуры, чтение цен номенклатуры'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			,
			,
			Отказ);
			
	КонецЕсли;

КонецПроцедуры
