
&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПодготовитьСтруктуруВыбора());

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаШаблонов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресШаблоновВХранилище));
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаШаблоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(ПодготовитьСтруктуруВыбора());
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСтруктуруВыбора()
	
	ТекущиеДанные = Элементы.ТаблицаШаблонов.ТекущиеДанные;
	СтруктураВыбора = Новый Структура;
	СтруктураВыбора.Вставить("КодКарты", ТекущиеДанные.КодКарты);
	СтруктураВыбора.Вставить("НаименованиеШаблона", ТекущиеДанные.НаименованиеШаблона);
		
	Возврат СтруктураВыбора;
	
КонецФункции	

