&НаКлиенте	//	LNK 15.11.2022 10:27:46
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ДанныеВозврата = ВнешниеИсточники.СброситьКодИзменения(ПараметрКоманды);

	Если ДанныеВозврата.Выполнено = Истина Тогда

		ПоказатьОповещениеПользователя(
			  "Код зміни очищено!"
			,
			, ?(ПустаяСтрока(ДанныеВозврата.ТекстСообщения)
				, "Подробиці операції не уточнено"
				, "Подробиці операції:" + Символы.ПС + ДанныеВозврата.ТекстСообщения
			)
			, БиблиотекаКартинок.Информация32
		);

	ИначеЕсли НЕ ПустаяСтрока(ДанныеВозврата.ТекстСообщения) Тогда

		ПоказатьОповещениеПользователя(
			  "Дія не виконана!"
			,
			, ДанныеВозврата.ТекстСообщения
			, БиблиотекаКартинок.Предупреждение32
		);

	КонецЕсли;

КонецПроцедуры
