
&НаКлиенте	//	LNK 28.09.2018 10:25:39 
Функция КонтекстИмениФормы(Знач ИмяФормыПараметр, ИмяВнешнейОбработки)	Экспорт

	Если НЕ ПустаяСтрока(ИмяВнешнейОбработки) Тогда

		ИмяФормыПараметр = СтрЗаменить(ИмяФормыПараметр
			, "Обработка." + ИмяВнешнейОбработки
			, "ВнешняяОбработка." + ИмяВнешнейОбработки
		);

	КонецЕсли;

	Возврат ИмяФормыПараметр;

КонецФункции

//	LNK 08.03.2024 13:13:45
Функция ВходныеПараметрыПолучить(ДокументСсылка, ПараметрыВызова, ПараметрыКассыККМ, ВызовИзРМК)	Экспорт

	Возврат РМКСервер.ВходныеПараметрыПолучить(ДокументСсылка, ПараметрыВызова, ПараметрыКассыККМ, ВызовИзРМК);
//	LNK 30.03.2023 07:25:19 - Примечание:
//	"ПараметрыКассыККМ" - ВходныеПараметры[2][21]

КонецФункции
