////////////////////////////////////////////////////////////////////////////////
// Подсистема "Оповещение пользователей".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает пустую структуру настроек оповещения
//
//	Возврат: Структура - настройки оповещения
//
Функция ПолучитьСтруктуруНастроекОповещения() Экспорт
	
	Возврат ОповещенияПользователей.ПолучитьСтруктуруНастроекОповещения();
	
КонецФункции // ПолучитьСтруктуруНастроекОповещения()

// Выполняет оповещение пользователей
//
// Параметры:
//  Событие			 - ПеречислениеСсылка.ТипыСобытийОповещений - предопределенное событие оповещения 
//  СсылкаНаОбъект	 - ДокументСсылка - ссылка на объект, по которому проводим оповещение
//  НастройкиОповещения - Структура - данные для выполнения оповещения
//
Процедура ВыполнитьОповещениеПользователей(Событие, СсылкаНаОбъект = Неопределено, НастройкиОповещения) Экспорт
	
	ОповещенияПользователей.ВыполнитьОповещениеПользователей(Событие, СсылкаНаОбъект, НастройкиОповещения);
		
КонецПроцедуры // ВыполнитьОповещениеПользователей()

// Выполняет произвольное оповещение пользователей
//
// Параметры:
//  Получатель	 - СправочникСсылка.Пользователи - ссылка на пользователя, которому отправляем оповещение
//  НастройкиОповещения - Структура - данные для выполнения оповещения
//
Процедура ВыполнитьПроизвольноеОповещениеПользователей(Получатель, НастройкиОповещения) Экспорт
	
	ОповещенияПользователей.ВыполнитьПроизвольноеОповещениеПользователей(Получатель, НастройкиОповещения);
	
КонецПроцедуры // ВыполнитьПроизвольноеОповещениеПользователей()	

Функция ПолучитьВидКонтактнойИнформации(СпособОповещения) Экспорт 
	
	// підтримується лише КИ довідника Пользователи	
	Если СпособОповещения = Перечисления.СпособыОповещения.Email Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.EmailПользователя;
	ИначеЕсли СпособОповещения = Перечисления.СпособыОповещения.Email Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.TelegramПользователя;		
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

#КонецОбласти






