Процедура ЗакрытиеРезультатовИнвентаризации(ПриказНаИнвентаризацию, ВидДокумента)	Экспорт

	ПоказатьВопрос(
		Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЗаполнениеОбъектовКлиент
			, Новый Структура("Приказ, ВидДокумента", ПриказНаИнвентаризацию, ВидДокумента))
		, "Будут созданы (перезаполнены), записаны и проведены документы «" + ВидДокумента + "»!
		  |ВНИМАНИЕ: Существующие (лишние) документы будут помечены на удаление!
		  |Подтвердите Ваше решение", РежимДиалогаВопрос.ОКОтмена, 60
		, КодВозвратаДиалога.ОК, "Оприходования товаров", КодВозвратаДиалога.Отмена);

КонецПроцедуры

Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда

		ЗаполнениеОбъектов.ОформитьЗакрытиеИнвентаризацииПоПроектам(ДополнительныеПараметры.Приказ, ДополнительныеПараметры.ВидДокумента);

	КонецЕсли;

КонецПроцедуры
