Процедура ЗакрытиеРезультатовИнвентаризации(ПриказНаИнвентаризацию, ВидДокумента)	Экспорт

	ПоказатьВопрос(
		Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЗаполнениеОбъектовКлиент
			, Новый Структура("Приказ, ВидДокумента", ПриказНаИнвентаризацию, ВидДокумента))
		, "Будуть створені (перезаповнені), записані та проведені документи «" + ВидДокумента + "»!
		  |УВАГА: Існуючі (зайві) документи будуть позначені на видалення!
		  |Підтвердьте Ваше рішення", РежимДиалогаВопрос.ОКОтмена, 60
		, КодВозвратаДиалога.ОК, "Оприходования товаров", КодВозвратаДиалога.Отмена);

КонецПроцедуры

Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда

		ЗаполнениеОбъектов.ОформитьЗакрытиеИнвентаризацииПоПроектам(ДополнительныеПараметры.Приказ, ДополнительныеПараметры.ВидДокумента);

	КонецЕсли;

КонецПроцедуры
