
&НаКлиенте
Процедура КомандаОткрытьФормуРегистрации(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	ТекУзел = ПолучитьУзелОбменаПоКоду(ТекСтрока.Код);
	ОткрытьФорму("Обработка.РегистрацияИзмененийДляОбменаДанными.Форма.Форма",Новый Структура("УзелОбмена",ТекУзел),ЭтаФорма,,,);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУзелОбменаПоКоду(Код)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменМаженто2.Ссылка КАК Ссылка
	               |ИЗ
	               |	ПланОбмена.ОбменМаженто2 КАК ОбменМаженто2
	               |ГДЕ
	               |	ОбменМаженто2.Код = &Код";
	Запрос.УстановитьПараметр("Код",Код);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции