
#Область ОбработчикиСобытий

Процедура ANTOSHKA_ProdTest_Основной_ПродТест_ТестНазначениеОбработкаПолученияСообщения(Сообщение, Отказ)

	Попытка
		РазмерСообщения = Сообщение.РазмерТела;   
	
		Если РазмерСообщения <> Неопределено Тогда
			РазмерБуфера = Число(РазмерСообщения); 
		Иначе
			РазмерБуфера = 1024;    
		КонецЕсли;
	
	    // Читаем тело сообщения++         
		Если Не РазмерБуфера = 0 Тогда 
	
			Тело  = Новый БуферДвоичныхДанных(0);
			Буфер = Новый БуферДвоичныхДанных(РазмерБуфера);
			Поток = Сообщение.ПолучитьТелоКакПоток();	
			
			Пока Истина Цикл
				
				Прочитано = Поток.Прочитать(Буфер, 0, РазмерБуфера);
				
				Если Прочитано > 0 Тогда
					
					Тело = Тело.Соединить(Буфер);  
					
				КонецЕсли;   
				
				Если Прочитано < РазмерБуфера Тогда
					
					Прервать; 
					
		 		КонецЕсли; 
				
			КонецЦикла; 
			
			ТекстСообщения = ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело);   
			
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
					
			ОбъектДанных = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
			
			ОбъектДанных.ОбменДанными.Загрузка = Истина;
			ОбъектДанных.Записать();
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("СервисИнтеграции"
			, УровеньЖурналаРегистрации.Ошибка
			, ОбъектДанных
			, 
			, ОписаниеОшибки());
			
	КонецПопытки;
	

КонецПроцедуры

#КонецОбласти
