#Область ФункционалЗапросДоступностиТоваров

Процедура КомандаИзменитьСтатусДокумента(ДокументСсылка, Форма, КлючФормы)	Экспорт  
	
	Если КлючФормы = "ФормаДокумента" Тогда
		
		Попытка
			ПрошлыйСтатус = Форма.Объект.СтатусЗапроса;
			ДанныеСостояния = ЗаказыПокупателейСервер.ПолучитьСледующийСтатусЗапросаДоступностиТоваров(Форма.Объект.Ссылка); 
			Форма.Объект.СтатусЗапроса = ДанныеСостояния;
			Форма.Модифицированность = Истина;
			Форма.Записать();
		Исключение
			Форма.Объект.СтатусЗапроса = ПрошлыйСтатус;
		КонецПопытки;
		Оповестить("ИзменилСледующийСтатусЗапроса");
		
	Иначе
		
		ДанныеСостояния = ЗаказыПокупателейСервер.ПолучитьСледующийСтатусЗапросаДоступностиТоваров(ДокументСсылка); 
		ЗаказыПокупателейСервер.УстановитьСостояниеЗапросаДоступностиТоваров(ДокументСсылка, ДанныеСостояния);
		
	КонецЕсли; 
	
	ОформитьКнопкуИзменениеСтатусаДокумента(ДокументСсылка, Форма, КлючФормы); 
	Оповестить("ЗаписанЗапросДоступностиТоваров");

КонецПроцедуры

Процедура ОформитьКнопкуИзменениеСтатусаДокумента(ДокументСсылка, Форма, КлючФормы)	Экспорт

	//Кнопка = Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументЗапросДоступностиТоваровИзменениеСтатусаДокумента;
	Если Форма.Элементы.Найти("ФормаДокументЗапросДоступностиТоваровИзменениеСтатусаДокумента") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Кнопка = Форма.Элементы.ФормаДокументЗапросДоступностиТоваровИзменениеСтатусаДокумента;
	Кнопка.Видимость = Истина;     
	
	Если ДокументСсылка = Неопределено Тогда

		Кнопка.Доступность = Ложь;
		//Кнопка.Картинка    = БиблиотекаКартинок.ФлагНеУстановлен;

	Иначе
		
		Если КлючФормы = "ФормаСписка" Тогда
			
			СледующееСостояние = ЗаказыПокупателейСервер.ПолучитьСледующийСтатусЗапросаДоступностиТоваров(ДокументСсылка);
			
		Иначе 
			
			СледующееСостояние = ЗаказыПокупателейСервер.ПолучитьСледующийСтатусЗапросаДоступностиТоваров(Форма.Объект.Ссылка);
			
		КонецЕсли;
		
		Кнопка.Доступность = Истина; 
		
		Если СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ВРаботе") Тогда 
			
			//Кнопка.Картинка  = БиблиотекаКартинок.СоздатьНакладную;
			Кнопка.Заголовок = "Взять документ в работу";
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Отменён") Тогда 
			
			//Кнопка.Картинка  = БиблиотекаКартинок.СоздатьНакладную;
			Кнопка.Заголовок = "Подтвердить отмену";
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Согласован") Тогда 
			
			//Кнопка.Картинка  = БиблиотекаКартинок.СоздатьНакладную;
			Кнопка.Заголовок = "Согласовать документ";
			//Кнопка.Видимость = (КлючФормы = "ФормаСписка"); 
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.ПустаяСсылка") Тогда 
			
			//Кнопка.Картинка  = БиблиотекаКартинок.СоздатьНакладную;
			//Кнопка.Заголовок = "Согласовать документ";
			Кнопка.Видимость = Ложь; 
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.КОтправке") Тогда 
			
			//Кнопка.Картинка  = БиблиотекаКартинок.СоздатьНакладную;
			Кнопка.Заголовок = "Заказ собран";
			//Кнопка.Видимость = Ложь; 
			
		ИначеЕсли СледующееСостояние = ПредопределенноеЗначение("Перечисление.СтатусыЗапросовДоступностиТоваровШапка.Закрыт") Тогда 
			
			//Кнопка.Картинка  = БиблиотекаКартинок.СоздатьНакладную;
			Кнопка.Заголовок = "Выдать заказ";
			//Кнопка.Видимость = Ложь; 
			
		Иначе
			
			Кнопка.Видимость = Ложь;
			
		КонецЕсли;

		//ИначеЕсли ДанныеСостояния.Существует Тогда

		//	Если ДанныеСостояния.Отправлен Тогда

		//		Если ДанныеСостояния.Рассмотрен Тогда

		//			Кнопка.Картинка  = БиблиотекаКартинок.ФлагУстановлен;
		//			Кнопка.Заголовок = "Рассмотрен в CRM";

		//		Иначе

		//			Кнопка.Картинка  = БиблиотекаКартинок.ФлагУстановленСерый;
		//			Кнопка.Заголовок = "Отправлен";

		//		КонецЕсли;

		//	Иначе

		//		Кнопка.Картинка  = БиблиотекаКартинок.ФлагНеУстановленСерый;
		//		Кнопка.Заголовок = "Ожидает отправки";

		//	КонецЕсли;

		//Иначе

		//	Кнопка.Картинка  = БиблиотекаКартинок.ФлагНеУстановлен;
		//	Кнопка.Заголовок = "Отправить документ";

		//КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти












