//	LNK 17.07.2017 09:45:44
Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

	//	Эта константа передаётся только "сверху вниз"
		ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);

	КонецЕсли;

КонецПроцедуры

//	LNK 17.07.2017 12:34:02
Процедура ПриЗаписи(Отказ)

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

	//	... очистим на всякий случай
		ОбменДанными.Получатели.Очистить();

	КонецЕсли;

КонецПроцедуры
