///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

	ЭтотОбъект().Журнал(ИмяФормы + ".ПриСозданииНаСервере");	//	LNK 02.08.2019 10:56:00
	
	Параметры.Свойство("Магазин", Магазин);
	
	СтрокаНомера = "";
	
КонецПроцедуры

&НаСервере	//	LNK 16.07.2019 11:09:02
Функция ЭтотОбъект(ТекущийОбъект = Неопределено) 

	Если ТекущийОбъект = Неопределено Тогда

		Возврат РеквизитФормыВЗначение("Объект");

	КонецЕсли;

	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");

	Возврат Неопределено;

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаOK(Команда)
	
	ТекстСообщения = "";
	ДанныеЗаказа = ПолучитьДанныеЗаказаПокупателя(СтрокаНомера, Магазин);
	
	Если ЗначениеЗаполнено(ДанныеЗаказа.Ссылка) Тогда

		Если ДанныеЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Отменён")
		ИЛИ	 ДанныеЗаказа.СтатусИМ = ПредопределенноеЗначение("Перечисление.СтатусыИнтернетМагазина.canceled")
		Тогда

			ТекстСообщения = "Відмовлено! Документ за номером «" + СокрЛП(СтрокаНомера) + "» в статусі «Скасовано».";

		ИначеЕсли НЕ ДанныеЗаказа.КоличествоЧеков = 0
				И Не ДанныеЗаказа.УчетнаяСистема = ПредопределенноеЗначение("Перечисление.УчетныеСистемыКомпании.Розница") Тогда

			ТекстСообщения = "ВЖЕ ОБРОБЛЕНО за документом із номером «" + СокрЛП(СтрокаНомера) + "» по магазину «" + Магазин + "» (є враховані чеки ККМ)";

		ИначеЕсли НЕ ДанныеЗаказа.КоличествоПеремещений = 0
				И Не ДанныеЗаказа.УчетнаяСистема = ПредопределенноеЗначение("Перечисление.УчетныеСистемыКомпании.Розница") Тогда

			ТекстСообщения = "ВЖЕ ОБРОБЛЕНО за документом із номером «" + СокрЛП(СтрокаНомера) + "» по магазину «" + Магазин + "» (є враховані переміщення на це замовлення)";

		ИначеЕсли ДанныеЗаказа.СтатусОплаты = ПредопределенноеЗначение("Перечисление.СтатусОплаты.Оплачен") Тогда

			ТекстСообщения = "ВЖЕ СПЛАЧЕНО за документом по номеру «" + СокрЛП(СтрокаНомера) + "» по магазину «" + Магазин + "»";

		ИначеЕсли ДанныеЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПокупателей.Закрыт") Тогда

			ТекстСообщения = "ВЖЕ ЗАКРИТИЙ за документом по номеру «" + СокрЛП(СтрокаНомера) + "» по магазину «" + Магазин + "»";

		Иначе

			Закрыть(ДанныеЗаказа);

		КонецЕсли; 

	Иначе

		ТекстСообщения = "НЕ ЗНАЙДЕНО документ за номером «" + СокрЛП(СтрокаНомера) + "» по магазину «" + Магазин + "»";

	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда

		ОбщегоНазначенияРТКлиент.ВывестиИнформациюДляРМК("Помилка пошуку документа за номером!", ТекстСообщения)

	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста	//	LNK 20.11.2021 18:34:54
Функция ПолучитьДанныеЗаказаПокупателя(НомерДокумента, Магазин)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаЗаказов.Дата, Ведущая.Дата) КАК Дата,
	|	ЕСТЬNULL(ТаблицаЗаказов.Ссылка, Ведущая.Ссылка) КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДАТАВРЕМЯ(1, 1, 1) КАК Дата,
	|		ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК Ссылка) КАК Ведущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	|			ЗаказПокупателяТовары.Ссылка.Дата КАК Дата,
	|			ЗаказПокупателяТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ГДЕ
	|			ЗаказПокупателяТовары.МагазинПолучатель = &Магазин
	|			И ЗаказПокупателяТовары.Ссылка.Номер = &Номер
	|			И ЗаказПокупателяТовары.Ссылка.Проведен
	|			И (ЗаказПокупателяТовары.Ссылка.ТипДоставки = ЗНАЧЕНИЕ(Перечисление.ТипДоставкиЗаказПокупателя.Самовывоз)
	|					ИЛИ ЗаказПокупателяТовары.Самовывоз)) КАК ТаблицаЗаказов
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка"
	);
	Запрос.УстановитьПараметр("Номер"  , СокрЛП(НомерДокумента));
	Запрос.УстановитьПараметр("Магазин", Магазин);

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Возврат Документы.ЗаказПокупателя.РеквизитыДанныхВыбора(Выборка.Ссылка);

КонецФункции










