////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОПОВЕЩЕНИЯ ПОЛЬЗОВАТЕЛЯ О ВЫПОЛНЕННЫХ ДЕЙСТВИЯХ

//Показывает оповещение пользователя об окончании заполнения цен по виду цен
//
// Параметры:
// ЦеныРассчитаны - Булево - Признак успешного расчета цен хотя бы в одной строке
// ВидЦен - СправочникСсылка.ВидыЦен - Вид цен, по которому осуществлялось заполнение цен
//
Процедура ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, ВидЦен) Экспорт

	Если ЦеныРассчитаны Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены заполнены'"),
			,
			СтрЗаменить(НСтр("ru='Цены по виду цен ""%ВидЦен%"" в документе заполнены'"), "%ВидЦен%", ВидЦен),
			БиблиотекаКартинок.Информация32
		);
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены не заполнены'"),
			,
			СтрЗаменить(НСтр("ru='Ни в одной строке цены по виду цен ""%ВидЦен%"" не заполнены'"), "%ВидЦен%", ВидЦен),
			БиблиотекаКартинок.Информация32
		);
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен()

//Показывает оповещение пользователя об окончании заполнения розничных цен по магазину
//
// Параметры:
// ЦеныРассчитаны - Булево - Признак успешного расчета цен хотя бы в одной строке
// Магазин - СправочникСсылка.Магазины - Магазин, по которому осуществлялось заполнение цен
//
Процедура ОповеститьОбОкончанииЗаполненияЦенПоРозничнымЦенам(ЦеныРассчитаны, Магазин) Экспорт

	Если ЦеныРассчитаны Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены заполнены'"),
			,
			СтрЗаменить(НСтр("ru='Розничные цены по магазину ""%Магазин%"" в документе заполнены'"), "%Магазин%", Магазин),
			БиблиотекаКартинок.Информация32
		);
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены не заполнены'"),
			,
			СтрЗаменить(НСтр("ru='Ни в одной строке розничные цены по магазину ""%Магазин%"" не заполнены'"), "%Магазин%", Магазин),
			БиблиотекаКартинок.Информация32
		);
	КонецЕсли;
	
КонецПроцедуры 

//Показывает оповещение пользователя об окончании заполнения цен по себестоимости
//
// Параметры:
// ЦеныРассчитаны - Булево - Признак успешного расчета цен хотя бы в одной строке
//
Процедура ОповеститьОбОкончанииЗаполненияЦенПоСебестоимости(ЦеныРассчитаны = Истина) Экспорт

	Если ЦеныРассчитаны Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены заполнены'"),
			,
			НСтр("ru='Цены по себестоимости в документе заполнены.'"),
			БиблиотекаКартинок.Информация32
		);
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены не заполнены'"),
			,
			НСтр("ru='Ни в одной строке цены по себестоимости не заполнены.'"),
			БиблиотекаКартинок.Информация32
		);
	КонецЕсли;
	
КонецПроцедуры 

//Показывает оповещение пользователя об окончании заполнения цен по прошлым закупкам
//
// Параметры:
// ЦеныРассчитаны - Булево - Признак успешного расчета цен хотя бы в одной строке
//
Процедура ОповеститьОбОкончанииЗаполненияЦенПоПрошлымЗакупкам(ЦеныРассчитаны = Истина) Экспорт

	Если ЦеныРассчитаны Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены заполнены'"),
			,
			НСтр("ru='Цены по прошлым закупкам в документе заполнены'"),
			БиблиотекаКартинок.Информация32
		);
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены не заполнены'"),
			,
			НСтр("ru='Ни в одной строке цены по прошлым закупкам не заполнены'"),
			БиблиотекаКартинок.Информация32
		);
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОкончанииЗаполненияЦенПоПрошлымЗакупкам()

//Показывает оповещение пользователя об окончании заполнения цен по ценам данных поставщика (при расхождении)
//
// Параметры:
// ЦеныРассчитаны - Булево - Признак успешного расчета цен хотя бы в одной строке
//
Процедура ОповеститьОбОкончанииЗаполненияЦенПоДаннымПоставщика(ЦеныРассчитаны = Истина) Экспорт

	Если ЦеныРассчитаны Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены заполнены'"),
			,
			НСтр("ru='Цены по ценам данных поставщика в документе заполнены'"),
			БиблиотекаКартинок.Информация32
		);
	Иначе
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Цены не заполнены'"),
			,
			НСтр("ru='Ни в одной строке цены по ценам данных поставщика не заполнены'"),
			БиблиотекаКартинок.Информация32
		);
	КонецЕсли;
	
КонецПроцедуры // ОповеститьОбОкончанииЗаполненияЦенПоПрошлымЗакупкам()

