////////////////////////////////////////////////////////////////////////////////
// Подсистема "Варианты отчетов" (вызов сервер)
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗаписьВРегистрИспользованияОтчета(Вариант) Экспорт

	ВариантыОтчетов.ЗаписьВРегистрИспользованияОтчета(Вариант);
	
КонецПроцедуры

&НаСервере	//	LNK 06.01.2022 06:27:49
Функция ПолучитьПользовательскиеНастройки(ИмяОтчета, ПараметрыНастроек)	Экспорт

	ПользовательскиеНастройки = Отчеты[ИмяОтчета].Создать().КомпоновщикНастроек.ПользовательскиеНастройки;
	#Если _ Тогда
	ПользовательскиеНастройки = Отчеты.ВедомостьБонусныхНакоплений.Создать().КомпоновщикНастроек.ПользовательскиеНастройки;
	#КонецЕсли

	Для Каждого ЭлПараметр  Из ПараметрыНастроек Цикл

	    Для Каждого ПараметрСКД Из ПользовательскиеНастройки.Элементы Цикл

	        Если ТипЗнч(ПараметрСКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда  

	            Если СокрЛП(ПараметрСКД.Параметр) = ЭлПараметр.Ключ Тогда 

	                ПараметрСКД.Значение = ЭлПараметр.Значение;
	                ПараметрСКД.Использование = Истина;

	            КонецЕсли;

	        КонецЕсли;

	    КонецЦикла;    

	КонецЦикла;

	Возврат ПользовательскиеНастройки;

КонецФункции















