#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
 
#Область ПрограммныйИнтерфейс

// Возвращает ссылку на единственного настроенного в системе бота.
//
// Возвращаемое значение:
//   - СправочникСсылка.НастройкиБотов - ссылка на единственного бота в системе
//   - Неопределено - если в системе не настроен ни один бот или настроено более одного бота
Функция ПолучитьБота() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НастройкиБотов.Ссылка
	|ИЗ
	|	Справочник.НастройкиБотов КАК НастройкиБотов
	|ГДЕ
	|	НЕ НастройкиБотов.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти 

#КонецЕсли