//	LNK 18.05.2018 12:43:58
Функция ИменаСоединений()	Экспорт

	СоставИмен = Новый Соответствие;

	СтруктураИмени(НРег("1CV8")				 , Истина, Ложь, Ложь, СоставИмен);
	СтруктураИмени(НРег("1CV8C")			 , Истина, Ложь, Ложь, СоставИмен);
	СтруктураИмени(НРег("BackgroundJob")	 , Ложь, Истина, Ложь, СоставИмен);
	СтруктураИмени(НРег("WebServerExtension"), Ложь, Ложь, Истина, СоставИмен);
	СтруктураИмени(НРег("Designer")			 , Ложь, Ложь, Ложь  , СоставИмен);
	СтруктураИмени(НРег("SrvrConsole")		 , Ложь, Ложь, Ложь  , СоставИмен);

	Возврат СоставИмен;

КонецФункции // ИменаСоединений()

Процедура СтруктураИмени(ИмяПриложения, Клиент, ФоновоеЗадание, WebСервис, СоставИмен)

	СоставИмен.Вставить(ИмяПриложения
		, Новый Структура(
			"Клиент, ФоновоеЗадание, WebСервис"
			, Клиент, ФоновоеЗадание, WebСервис));

КонецПроцедуры // СтруктураИмени()
