////////////////////////////////////////////////////////////////////////////////
// КОД ПРОЦЕДУР И ФУНКЦИЙ модуля ДатыЗапретаИзмененияПереопределяемый


// Вызывается из переопределяемого модуля
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	// Данные(Таблица, ПолеДаты, Раздел, ПолеОбъекта)
	
	
	// УчетПоМагазинам
	
	// Документы
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковДенежныхСредств", "Дата", "УчетПоМагазинам", "Касса.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВнесениеДенежныхСредствВКассуККМ", "Дата", "УчетПоМагазинам", "КассаККМ.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковРасчетовСПоставщиками", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВедомостьИнвентаризационная", "Дата", "УчетПоМагазинам", "Магазин", "Склад");	//	LNK 21.12.2016 11:14:06
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратТоваровОтПокупателя", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратТоваровПоставщику", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыдачаДисконтныхКарт", "Дата", "УчетПоМагазинам", "Магазин", "");				//	LNK 31.07.2019 13:00:54
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыемкаДенежныхСредствИзКассыККМ", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЕжедневныйОтчет", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказНаПеремещение", "Дата", "УчетПоМагазинам", "МагазинПолучатель", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказНаПеремещение", "Дата", "УчетПоМагазинам", "МагазинОтправитель", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПокупателя", "Дата", "УчетПоМагазинам", "Магазин", "Склад");				//	LNK 21.12.2016 11:14:06
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗакрытиеЗаказовПокупателей", "Дата", "УчетПоМагазинам", "Магазин", "");			//	LNK 25.10.2017 09:47:51
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаказПоставщику", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаменаДисконтныхКарт", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗапросДоступностиТоваров", "Дата", "УчетПоМагазинам", "МагазинОтправитель", "МагазинПолучатель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗарплатаКВыплатеОрганизаций", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаРасходованиеДенежныхСредств", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КассоваяСмена", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КассовыйДень", "Дата", "УчетПоМагазинам", "Магазин", "");						//	LNK 21.12.2016 11:14:06
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаПеремещения", "Дата", "УчетПоМагазинам", "МагазинПолучатель", "СкладПолучатель");	//	LNK 21.12.2016 11:14:06
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаПеремещения", "Дата", "УчетПоМагазинам", "МагазинОтправитель", "СкладОтправитель");	//	LNK 21.12.2016 11:14:06
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЛистКассовойКниги", "Дата", "УчетПоМагазинам", "Магазин", "");					//	LNK 06.03.2017 16:07:32
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МаркетинговаяАкция", "Дата", "УчетПоМагазинам", "Магазины.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МаркетинговаяАкция", "Дата", "УчетПоМагазинам", "СкидкиНаценки.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МотивационнаяПрограмма", "Дата", "УчетПоМагазинам", "Магазины.Магазин", "");		//	LNK 10.11.2017 10:38:17
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОплатаОтПокупателяПлатежнойКартой", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОприходованиеТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОрдерНаОтражениеИзлишковТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОрдерНаОтражениеНедостачТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОрдерНаОтражениеРезультатовПересчетовТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОрдерНаПеремещениеТоваров", "Дата", "УчетПоМагазинам", "Магазин", "СкладПолучатель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОрдерНаПеремещениеТоваров", "Дата", "УчетПоМагазинам", "Магазин", "СкладОтправитель");	//	LNK 05.01.2018 11:20:16
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетОРозничныхПродажах", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаТоваровМеждуОрганизациями", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеТоваров", "Дата", "УчетПоМагазинам", "МагазинПолучатель", "СкладПолучатель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеТоваров", "Дата", "УчетПоМагазинам", "МагазинОтправитель", "СкладОтправитель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереоценкаТоваровНаСкладах", "Дата", "УчетПоМагазинам", "Магазин", "");	//	LNK 21.12.2016 11:14:06
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПересортицаТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПересчетТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПересчетТоваровСамостоятельный", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриемкаРекламныхМатериалов", "Дата", "УчетПоМагазинам", "Магазин", "");	//	LNK 25.07.2019 09:52:55
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриказНаПроведениеИнвентаризацииТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПрименениеЦенНоменклатуры", "Дата", "УчетПоМагазинам", "ОбъектЦенообразования", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриходныйКассовыйОрдер", "Дата", "УчетПоМагазинам", "Касса.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриходныйКассовыйОрдер", "Дата", "УчетПоМагазинам", "КассаККМ.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриходныйОрдерНаТовары", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходныйКассовыйОрдер", "Дата", "УчетПоМагазинам", "Касса.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходныйКассовыйОрдер", "Дата", "УчетПоМагазинам", "КассаККМ.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходныйОрдерНаТовары", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РеализацияСерийныхНомеров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");	//	LNK 21.12.2016 11:16:16
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РеализацияТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегистрацияБезналичнойОплаты", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегистрацияПодсчетаПосетителей", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СборкаТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СводныйОтчетПоКассовойСмене", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СрокиРеализации", "Дата", "УчетПоМагазинам", "Магазин", "");			//	LNK 25.07.2019 12:47:43
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетНаОплатуПокупателю", "Дата", "УчетПоМагазинам", "Магазин", "");	//	LNK 23.03.2020 12:10:17
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаСебестоимости", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УценкаТоваров", "Дата", "УчетПоМагазинам", "Магазин", "Склад");	//	LNK 21.12.2016 11:17:04
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЧекККМ", "Дата", "УчетПоМагазинам", "Магазин", "");
	
//	LNK 24.07.2017 15:21:09
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗакрытиеЛистаЖеланий", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаЛистаЖеланий", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЛистЖеланий", "Дата", "УчетПоМагазинам", "Магазин", "");

//	LNK 31.08.2017 12:54:11
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ДоговорСтрахования", "Дата", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаЛимитовРучныхСкидокМагазин", "Дата", "УчетПоМагазинам", "Магазин", "");

	// РегистрыСведений
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.АннуляцияПродажи", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ДвиженияСерийныхНомеров", "Период", "УчетПоМагазинам", "Отправитель.Магазин", "Отправитель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ДвиженияСерийныхНомеров", "Период", "УчетПоМагазинам", "Отправитель.Магазин", "Отправитель");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ДвиженияСерийныхНомеровКупонов", "Дата", "УчетПоМагазинам", "ЧекККМ.Магазин", "");	//	LNK 28.12.2016 12:42:10 Регистр Непериодический
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ДействиеСкидокНаценок", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ДействующиеЦеныНоменклатуры", "Период", "УчетПоМагазинам", "ОбъектЦенообразования", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПланируемоеРабочееВремяСотрудников", "Период", "УчетПоМагазинам", "ИнтервалРаботыМагазинов.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СебестоимостьНоменклатуры", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СостояниеЛистаЖеланий", "Период", "УчетПоМагазинам", "Магазин", "");		//	LNK 24.07.2017 15:21:52
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СостоянияСерийныхНомеров", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 10.03.2020 10:09:08
	
	// РегистрыНакопления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДвиженияСерийТоваров", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваКВыплате", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваККМ", "Период", "УчетПоМагазинам", "КассаККМ.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваКПоступлениюНаличные", "Период", "УчетПоМагазинам", "Касса.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДенежныеСредстваНаличные", "Период", "УчетПоМагазинам", "Касса.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЗаказыПокупателей", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 21.12.2016 11:19:29
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЗаказыТоваров", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЗакупкиТоваров", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НачисленияМотивационныхПрограмм", "Период", "УчетПоМагазинам", "Склад.Магазин", "Склад");	//	LNK 08.07.2020 11:04:40
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПерсональныеПродажиПродавцов", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 21.12.2016 12:18:25
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.Посетители", "Период", "УчетПоМагазинам", "СчетчикПодсчетаПосетителей.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.Продажи", "Период", "УчетПоМагазинам", "Склад.Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПродажиИнтернетМагазинаИнформативные", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 24.06.2019 09:26:23
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПродажиПоЗаказамПокупателей", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 24.06.2019 09:26:23
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПродажиПоПлатежнымКартам", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПродажиПоЧекам", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 21.12.2016 11:20:10
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасчетыСПоставщиками", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РекламныеМатериалыКОтгрузке", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 25.07.2019 09:57:13
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РекламныеМатериалыКПриемке", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 25.07.2019 09:57:13
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыКОформлениюИзлишковНедостач", "Период", "УчетПоМагазинам", "Склад.Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыКПоступлению", "Период", "УчетПоМагазинам", "Склад.Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СкидкиНаценкиПоЧекам", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 21.12.2016 11:20:10
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыКОтгрузке", "Период", "УчетПоМагазинам", "Склад.Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыНаСкладах", "Период", "УчетПоМагазинам", "Склад.Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыНаМагазинах", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 22.11.2021 09:47:12
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыОрганизаций", "Период", "УчетПоМагазинам", "Склад.Магазин", "Склад");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыПересчитанные", "Период", "УчетПоМагазинам", "ДокументОснование.Магазин", "");	//	LNK 21.12.2016 15:51:11
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.УчетУцененныхТоваров", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 21.12.2016 12:19:19
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЛистыЖеланий", "Период", "УчетПоМагазинам", "Магазин", "");	//	LNK 24.07.2017 15:22:11
	
//	LNK 31.08.2017 12:53:53
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ДоговорыСтрахованияОплаченные", "Период", "УчетПоМагазинам", "ДоговорСтрахования.Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЛимитыРучныхСкидокМагазины", "Период", "УчетПоМагазинам", "Магазин", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТоварыЗастрахованные", "Период", "УчетПоМагазинам", "ДокументПродажи.Магазин", "");

	// ОбщийУчет
	
	// Документы
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводНачальныхОстатковУзла", "Дата", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковПоНакопительнымСкидкам", "Дата", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеАссортимента", "Дата", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаРегистров", "Дата", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеИСписаниеБонусныхБаллов", "Дата", "ОбщийУчет", "", "");	//	LNK 10.02.2022 12:33:34
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СверткаИзУправляющейСистемы", "Дата", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаКвотАссортимента", "Дата", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаЛимитовРучныхСкидокРегион", "Дата", "ОбщийУчет", "", "");	//	LNK 31.08.2017 12:58:50
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаЦенНоменклатуры", "Дата", "ОбщийУчет", "", "");
	
	// РегистрыСведений
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.РегистрацияЗаменыКартПокупателей", "Период", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ЦеныНоменклатуры", "Период", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.Ассортимент", "Период", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КвотыАссортимента", "Период", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СписанныеБонусныеБаллы", "Период", "ОбщийУчет", "", "");	//	LNK 30.11.2021 05:51:29
	
	// РегистрыНакопления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПродажиПоДисконтнымКартам", "Период", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЛимитыРучныхСкидокРегионы", "Период", "ОбщийУчет", "", "");	//	LNK 31.08.2017 12:55:26
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.БонусныеБаллы", "Период", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.БонусныеБаллыВРезерве", "Период", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.БонусныеБаллыПоЗаказамПокупателей", "Период", "ОбщийУчет", "", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.БонусныеБаллыПогашение", "Период", "ОбщийУчет", "", "");

КонецПроцедуры

// Процедура ПередПроверкойЗапретаИзменения позволяет по некоторому
// условию, например, для отказа проверки в некоторых режимах работы
// подсистемы обмена данными (если она используется) или
// для отказа от проверки по статусу документа (открыт/закрыт).
//
// Параметры:
//  Объект       - объект или набор записей (ПередЗаписью или ПриЧтенииНаСервере):
//                 СправочникОбъект
//                 ДокументОбъект
//                 ПланВидовХарактеристикОбъект
//                 ПланСчетовОбъект
//                 ПланВидовРасчетаОбъект
//                 БизнесПроцессОбъект
//                 ЗадачаОбъект
//                 ПланОбменаОбъект
//                 РегистрСведенийНаборЗаписей
//                 РегистрНакопленияНаборЗаписей
//                 РегистрБухгалтерииНаборЗаписей
//                 РегистрРасчетаНаборЗаписей
//
//  СтандартнаяОбработка - Булево, начальное значение Истина,
//                 если присвоить значение Ложь,
//                 тогда проверка выполняться не будет
//
//  ПроверятьПриОбменеДанными - Булево, начальное значение Ложь,
//                 если присвоить значение Истина,
//                 тогда проверка выполняться не будет,
//                 когда Объект.ОбменДанными.Загрузка = Истина
//
Процедура ПередПроверкойЗапретаИзменения(Объект, СтандартнаяОбработка, УзелПланаОбмена, СообщитьОЗапрете) Экспорт
	
	
КонецПроцедуры







