
Процедура КСОСправочникиРегистрацияИзмененийПриЗаписи(Источник, Отказ) Экспорт
	УзлыОбмена = ПланыОбмена.ОбменКСО.Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка = ПланыОбмена.ОбменКСО.ЭтотУзел() Тогда
			Продолжить;
		КонецЕсли;
		Если УзлыОбмена.Ссылка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Источник) = Тип("СправочникСсылка.Номенклатура") 
			ИЛИ ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура")  
				Тогда
			ИсточникДанных = Источник.Ссылка;
		ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.Номенклатура") 
			ИЛИ ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура")  
				Тогда 
			ИсточникДанных = Источник.Ссылка;
		Иначе
			ИсточникДанных = Источник;
		КонецЕсли;
		Если ИсточникДанных.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		Если ИсточникДанных.ВидНоменклатуры.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
			Продолжить;
		КонецЕсли;
		ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка,ИсточникДанных.Ссылка);
	КонецЦикла;
	
КонецПроцедуры


Процедура КСОРегистрыРегистрацияИзмененийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	УзлыОбмена = ПланыОбмена.ОбменКСО.Выбрать();
	Пока УзлыОбмена.Следующий() Цикл
		Если УзлыОбмена.Ссылка = ПланыОбмена.ОбменКСО.ЭтотУзел() Тогда
			Продолжить;
		КонецЕсли;
		Если УзлыОбмена.Ссылка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого Строка_ Из Источник Цикл
			Если УзлыОбмена.ВидЦенКСО <> Строка_.ВидЦены Тогда
				Продолжить;
			КонецЕсли;

			Если Строка_.Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
				Продолжить;
			КонецЕсли;
			
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыОбмена.Ссылка,Строка_.Номенклатура);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьУзелОбменаКСО() Экспорт
	Возврат ПланыОбмена.ОбменКСО.НайтиПоКоду("КСО");	
КонецФункции


Функция ЗапуститьОбменДаннымиКСО() Экспорт
	УзелОбмена = ПолучитьУзелОбменаКСО();
	Параметры = Новый Структура();
	Параметры.Вставить("УзелОбмена",УзелОбмена);
	Параметры.Вставить("АдресСервера",УзелОбмена.АдресСервера);
	Параметры.Вставить("АдресРесурса",УзелОбмена.АдресРесурса);
	Параметры.Вставить("Порт",УзелОбмена.Порт);
	Параметры.Вставить("ВидЦены",УзелОбмена.ВидЦенКСО);
	Параметры.Вставить("РезультатОбмена",Новый Массив);
	Параметры.Вставить("ВыгружатьКартинки", Ложь);

	
	ВыгрузкаНоменклатурыГрупповой(Параметры);
	
	Возврат Параметры;
КонецФункции




&НаСервере
Функция СтруктуруВТекстДЖСОН(СтруктураПараметров) Экспорт
	
	Попытка
		ЗаписьДЖСОН = Новый ЗаписьJSON;
		ЗаписьДЖСОН.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьДЖСОН,СтруктураПараметров);
		ТекстДЖСОН = ЗаписьДЖСОН.Закрыть();
	Исключение
		ТелоПисьма = ОбщегоНазначенияКлиентСервер.СтруктураПредставление("Структура параметров", СтруктураПараметров);
		ОтправитьСообщениеОбОшибке("Ошибка при преобразовании структуры в текст: "+ТелоПисьма+Символы.ПС+""+ОписаниеОшибки());
	КонецПопытки;
	Возврат ТекстДЖСОН;
КонецФункции

//2023-01-05 sa преобразование текста JSON в структуру 
Функция ТекстДЖСОНвСтруктуру(ТекстДЖСОН) Экспорт
	СтруктураОтвета = Новый Структура;
	Если ТекстДЖСОН = "" Тогда
		СтруктураОтвета.Вставить("Success",Ложь);
		СтруктураОтвета.Вставить("Description","Текст не в формате JSON (пустой)!");
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	ФайлJSON = Новый ЧтениеJSON;
	ФайлJSON.УстановитьСтроку(ТекстДЖСОН);
	
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ФайлJSON);
		ФайлJSON.Закрыть();
	Исключение
		СтруктураОтвета.Вставить("Success",Ложь);
		СтруктураОтвета.Вставить("Description","Текст не в формате JSON!"+Символы.ПС+ТекстДЖСОН);
	КонецПопытки;
	
	Возврат СтруктураОтвета;
КонецФункции

Функция ПолучитьЗарегистрированныеИзменения()
	//ограничим запрос 1000 записей т.к. иначе оно тупо не успеет выгрузится за промежуток между регламентными заданиями.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1000
	               |	НоменклатураИзменения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
	               |ГДЕ
	               |	НоменклатураИзменения.Узел = &Узел";
	
	Запрос.УстановитьПараметр("Узел", ПолучитьУзелОбменаКСО());
	Товары = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат Товары;
	
КонецФункции

Функция СформироватьСтруктуруТовара(Параметры, Товар)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СпрНоменклатура.Ссылка КАК Ссылка,
	               |	СпрНоменклатура.Код КАК id,
	               |	СпрНоменклатура.Код КАК sku,
	               |	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.ВидНоменклатуры) КАК ВидНоменклатуры,
	               |	СпрНоменклатура.ЕдиницаИзмерения.Наименование КАК unit,
	               |	СпрНоменклатура.НаименованиеПолное КАК name,
	               |	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.СтавкаНДС) КАК taxRate,
	               |	ДействующиеЦеныНоменклатурыСрезПоследних.Цена * 100 КАК price,
	               |	ДействующиеЦеныНоменклатурыСрезПоследних.ОбъектЦенообразования.ПравилоЦенообразования.ВидЦен.Наименование КАК priceLevel
	               |ИЗ
	               |	РегистрСведений.ДействующиеЦеныНоменклатуры.СрезПоследних(, ОбъектЦенообразования.ПравилоЦенообразования.ВидЦен = &ВидЦен) КАК ДействующиеЦеныНоменклатурыСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	               |		ПО ДействующиеЦеныНоменклатурыСрезПоследних.Номенклатура = СпрНоменклатура.Ссылка
	               |ГДЕ
	               |	СпрНоменклатура.Ссылка = &Номенклатура
	               |	И СпрНоменклатура.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Штрихкоды.Штрихкод КАК barcode,
	               |	ЕСТЬNULL(Штрихкоды.Упаковка.Наименование, Штрихкоды.Владелец.ЕдиницаИзмерения.Наименование) КАК unit
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Владелец = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура",Товар);
	Запрос.УстановитьПараметр("ВидЦен",Параметры.ВидЦены);
	ПакетЗапросов = Запрос.ВыполнитьПакет();

	РезТовары = ПакетЗапросов[0].Выбрать();
	Пока РезТовары.Следующий() Цикл
		СтруктураТовара = Новый Структура("id, sku, taxRate, name, unit, price, priceLevel, barcodes","","","","","",0,"",""); 
		ЗаполнитьЗначенияСвойств(СтруктураТовара,РезТовары);
		СтруктураТовара.Вставить("id", Строка(РезТовары.Ссылка.УникальныйИдентификатор()));
		Если Параметры.ВыгружатьКартинки Тогда
			МассивТоваровДляКартинок = Новый Массив;
			МассивТоваровДляКартинок.Добавить(РезТовары.Ссылка);
			Попытка
				Картинки_ = ЗаказыПокупателейСервер.ПолучитьСоответствиеКартинокТовара(МассивТоваровДляКартинок,Истина);
				ДанныеКартинки = Картинки_.Получить(РезТовары.Ссылка);
				Если ЗначениеЗаполнено(ДанныеКартинки) Тогда          
					СтруктураТовара.Вставить("Картинка",ДанныеКартинки);	
				КонецЕсли;
			Исключение
				ОтправитьСообщениеОбОшибке("Товар: "+СтруктураТовара.id+" "+СтруктураТовара.name+" "+ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли;
		
		МассивШК = Новый Массив;
		РезШК = ПакетЗапросов[1].Выбрать();
		Пока РезШК.Следующий() Цикл
			СтруктураШК = Новый Структура("barcode, unit","","");
			ЗаполнитьЗначенияСвойств(СтруктураШК,РезШК);			
			МассивШК.Добавить(СтруктураШК);	
		КонецЦикла;
		СтруктураТовара.Вставить("barcodes",МассивШК); 
	КонецЦикла;

	Возврат СтруктураТовара;	
КонецФункции

Функция ВыгрузкаНоменклатурыГрупповой(Параметры) Экспорт
	ТекстОтвета = "";
    Параметры.Вставить("РезультатОбмена",Новый Массив);
	
	МассивСообщений = Новый Массив;
	НачВремя = ТекущаяДата();
	Параметры.РезультатОбмена.Добавить("Начало выгрузки: " + НачВремя);
	
	ЛимитПакета = 10 * 1024 * 1024; // 10 МБ
	ТекущийРазмер = 0;
	
	Если Не Параметры.Свойство("Товары") Тогда 
		Товары = ПолучитьЗарегистрированныеИзменения(); 
		Параметры.Вставить("Товары",Товары);
	КонецЕсли;
	
	
	// буферы текущего пакета
	МассивТоваров = Новый Массив;
	СоответствиеКартинок = Новый Соответствие;
	// =========================================
	// ОСНОВНОЙ ЦИКЛ
	// =========================================
	Для Каждого Товар Из Параметры.Товары Цикл
		
		СтруктураТовара = СформироватьСтруктуруТовара(Параметры,Товар);
		
		Если Не ЗначениеЗаполнено(СтруктураТовара.priceLevel) Тогда
			Параметры.РезультатОбмена.Добавить(""+СтруктураТовара.sku+" "+СтруктураТовара.name+" не имеет установленной цены");
			Продолжить;
		КонецЕсли;
		
		Если СтруктураТовара.Свойство("Картинка") Тогда
			ДанныеКартинки = СтруктураТовара.Картинка;
			КартинкаРазмер = ДанныеКартинки.Размер();
		Иначе 
		//	ДанныеКартинки = БиблиотекаКартинок.Документ.ПолучитьДвоичныеДанные();
			ДанныеКартинки = Неопределено; 
			КартинкаРазмер = 0;
		КонецЕсли;

		Ключ = СтруктураТовара.id;

		// если не влазит в пакет → отправляем текущий
		Если ТекущийРазмер + КартинкаРазмер > ЛимитПакета Тогда
			
			ОтправитьПакет(Параметры, МассивТоваров,СоответствиеКартинок);

			// очистка
			МассивТоваров = Новый Массив;
			СоответствиеКартинок = Новый Соответствие;
			ТекущийРазмер = 0;

		КонецЕсли;
		//Если ФормироватьЛогФайл Тогда
		//	Сообщить("SKU: " + СтруктураТовара.SKU + " = " + ОКР(КартинкаРазмер/1024) + "К");
		//КонецЕсли;
		
		СтруктураТовара.Удалить("Картинка");
		МассивТоваров.Добавить(СтруктураТовара);
		Если КартинкаРазмер > 0 Тогда
			СоответствиеКартинок.Вставить(Ключ, ДанныеКартинки);
		КонецЕсли;
		
		//один товар без картинок занимает примерно 512 байт. Это нужно учесть при подсчете размера.
		ТекущийРазмер = ТекущийРазмер +512+ КартинкаРазмер;
		
	КонецЦикла;

	// отправка последнего пакета
	ОтправитьПакет(Параметры, МассивТоваров,СоответствиеКартинок);

	КонВремя = ТекущаяДата();
	МассивСообщений.Добавить("Окончание выгрузки: " + КонВремя);
	Длительность = ?(КонВремя=НачВремя, 1, (КонВремя-НачВремя));
	Параметры.РезультатОбмена.Добавить("Длительность: " + Длительность 
		+ " с. Товаров/сек = " 
		+ (Параметры.Товары.Количество()/Длительность));
		
   
КонецФункции

// =========================================
// ПРОЦЕДУРА ОТПРАВКИ ПАКЕТА
// =========================================
Процедура ОтправитьПакет(Параметры, МассивТоваров, СоответствиеКартинок)
 	ХТТПСоединение = Новый HTTPСоединение(Параметры.АдресСервера, Параметры.Порт);


	Если МассивТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
    ТекстОтвета = "";
	
	Граница = "----1CFormBoundary" + Строка(Новый УникальныйИдентификатор());

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Граница);

	ХТТПЗапрос = Новый HTTPЗапрос(Параметры.АдресРесурса, Заголовки);

	// JSON
	СтруктураВыгрузки = Новый Структура("products", МассивТоваров);
	Попытка
		ТекстЗапроса = СтруктуруВТекстДЖСОН(СтруктураВыгрузки);
	Исключение
		ОтветСервиса = "";
		Параметры.РезультатОбмена.Добавить("Ошибка при формировании пакета: "+ОписаниеОшибки());
		ОтправитьСообщениеОбОшибке("Ошибка при преобразовании структуры в текст: "+ОписаниеОшибки());
		//ОтобразитьСтруктуруРекурсивно("",СтруктураВыгрузки);
		//Сообщить("");
		Возврат;
	КонецПопытки;
	
	Поток = Новый ПотокВПамяти();
	Запись = Новый ЗаписьДанных(Поток, КодировкаТекста.UTF8);

	// --- JSON part ---
	Запись.ЗаписатьСтроку("--" + Граница, КодировкаТекста.UTF8);
	Запись.ЗаписатьСтроку("Content-Disposition: form-data; name=""product""", КодировкаТекста.UTF8);
	Запись.ЗаписатьСтроку("Content-Type: application/json; charset=UTF-8", КодировкаТекста.UTF8);
	Запись.ЗаписатьСтроку("");
	Запись.ЗаписатьСтроку(ТекстЗапроса, КодировкаТекста.UTF8);
	
	ТекущийРазмер = 0;
	// --- IMAGE parts ---
	Для Каждого КлючИЗначение Из СоответствиеКартинок Цикл
		
		ДанныеКартинки = СоответствиеКартинок.Получить(КлючИЗначение.Ключ);
		
		ТекущийРазмер = ТекущийРазмер + ДанныеКартинки.Размер();
		
		Запись.ЗаписатьСтроку("--" + Граница, КодировкаТекста.UTF8);
		Запись.ЗаписатьСтроку(
			"Content-Disposition: form-data; name=""images[" + КлючИЗначение.Ключ + "]""; filename=""" + КлючИЗначение.Ключ + ".jpg""",
			КодировкаТекста.UTF8
		);
		Запись.ЗаписатьСтроку("Content-Type: image/jpeg", КодировкаТекста.UTF8);
		Запись.ЗаписатьСтроку("");

		Запись.Записать(ДанныеКартинки);
		Запись.ЗаписатьСтроку("");

	КонецЦикла;

	// закрытие
	Запись.ЗаписатьСтроку("--" + Граница + "--", КодировкаТекста.UTF8);
	Запись.Закрыть();

	ТелоЗапроса = Поток.ЗакрытьИПолучитьДвоичныеДанные();

	// (опционально дамп)
	//Если ФормироватьЛогФайл Тогда
	//	ТелоЗапроса.Записать(КаталогЛогФайлов+"\dump_"+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd_ЧЧммсс_")+Строка(Новый УникальныйИдентификатор())+".txt"); 
	//КонецЕсли;
	
	ХТТПЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);

	Сообщить("Отправка пакета: " + МассивТоваров.Количество() 
		+ " товаров, ~" + ОКР(ТекущийРазмер/1024/1024,2) + " МБ");

	ОтветСервиса = ХТТПСоединение.ОтправитьДляОбработки(ХТТПЗапрос);

	Если ОтветСервиса.КодСостояния = 200 Тогда
		
		ТекстОтвета = ТекстОтвета + ОтветСервиса.ПолучитьТелоКакСтроку()+Символы.ПС;

		Если ЗначениеЗаполнено(ТекстОтвета) Тогда
			
			СтруктураОтвета = ТекстДЖСОНвСтруктуру(ТекстОтвета);

			Для Каждого ОтветПоТовару Из СтруктураОтвета.response Цикл
				
				Если ОтветПоТовару.success Тогда                                                
					Попытка
						Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ОтветПоТовару.id));
						Если Найти(Строка(Номенклатура),"<Обмен не найден>")>0 Тогда
							Параметры.РезультатОбмена.Добавить("В базе 1С не найден успешно загруженный товар с УИД "+ОтветПоТовару.id);
							Продолжить;
						КонецЕсли;
						ПланыОбмена.УдалитьРегистрациюИзменений(Параметры.УзелОбмена, Номенклатура);
					Исключение
						Параметры.РезультатОбмена.Добавить("Исключительная ситуация при поиске товара с УИД "+ОтветПоТовару.id);
					КонецПопытки;
				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

	Иначе
		Параметры.РезультатОбмена.Добавить("Ошибка при передаче пакета: " + ОтветСервиса.КодСостояния 
			+ Символы.ПС + ОтветСервиса.ПолучитьТелоКакСтроку());
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеОбОшибке(ТелоПисьма)
	
	УчетныеДанныеОтправителя = РаботаСПочтовымиСообщениями.ПолучитьСистемнуюУчетнуюЗапись();
	
	Если УчетныеДанныеОтправителя.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда

		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", "oleksandr.danyliuk@gmail.com");
		ПараметрыПисьма.Вставить("Тема", "Ошибка при выгрузке в КСО от "+ТекущаяДата());
			
		ПараметрыПисьма.Вставить("Тело", ТелоПисьма);

		ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(УчетныеДанныеОтправителя, ПараметрыПисьма);
		
	КонецЕсли;

	
КонецПроцедуры

//=======================================================================

Функция НайтиЧекПоФН(НомерЧека,ДатаЧека)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ФискальныеНомераЧеков.ЧекККМ КАК ЧекККМ
	               |ИЗ
	               |	РегистрСведений.ФискальныеНомераЧеков КАК ФискальныеНомераЧеков
	               |ГДЕ
	               |	ФискальныеНомераЧеков.ФискальныйНомер = &ФискальныйНомер";
	Запрос.УстановитьПараметр("ФискальныйНомер", НомерЧека);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.ЧекККМ;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции  

Функция ПолучитьДК(Контрагент)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ИнформационныеКарты.Ссылка КАК Ссылка,
	               |	ИнформационныеКарты.ДатаОткрытия КАК ДатаОткрытия
	               |ИЗ
	               |	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
	               |ГДЕ
	               |	ИнформационныеКарты.ВладелецКарты = &ВладелецКарты
	               |	И ИнформационныеКарты.Блокирован = ЛОЖЬ
	               |	И ИнформационныеКарты.ВидДисконтнойКарты = ЗНАЧЕНИЕ(Справочник.ВидыДисконтныхКарт.ВиртуальныеКарты)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОткрытия УБЫВ";  
	Запрос.УстановитьПараметр("ВладелецКарты",Контрагент);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		Возврат Рез.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


//Ожидаем дату в формате 2025-09-02T10:55:38 
Функция ПолучитьДату(Знач ДатаСтрокой)           
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой,"-","");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой,"T","");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой,":","");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой,"/","");
	
	Попытка
		вДата = Дата(ДатаСтрокой);
	Исключение
		вДата = Дата("00010101");
	КонецПопытки;             
	
	Возврат вДата;	
	
КонецФункции

Функция ПолучитьНоменклатуру(КодНоменклатуры)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                              |	Номенклатура.Ссылка КАК Ссылка
	                              |ИЗ
	                              |	Справочник.Номенклатура КАК Номенклатура
	                              |ГДЕ
	                              |	Номенклатура.IDN = &КодНоменклатуры";
	Запрос.УстановитьПараметр("КодНоменклатуры", КодНоменклатуры);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьТерминалПоИД(ТерминалИД)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЭквайринговыеТерминалы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	               |ГДЕ
	               |	ЭквайринговыеТерминалы.ПометкаУдаления = ЛОЖЬ
	               |	И ЭквайринговыеТерминалы.ТерминалИД = &ТерминалИД";
	Запрос.УстановитьПараметр("ТерминалИД",ТерминалИД);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

Функция ПолучитьТерминалПоКассеККМ(КассаККМ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЭквайринговыеТерминалы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	               |ГДЕ
	               |	ЭквайринговыеТерминалы.ПометкаУдаления = ЛОЖЬ
	               |	И ЭквайринговыеТерминалы.Касса = &КассаККМ";
	Запрос.УстановитьПараметр("КассаККМ",КассаККМ);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


Функция ПроверитьКассовуюСмену(Магазин,Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КассовыйДень.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.КассовыйДень КАК КассовыйДень
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(КассовыйДень.НачалоКассовогоДня, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	               |	И КассовыйДень.СтатусКассовогоДня = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	               |	И КассовыйДень.Магазин = &Магазин";
	Запрос.УстановитьПараметр("Магазин",Магазин);
	Запрос.УстановитьПараметр("Дата",Дата);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции


Функция СоздатьЧекПоПараметрам(СтруктураЧека) Экспорт               
	УстановитьПривилегированныйРежим(Истина); 
	
	Попытка
		НомерЧека = СтруктураЧека.Number;
		ДатаЧека = ПолучитьДату(СтруктураЧека.Date); 
		ЧекСсылка = НайтиЧекПоФН(НомерЧека,ДатаЧека);
		//ЧекСсылка = Документы.ЧекККМ.НайтиПоНомеру(НомерЧека, ДатаЧека);
		Если ЗначениеЗаполнено(ЧекСсылка) Тогда
			//Если СтруктураЧека.Свойство("ПерезаписыватьСуществующий") И СтруктураЧека.ПерезаписыватьСуществующий = Истина Тогда
				ЧекОбъект = ЧекСсылка.ПолучитьОбъект(); 
			//Иначе     
			//	СтруктураЧека.Вставить("ОписаниеОшибки","Документ "+ЧекСсылка+" уже существует в базе");
			//	Возврат Ложь;
			//КонецЕсли;
		Иначе
			ЧекОбъект = Документы.ЧекККМ.СоздатьДокумент();
			ЧекОбъект.Ответственный = Справочники.Пользователи.АдминистраторАвтоматов;
			ЧекОбъект.Автор = Справочники.Пользователи.АдминистраторАвтоматов;
			//ЧекОбъект.Номер = НомерЧека;
			ЧекОбъект.Дата = ДатаЧека;
		КонецЕсли;
		ЧекОбъект.КассаККМ = Справочники.КассыККМ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураЧека.Kassa));
		ЧекОбъект.Организация = ЧекОбъект.КассаККМ.Владелец;
		ЧекОбъект.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа;   //принимаем через сервисы только чеки продажи
		НомерТелефона = "";
		Если СтруктураЧека.Свойство("Buyer") И ЗначениеЗаполнено(СтруктураЧека.Buyer) Тогда
			ЧекОбъект.ВладелецДисконтнойКарты = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураЧека.Buyer.IDC)); 
			Если ЗначениеЗаполнено(ЧекОбъект.ВладелецДисконтнойКарты) Тогда
				ЧекОбъект.ДисконтнаяКарта = ПолучитьДК(ЧекОбъект.ВладелецДисконтнойКарты);
			//ИначеЕсли Найти(Строка(ЧекОбъект.ВладелецДисконтнойКарты),"<Объект не найден>")>0 Тогда
			//	ЧекОбъект.ВладелецДисконтнойКарты = Неопределено;	
			КонецЕсли;
			Если СтруктураЧека.Buyer.Свойство("phoneNumber") Тогда
				НомерТелефона = СтруктураЧека.Buyer.phoneNumber;	
			КонецЕсли;
		КонецЕсли;            
		
		СтруктураДанныеРасчета = Новый Структура("ДанныеРасчёта",СтруктураЧека);
		ЧекОбъект.Хранилище = Новый ХранилищеЗначения(СтруктураДанныеРасчета, Новый СжатиеДанных(9));
		
		ЧекОбъект.Магазин = ЧекОбъект.КассаККМ.Магазин; 
		Если Не ЗначениеЗаполнено(ЧекОбъект.Ссылка) Тогда   
			//ЧекОбъект.ДополнительныеСвойства.Вставить("Префикс",Формат(ЧекОбъект.Магазин.НомерМагазина,"ЧЦ=3; ЧДЦ=0; ЧВН=; ЧГ=; ЧФ=Ч-"));			
			ЧекОбъект.УстановитьНовыйНомер(); 
			ЧекОбъект.IDN = ЧекОбъект.Номер;
			
			Отказ = ПроверитьКассовуюСмену(ЧекОбъект.Магазин,ЧекОбъект.Дата);
			//пока отключим
			//Если Отказ Тогда
			//	СтруктураЧека.Вставить("ОписаниеОшибки","По касі "+ЧекОбъект.КассаККМ+" не відкрито касовий день. Завантаження чеків неможливо.");
			//	СтруктураЧека.Вставить("КодОшибки",20);
			//	Успешно = Ложь;
			//	Возврат Успешно;
			//КонецЕсли;
		КонецЕсли;
		ЧекОбъект.АналитикаХозяйственнойОперации = Справочники.АналитикаХозяйственныхОпераций.РеализацияТоваров;
		ЧекОбъект.ЦенаВключаетНДС = СтруктураЧека.TaxInclude;
		
		//если чек фискализирован, то должны быть эти параметры
		Если ЗначениеЗаполнено(СтруктураЧека.FiscalInfo) Тогда
			ЧекОбъект.СтатусЧекаККМ = Перечисления.СтатусыЧековККМ.Пробитый;       
			ЧекОбъект.ОбработчикДрайвера = Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикDeviceManagerФискальныйРегистратор;
		КонецЕсли;
		ЧекОбъект.СкидкиРассчитаны = Истина;
		
		//Товары
		ЧекОбъект.Товары.Очистить();
		Для Каждого СтруктураСтроки Из СтруктураЧека.Products Цикл
			Строка_ = ЧекОбъект.Товары.Добавить();
			Строка_.Номенклатура = ПолучитьНоменклатуру(СтруктураСтроки.IDN);
			//Строка_.Характеристика = ПолучитьХарактеристику(СтруктураСтроки.IDN);
			Строка_.КлючСвязи = СтруктураСтроки.KeyLink;
			Строка_.КлючСвязиБонусныхБаллов = СтруктураСтроки.KeyLinkBonus;
			Строка_.Количество = СтруктураСтроки.Count;
			Строка_.Цена 		= СтруктураСтроки.Price;
			Строка_.СуммаАвтоматическойСкидки 		= СтруктураСтроки.SummaAutoDiscount;
			Строка_.СуммаРучнойСкидки 				= СтруктураСтроки.SummaManualDiscount;
			Строка_.СуммаБонусныхБалловНачислено 	= СтруктураСтроки.SummaBonusAccrue;
			Строка_.СуммаБонусныхБалловСписано 		= СтруктураСтроки.SummaBonusPay;
			Строка_.СуммаНДС = СтруктураСтроки.TaxSumma;
			Строка_.СтавкаНДС = Строка_.Номенклатура.СтавкаНДС;
			Строка_.КоличествоУпаковок = СтруктураСтроки.Count;
			Строка_.Сумма = Строка_.Количество * Строка_.Цена - Строка_.СуммаАвтоматическойСкидки - Строка_.СуммаРучнойСкидки - Строка_.СуммаБонусныхБалловСписано;
			Строка_.Склад = ЧекОбъект.Магазин.СкладПродажи;
		КонецЦикла;
		
		//СкидкиНаценки
		ЧекОбъект.СкидкиНаценки.Очистить();
		Для Каждого СтруктураСтроки Из СтруктураЧека.Discounts Цикл
			СтрокаСкидкиНаценки = ЧекОбъект.СкидкиНаценки.Добавить();
			СтрокаСкидкиНаценки.КлючСвязи = СтруктураСтроки.KeyLink;
			СтрокаСкидкиНаценки.СкидкаНаценка = Справочники.СкидкиНаценки.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураСтроки.Discount));
			Если СтруктураСтроки.TypeApplication = "ApplyImmediately" Тогда
				СтрокаСкидкиНаценки.СпособПримененияСкидки = Перечисления.СпособыПримененияСкидокНаценок.ПрименитьВМоментРасчетаСкидокНаценок;
			Иначе
				СтрокаСкидкиНаценки.СпособПримененияСкидки = Перечисления.СпособыПримененияСкидокНаценок.НачислитьБонусныеБаллы;
			КонецЕсли;
			СтрокаСкидкиНаценки.Сумма = СтруктураСтроки.Summa;
			//СтрокаСкидкиНаценки.Расшифровка = СтруктураСтроки.KeyLink;
			
		КонецЦикла;

		//НачислениеБонусныхБаллов
		ЧекОбъект.НачислениеБонусныхБаллов.Очистить();
		Для Каждого СтруктураСтроки Из СтруктураЧека.AccrueBonusPoints Цикл
			Строка_ = ЧекОбъект.НачислениеБонусныхБаллов.Добавить();
			Строка_.ДатаНачисления = ПолучитьДату(СтруктураСтроки.DateAccrual);
			Строка_.ДатаСписания = ПолучитьДату(СтруктураСтроки.DateCancel);
			Строка_.ПрограммаЛояльности = Справочники.ПрограммыЛояльности.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураСтроки.LoyaltyProgram)); 
			Строка_.СуммаБонусныхБаллов = СтруктураСтроки.Summa;
			
		КонецЦикла;

		//ОплатаБонуснымиБаллами
		ЧекОбъект.ОплатаБонуснымиБаллами.Очистить();
		Для Каждого СтруктураСтроки Из СтруктураЧека.PayBonusPoints Цикл
			Строка_ = ЧекОбъект.ОплатаБонуснымиБаллами.Добавить();
			Строка_.КлючСвязиБонусныхБаллов = СтруктураСтроки.KeyLinkBonus;
			Строка_.ПрограммаЛояльности = Справочники.ПрограммыЛояльности.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураСтроки.LoyaltyProgram)); 
			Если СтруктураСтроки.TypeBonus = "Attraction" Тогда
				Строка_.ТипБонусов = Перечисления.ТипыБонусов.Привлечение;
			ИначеЕсли СтруктураСтроки.TypeBonus = "Organic" Тогда
				Строка_.ТипБонусов = Перечисления.ТипыБонусов.Органический;
			Иначе
				Строка_.ТипБонусов = Перечисления.ТипыБонусов.Акционный;
			КонецЕсли;
			Строка_.СуммаБонусныхБаллов = СтруктураСтроки.Summa;
		КонецЦикла;
		
		//Оплаты
		ЧекОбъект.Оплата.Очистить();
		Для Каждого СтруктураСтроки Из СтруктураЧека.Payment Цикл
			Строка_ = ЧекОбъект.Оплата.Добавить();
			Если СтруктураСтроки.Type = "Наличные" Тогда
				Строка_.ВидОплаты = Справочники.ВидыОплатЧекаККМ.Наличные;
			ИначеЕсли СтруктураСтроки.Type = "Платіжна картка" Тогда
				Строка_.ВидОплаты = Справочники.ВидыОплатЧекаККМ.ОплатаПлатежнойКартой;
				Строка_.СсылочныйНомер = СтруктураСтроки.TransactionID;
				Если Не ЗначениеЗаполнено(СтруктураСтроки.TerminalID) Тогда
					Строка_.ЭквайринговыйТерминал = ПолучитьТерминалПоКассеККМ(ЧекОбъект.КассаККМ);
				Иначе
					Строка_.ЭквайринговыйТерминал = ПолучитьТерминалПоИД(СтруктураСтроки.TerminalID);
				КонецЕсли;
				Строка_.НомерЧекаЭТ = СтруктураСтроки.TransactionID;
				Если СтруктураСтроки.Свойство("Params") И ЗначениеЗаполнено(СтруктураСтроки.Params) Тогда
					Строка_.СлипЧек = ОбменWebRetailСервер.СтруктуруВТекстДЖСОН(СтруктураСтроки.Params);
				КонецЕсли;
			КонецЕсли;
			Строка_.Сумма = СтруктураСтроки.Summa;
			
		КонецЦикла;  
		
		//ЧекОбъект.ОбменДанными.Загрузка = Истина;
		ЧекОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаДанныхИзРабочегоМеста", Истина);
		ЧекОбъект.ДополнительныеСвойства.Вставить("СлужебнаяЗапись", Истина);
		
		//Коды ошибок 20-29 зарезервированы для случаев когда мы требуем от КСО повторить попытку отправки чека.
		//В остальных случаях, КСО сохраняет чек в своей базе, логирует ошибку но более не пытается ее выгрузить.
		//Какие случаи мы считаем необходимыми для повторной выгрузки, определяем мы сами кодами 20-29.
		Попытка
			ЧекОбъект.Записать(РежимЗаписиДокумента.Проведение); 
			СтруктураЧека.Вставить("ЧекККМСсылка",ЧекОбъект.Ссылка);
			УстановитьИспользованиеКупона(СтруктураЧека);			
			Успешно = Истина;
		Исключение
			ЧекОбъект.Записать(РежимЗаписиДокумента.Запись);
			Успешно = Ложь;
			СтруктураЧека.Вставить("ОписаниеОшибки","Документ "+ЧекОбъект.Ссылка+": "+ОписаниеОшибки());
			СтруктураЧека.Вставить("КодОшибки",1);
		КонецПопытки;			

		//даже если ФН уже существует в данном случае это не ошибка.
		СтруктураОтвета = Документы.ЧекККМ.ЗаписатьФискальныйНомер(ЧекОбъект.Ссылка,НомерЧека,,СтруктураЧека.FiscalInfo);
		
		СтруктураЧека.Вставить("ЧекККМСсылка",Чекобъект.Ссылка);
	Исключение
		СтруктураЧека.Вставить("ОписаниеОшибки","При создании чека №"+НомерЧека+" от "+ДатаЧека+"произошла ошибка: "+ОписаниеОшибки());
		СтруктураЧека.Вставить("КодОшибки",1);
		Успешно = Ложь;
	КонецПопытки;

	//2026-06-09 sa если чек залетел успешно, отправляем покупателю СМС
	Если Успешно И ЗначениеЗаполнено(НомерТелефона) Тогда
		//Чек успешно загружен. К КСО претензий нет. Если при отправке чека возникнет ошибка, то КСО должно нормально завершить операцию.
		Попытка 
			ОтветПРРО = СтруктураЧека.FiscalInfo.fiscal;
			ДанныеПротокола = Новый Структура(
					"Объект, URL, ДанныеPDF, ОтветПРРО"
					, ЧекОбъект.Ссылка
					, ОтветПРРО.info.QR
					, ОтветПРРО.pf_doccmd
					, ОтветПРРО);
			
		
			ПодключаемоеОборудованиеDeviceManagerФискальныйРегистраторСервер.ОтправитьУведомлениеПокупателю(
				НомерТелефона,ЧекОбъект.ВладелецДисконтнойКарты,ДанныеПротокола,Перечисления.ВидыСообщений.SMS,ИмяКомпьютера(),Ложь); 
		Исключение
		КонецПопытки;
			
	КонецЕсли;		
	
	Возврат Успешно;
КонецФункции

Функция УстановитьИспользованиеКупона(СтруктураЧека)
	
	//Таблица купонов
	Если НЕ (СтруктураЧека.Свойство("CouponsRedeemed") И ТипЗнч(СтруктураЧека.CouponsRedeemed)=Тип("Массив")) Тогда 
		Возврат Истина;
	КонецЕсли;       
	
	Если СтруктураЧека.CouponsRedeemed.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ДвиженияСерийныхНомеровКупонов.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);


	НаборЗаписей.Отбор.ЧекККМ.Установить(СтруктураЧека.ЧекККМСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	Для Каждого СтруктураКупона Из СтруктураЧека.CouponsRedeemed Цикл
		Купон = ПолучитьДанныеКупона(СтруктураКупона); 
		Если Купон = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ЧекККМ	 = СтруктураЧека.ЧекККМСсылка;
		ЗаписьНабора.Купон	 = Купон.Номенклатура;
		ЗаписьНабора.СерийныйНомер	 = Купон.СерийныйНомер;
		ЗаписьНабора.Дата	 = ТекущаяДатаСеанса();
		ЗаписьНабора.АналитикаХозяйственнойОперации = Справочники.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов;
		ЗаписьНабора.Магазин = СтруктураЧека.ЧекККМСсылка.Магазин;
		ЗаписьНабора.Количество = 1;
	КонецЦикла;

	НаборЗаписей.Записать();
	
	
КонецФункции

Функция ПолучитьДанныеКупона(СтруктураКупона)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	СерийныеНомера.Ссылка КАК СерийныйНомер,
	               |	СерийныеНомера.Владелец КАК Номенклатура
	               |ИЗ
	               |	Справочник.СерийныеНомера КАК СерийныеНомера
	               |ГДЕ
	               |	СерийныеНомера.ПометкаУдаления = ЛОЖЬ
	               |	И СерийныеНомера.Владелец.Код = &Код
	               |	И СерийныеНомера.КодСерийногоНомера = &КодСерийногоНомера"; 
	Запрос.УстановитьПараметр("Код", СтруктураКупона.Coupon);
	Запрос.УстановитьПараметр("КодСерийногоНомера", СтруктураКупона.SerialNumber);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		Купон = Новый Структура("Номенклатура,СерийныйНомер", Рез.Номенклатура,Рез.СерийныйНомер);
		Возврат Купон;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	

КонецФункции