Перем МассивОбъектовКПроведению;
Перем ОписаниеТиповОбъектовКПроведению;   

Процедура ПередЗаписью(Отказ)
	Если ОбменДаннымиСервер.НадоВыполнитьОбработчикПослеЗагрузкиДанных(ЭтотОбъект, Ссылка) Тогда
		ПослеЗагрузкиДанных(Отказ);		
	КонецЕсли; 	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если (НЕ ЭтоНовый())
		И (ОбменДаннымиПовтИсп.ЭтоПредопределенныйУзелПланаОбмена(Ссылка) 
		ИЛИ ОбменДаннымиПовтИсп.ГлавныйУзел() = Ссылка) Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("Магазин");
		МассивНепроверяемыхРеквизитов.Добавить("РабочееМесто");
		
	КонецЕсли;	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Если ОписаниеТиповОбъектовКПроведению.СодержитТип(ТипЗнч(ЭлементДанных)) Тогда
		Если ЗначениеЗаполнено(ЭлементДанных.Ссылка) Тогда
			МассивОбъектовКПроведению.Добавить(ЭлементДанных.Ссылка);			
		ИначеЕсли ЭлементДанных.Проведен Тогда
			ЭлементДанных.ОбменДанными.Отправитель = Ссылка;
			ЭлементДанных.ОбменДанными.Загрузка = Истина;
			ЭлементДанных.ДополнительныеСвойства.Вставить("ЗагрузкаДанныхИзРабочегоМеста");
			ЭлементДанных.Записать(РежимЗаписиДокумента.Запись);			
			МассивОбъектовКПроведению.Добавить(ЭлементДанных.Ссылка);						
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗагрузкиДанных(Отказ)
	
	Если МассивОбъектовКПроведению.Количество() > 0 Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЧекККМ.Ссылка КАК Ссылка,
		|	ЧекККМ.Дата КАК Дата,
		|	ЧекККМ.МоментВремени КАК МоментВремени,
		|	ЧекККМ.Проведен КАК Проведен
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.Ссылка В(&МассивОбъектовКПроведению)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	МоментВремени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
		|	ОтчетОРозничныхПродажах.Дата КАК Дата,
		|	ОтчетОРозничныхПродажах.МоментВремени КАК МоментВремени,
		|	ОтчетОРозничныхПродажах.Проведен КАК Проведен
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	ОтчетОРозничныхПродажах.Ссылка В(&МассивОбъектовКПроведению)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетОРозничныхПродажах.Дата,
		|	ОтчетОРозничныхПродажах.МоментВремени");
		
		Запрос.УстановитьПараметр("МассивОбъектовКПроведению",МассивОбъектовКПроведению);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Для Инд = 0 По 1 Цикл
			
			Если НЕ РезультатЗапроса[Инд].Пустой() Тогда
				
				Выборка = РезультатЗапроса[Инд].Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Попытка
						
						ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();				
						
						Если Выборка.Проведен Тогда
							
							РежимЗаписи = РежимЗаписиДокумента.Проведение;
							
						Иначе	
							
							РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;	
							
						КонецЕсли;	
						
						ДокументОбъект.ОбменДанными.Отправитель = Ссылка;					
						ДокументОбъект.ДополнительныеСвойства.Вставить("ЗагрузкаДанныхИзРабочегоМеста");
						ДокументОбъект.Записать(РежимЗаписи);					
						
					Исключение
						
						Инфо = ИнформацияОбОшибке();
						ТекстСообщенияОбОшибке = НСтр("ru = 'Ошибка при проведении документа: %1. 
						|При загрузке данных по рабочему месту: %2'");
						ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщенияОбОшибке, КраткоеПредставлениеОшибки(Инфо), Ссылка);
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Обмен данными. Загрузка данных'"), УровеньЖурналаРегистрации.Ошибка,,Инфо);								
						
					КонецПопытки;												
					
				КонецЦикла;					
				
			КонецЕсли;			
			
		КонецЦикла;			
		
	КонецЕсли;	
	
КонецПроцедуры

ОписаниеТиповОбъектовКПроведению = Новый ОписаниеТипов("ДокументОбъект.ЧекККМ, ДокументОбъект.ОтчетОРозничныхПродажах");
МассивОбъектовКПроведению = Новый Массив;