Функция МассивПраздничныхДней(НомерГода) Экспорт
	
	ПраздничныеДни = Новый Массив;
	
	Если НомерГода = 2010 Тогда
		
		ПраздничныеДни.Добавить(Дата(2010, 1, 1));
		ПраздничныеДни.Добавить(Дата(2010, 1, 2));
		ПраздничныеДни.Добавить(Дата(2010, 1, 3));
		ПраздничныеДни.Добавить(Дата(2010, 1, 4));
		ПраздничныеДни.Добавить(Дата(2010, 1, 5));
		ПраздничныеДни.Добавить(Дата(2010, 1, 7));
		ПраздничныеДни.Добавить(Дата(2010, 2, 23));
		ПраздничныеДни.Добавить(Дата(2010, 3, 8));
		ПраздничныеДни.Добавить(Дата(2010, 5, 1));
		ПраздничныеДни.Добавить(Дата(2010, 5, 9));
		ПраздничныеДни.Добавить(Дата(2010, 6, 12));
		ПраздничныеДни.Добавить(Дата(2010, 11, 4));
		ПраздничныеДни.Добавить(Дата(2010, 1, 6));
		ПраздничныеДни.Добавить(Дата(2010, 1, 8));
		ПраздничныеДни.Добавить(Дата(2010, 2, 22));
		ПраздничныеДни.Добавить(Дата(2010, 5, 3));
		ПраздничныеДни.Добавить(Дата(2010, 5, 10));
		ПраздничныеДни.Добавить(Дата(2010, 6, 14));
		ПраздничныеДни.Добавить(Дата(2010, 11, 5));
		
	ИначеЕсли НомерГода  = 	2011 Тогда
		
		ПраздничныеДни.Добавить(Дата(2011, 1, 1));
		ПраздничныеДни.Добавить(Дата(2011, 1, 2));
		ПраздничныеДни.Добавить(Дата(2011, 1, 3));
		ПраздничныеДни.Добавить(Дата(2011, 1, 4));
		ПраздничныеДни.Добавить(Дата(2011, 1, 5));
		ПраздничныеДни.Добавить(Дата(2011, 1, 7));
		ПраздничныеДни.Добавить(Дата(2011, 2, 23));
		ПраздничныеДни.Добавить(Дата(2011, 3, 8));
		ПраздничныеДни.Добавить(Дата(2011, 5, 1));
		ПраздничныеДни.Добавить(Дата(2011, 5, 9));
		ПраздничныеДни.Добавить(Дата(2011, 6, 12));
		ПраздничныеДни.Добавить(Дата(2011, 11, 4));
		ПраздничныеДни.Добавить(Дата(2011, 1, 6));
		ПраздничныеДни.Добавить(Дата(2011, 1, 10));
		ПраздничныеДни.Добавить(Дата(2011, 5, 2));
		ПраздничныеДни.Добавить(Дата(2011, 6, 13));
		
	КонецЕсли;	
	
	Возврат ПраздничныеДни; 
	
КонецФункции

