
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено
	   И ДанныеЗаполнения.Свойство("Владелец")
	Тогда
		Организация = Справочники.ДоговорыЭквайринга.РеквизитыДоговораЭквайринга(ДанныеЗаполнения.Владелец).Организация;
	КонецЕсли;
	
	Касса = Справочники.КассыККМ.КассаПоУмолчанию(Организация);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьКассу(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРозничнаяТорговля = ТипЗнч(Касса) = Тип("СправочникСсылка.КассыККМ");
	Если РозничнаяТорговля <> ЭтоРозничнаяТорговля Тогда
		РозничнаяТорговля = ЭтоРозничнаяТорговля;
	КонецЕсли;
	
	Если ИспользоватьБезПодключенияОборудования Тогда
		ПодключаемоеОборудование = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверяет кассу, указанную в эквайринговом терминале.
//
Процедура ПроверитьКассу(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Касса) Тогда
		возврат;
	КонецЕсли;
	
	Если ТипЗнч(Касса) = Тип("СправочникСсылка.Кассы") Тогда
		Реквизиты = ДенежныеСредстваСервер.ПолучитьРеквизитыКассы(Касса);
	ИначеЕсли ТипЗнч(Касса) = Тип("СправочникСсылка.КассыККМ") Тогда
		Реквизиты = Справочники.КассыККМ.РеквизитыКассыККМ(Касса);
	Иначе
		Реквизиты = Новый Структура("Организация, Магазин");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация)
		И ЗначениеЗаполнено(Реквизиты.Организация)
		И Организация <> Реквизиты.Организация
	Тогда
		
		Текст = НСтр("ru = 'Организация кассы не соответствует организации договора эквайринга'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ЭтотОбъект,
			"Касса",
			,
			Отказ
		);
	Иначе
		Магазин = Реквизиты.Магазин;
	КонецЕсли;
	
КонецПроцедуры
