
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЛистыЖеланий Приход
	Движения.ЛистыЖеланий.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЛистыЖеланий.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Магазин = Магазин;
		Движение.ЛистЖеланий = Ссылка;
		Движение.Корзина = Корзина;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Операция = Перечисления.ОперацияЛистаЖеланий.Добавление;
	КонецЦикла;
	
	// регистр СостояниеЛистаЖеланий
	Движения.СостояниеЛистаЖеланий.Записывать = Истина;
	Движение = Движения.СостояниеЛистаЖеланий.Добавить();
	Движение.Период = Дата;
	Движение.Магазин = Магазин;
	Движение.ЛистЖеланий = Ссылка;
	Движение.Состояние = Перечисления.СостояниеЛистаЖеланий.Создание;
	
	ОписаниеОперации = "Создан лист желаний №"+ Номер + " от " + Дата + ", на корзину №" + Корзина + "." + Символы.ПС +
	"Добавлена номенклатура: " + Символы.ПС;
	Для каждого Строка Из Товары Цикл
		ОписаниеОперации = ОписаниеОперации + Строка.Номенклатура +" в количестве "+ Строка.Количество + Символы.ПС;
	КонецЦикла; 
	Движение.ОписаниеОперации = ОписаниеОперации;
КонецПроцедуры

