//СЮП 22.02.2024 15.51.20 
#Область ПрограммныйИнтерфейс

Функция ВыполнитьЗапросДляGraphQL(ТекстЗапроса) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ОписаниеОшибки", "");
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("КодОтвета", 0);
	Результат.Вставить("ТекстJSON", "");

	Попытка

	//	Выполняем подключение к серверу "https://graphql.awdev.pro/graphql"...
		HTTP = Новый HTTPСоединение("graphql.awdev.pro", 443,,,, 10, Новый ЗащищенноеСоединениеOpenSSL);

		Попытка

		//	формирование заголовка
			Заголовки = Новый Соответствие;
			Заголовки.Вставить("Authorization", "Bearer Ku7LWeWNrJrD9UtdNs7Ur269om3Yg4anLl4rA6Ip");
			Заголовки.Вставить("Content-Type" , "application/json");

			HTTPЗапрос = Новый HTTPЗапрос("/graphql", Заголовки);
			HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);

			HTTPОтвет = HTTP.ОтправитьДляОбработки(HTTPЗапрос);
			Результат.ТекстJSON = HTTPОтвет.ПолучитьТелоКакСтроку();

			Результат.КодОтвета = HTTPОтвет.КодСостояния;
			ДанныеRFC2616 = СервисыСерверПовтИсп.КодыRFC2616(HTTPОтвет.КодСостояния);

			Результат.Ошибка = НЕ Результат.КодОтвета = 200;
			Результат.ОписаниеОшибки = Формат(Результат.КодОтвета, "ЧДЦ=; ЧН=000; ЧГ=") + Символы.ПС + ДанныеRFC2616.Описание;

		Исключение

			Результат.Ошибка = Истина;
			Результат.ОписаниеОшибки = "помилка надсилання повідомлення: " + ОписаниеОшибки();

		КонецПопытки;	 

	Исключение

		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = "помилка при підключенні до сервера: " + ОписаниеОшибки();

	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
