////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

//Процедура - обработчик команды "ПодобратьИзКлассификатора"
//
&НаКлиенте
Процедура ПодобратьИзКлассификатора(Команда)
	
	ОткрытьФормуМодально("Справочник.БазовыеЕдиницыИзмерения.Форма.КлассификаторЕдиницИзмерения");
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры
