
&НаКлиенте
Процедура КомандаПросмотрИзменений(Команда)
	ПараметрыФормы = Новый Структура("УзелОбмена",Объект.Ссылка);
	ОткрытьФорму("Обработка.РегистрацияИзмененийДляОбменаДанными.Форма.Форма",ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьОбмен(Команда)
	ВыполнитьОбменСервер();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменСервер()
	Параметры_ = ОбменДаннымиКСОСервер.ЗапуститьОбменДаннымиКСО(); 
	Для Каждого Сообщение_ Из Параметры_.РезультатОбмена Цикл
		Сообщить(""+Сообщение_);	
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыСписка = СписокИзменений.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрУзел = ПараметрыСписка.Элементы.Найти("Узел");
	ПараметрУзел.Значение = Объект.Ссылка;
	ПараметрУзел.Использование = Истина;

	ПараметрВидЦены = ПараметрыСписка.Элементы.Найти("ВидЦены");
	ПараметрВидЦены.Значение = Объект.ВидЦенКСО;
	ПараметрВидЦены.Использование = Истина;

КонецПроцедуры
