
&НаСервере
Процедура СохранитьДанныеНаСервере()
	
	//ИД = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.УчетныеЗаписиЭлектроннойПочты");
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.Наименование, Тенант					, "Тенант");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.Наименование, ИдентификаторКлиента	, "ИдентификаторКлиента");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Объект.Наименование, СекретКлиента			, "СекретКлиента");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Команда)
	СохранитьДанныеНаСервере();
	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УчетнаяЗапись") Тогда 
		Объект = Параметры.УчетнаяЗапись;
	Иначе 
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры
