
Функция AccGetSaleData(DateStart, DateEnd, MaketName,EDRPOU)
	УстановитьПривилегированныйРежим(Истина);
	СхемаКомпоновки = ПолучитьОбщийМакет(MaketName);
	Настройки = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаС",НачалоДня(DateStart));   
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаПо",КонецДня(DateEnd));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КодПоЕДРПОУ",EDRPOU);
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновки,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,истина);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);



	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ТаблицаЗначений, НазначениеТипаXML.Явное);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ЗаписьJSON.Закрыть();

КонецФункции


Функция AccGetRealData(DateStart, DateEnd, MaketName, EDRPOU)
		УстановитьПривилегированныйРежим(Истина);

		СхемаКомпоновки = ПолучитьОбщийМакет(MaketName);
	
	Настройки = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаС",НачалоДня(DateStart));   
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаПо",КонецДня(DateEnd));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КодПоЕДРПОУ",EDRPOU);
	  
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновки,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,истина);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ТаблицаЗначений, НазначениеТипаXML.Явное);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ЗаписьJSON.Закрыть();

КонецФункции


Функция AccGetPers(DateStart, DateEnd)
		УстановитьПривилегированныйРежим(Истина);

		СхемаКомпоновки = ПолучитьОбщийМакет("ПерсональныеПродажи");
	
	Настройки = СхемаКомпоновки.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",НачалоДня(DateStart));   
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",КонецДня(DateEnd));
	  
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновки,Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,истина);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, ТаблицаЗначений, НазначениеТипаXML.Явное);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

