 ////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура управляет видимостью и доступностью элементов формы на сервере
//
&НаСервере
Процедура УправлениеЭлементамиФормыНаСервере()
			
	Элементы.Штрихкод.Видимость = ТипСерийногоНомера = Перечисления.ТипыСерийныхНомеровСертификатов.Смешанный
							ИЛИ   ТипСерийногоНомера = Перечисления.ТипыСерийныхНомеровСертификатов.Штриховой;
	
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

//Процедура - обработчик события "ПриСозданииНаСервере" формы
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") Тогда

		Если Параметры.Отбор.Свойство("Владелец") Тогда

			ТипСерийногоНомера = Параметры.Отбор.Владелец.ТипСерийногоНомера;
			Номенклатура       = Параметры.Отбор.Владелец;

		КонецЕсли;

	КонецЕсли;

	Если Параметры.Свойство("ТекущиеДанные") Тогда

		Элементы.Список.ТекущиеДанные = Параметры.ТекущиеДанные;

	КонецЕсли;
	
	// +HVOYA. 25.08.2016 12:17:16, Львова Е.А.
	Если Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.СкидочныйКупон Тогда
	    Заголовок = НСтр("ru = 'Номера скидочных купонов'"); 
		Элементы.Наименование.Заголовок = Строка("Номер скидочного купона");
	КонецЕсли;
	// -HVOYA. 25.08.2016 12:17:20, Львова Е.А.
	
	УправлениеЭлементамиФормыНаСервере();
	
КонецПроцедуры

//Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(, НСтр("ru = 'Не задан владелец - номенклатура'"));	
		
	КонецЕсли;

	Если НЕ Отказ Тогда

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ссылка",, Истина, ВидСравненияКомпоновкиДанных.НеВСписке, Истина);

	КонецЕсли;
	
КонецПроцедуры






