
Функция APIABPOST(Запрос)
	СтрокаЗапроса = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8)));
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаЗапроса);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	СтруктураАдреса = ПолучениеФайловИзИнтернетаКлиентСервер.СтруктураURI(Результат.АдресAPIБанка);
	HTTP = Новый HTTPСоединение(СтруктураАдреса.ИмяСервера,,,,,30, Новый ЗащищенноеСоединениеOpenSSL);
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Authorization", "Basic " + Результат.СтрокаАвторизации);
	
	Если Результат.Метод = "POST" Тогда 
		Заголовки.Вставить("Content-Type", "application/json");
		HTTPЗапрос = Новый HTTPЗапрос(Результат.ИмяПроцедуры, Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(Результат.ТекстЗапроса, КодировкаТекста.UTF8);
		HTTPОтвет = HTTP.ОтправитьДляОбработки(HTTPЗапрос);
	Иначе
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ТекстЗапроса);
		РезультатGET = ПрочитатьJSON(ЧтениеJSON);
		СтрокаЗапроса = "?";
		Для Каждого ЭлементGET Из РезультатGET Цикл
			СтрокаЗапроса = СтрокаЗапроса + ЭлементGET.Ключ + "=" + ЭлементGET.Значение + "&";
		КонецЦикла;
		
		СтрокаЗапроса = Лев(СтрокаЗапроса, СтрДлина(СтрокаЗапроса)-1);
		
		HTTPЗапрос = Новый HTTPЗапрос(Результат.ИмяПроцедуры + СтрокаЗапроса, Заголовки);
		HTTPОтвет = HTTP.Получить(HTTPЗапрос);
	КонецЕсли;
	
	Если HTTPОтвет.КодСостояния = 200 Или HTTPОтвет.КодСостояния = 201 Тогда
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8), КодировкаТекста.UTF8)),КодировкаТекста.UTF8); 
		Ответ.Заголовки.Вставить("Content-Type", "application/octet-stream");
		Ответ.Заголовки.Вставить("Accept", "application/octet-stream");
	Иначе 
		Ответ = Новый HTTPСервисОтвет(400);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции
