Функция ПолучитьПараметрыПодключения()
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("Сервер","api.alerts.in.ua");
	ПараметрыПодключения.Вставить("Порт",443);
	ПараметрыПодключения.Вставить("Токен","36619877bb75f990fb6545b89bb6c15752fbd73aab2203"); 
	ПараметрыПодключения.Вставить("Ресурс","/v1/alerts/active.json"); 
	
	Возврат ПараметрыПодключения;
КонецФункции

Функция ПолучитьАктивныеТревоги() Экспорт
	ПараметрыПодключения = ПолучитьПараметрыПодключения();
	ХТТПСоединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер,ПараметрыПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	ХТТПЗапрос = Новый HTTPЗапрос(ПараметрыПодключения.Ресурс);
	ХТТПЗапрос.Заголовки.Вставить("Authorization", "Bearer "+ПараметрыПодключения.Токен);
	ХТТПОтвет = ХТТПСоединение.Получить(ХТТПЗапрос);
	Если ХТТПОтвет.КодСостояния <> 200 Тогда
		Возврат Новый Структура("Успешно,КодСостояния,ОписаниеОшибки",Ложь,ХТТПОтвет.КодСостояния,ХТТПОтвет.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	СтруктураОтвета = ОбменWebRetailСервер.ТекстДЖСОНвСтруктуру(ХТТПОтвет.ПолучитьТелоКакСтроку()); 
	
	Возврат СтруктураОтвета;
КонецФункции

Функция ПолучитьИсториюТревогПоТерритории(КодТерритории)
	ПараметрыПодключения = ПолучитьПараметрыПодключения();
	ХТТПСоединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер,ПараметрыПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	ХТТПЗапрос = Новый HTTPЗапрос("/v1/regions/"+СтрЗаменить(КодТерритории,Символы.НПП,"")+"/alerts/month_ago.json");
	ХТТПЗапрос.Заголовки.Вставить("Authorization", "Bearer "+ПараметрыПодключения.Токен);
	ХТТПОтвет = ХТТПСоединение.Получить(ХТТПЗапрос);
	Если ХТТПОтвет.КодСостояния <> 200 Тогда
		Возврат Новый Структура("Успешно,КодСостояния,ОписаниеОшибки",Ложь,ХТТПОтвет.КодСостояния,ХТТПОтвет.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	СтруктураОтвета = ОбменWebRetailСервер.ТекстДЖСОНвСтруктуру(ХТТПОтвет.ПолучитьТелоКакСтроку()); 
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолучитьИсториюТревогЗаМесяц() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Магазины.Город КАК Город,
	               |	Магазины.Город.КодТерритории КАК КодТерритории
	               |ИЗ
	               |	Справочник.Магазины КАК Магазины
	               |ГДЕ
	               |	Магазины.Блокирован = ЛОЖЬ
	               |	И Магазины.ВведенВЭксплуатацию = ИСТИНА
	               |	И Магазины.Город.КодТерритории > 0"; 
	Рез_ = Запрос.Выполнить().Выбрать();
	Пока Рез_.Следующий() Цикл
		СтруктураОтвета = ПолучитьИсториюТревогПоТерритории(Рез_.КодТерритории);
		ЗаписатьКартуТревог(СтруктураОтвета);	
	КонецЦикла;
	
	
КонецФункции

Функция ПолучитьНезакрытуюЗапись(СтруктураТревоги)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	КартаТревог.Период КАК Период,
	               |	КартаТревог.КодТерритории КАК КодТерритории,
	               |	КартаТревог.НазваниеТерритории КАК НазваниеТерритории,
	               |	КартаТревог.ДатаОкончания КАК ДатаОкончания,
	               |	КартаТревог.ТипТерритории КАК ТипТерритории,
	               |	КартаТревог.ТипТревоги КАК ТипТревоги,
	               |	КартаТревог.Примечание КАК Примечание
	               |ИЗ
	               |	РегистрСведений.КартаТревог КАК КартаТревог
	               |ГДЕ
	               |	КартаТревог.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	               |	И КартаТревог.КодТерритории = &КодТерритории";
	Запрос.УстановитьПараметр("КодТерритории", СтруктураТревоги.location_uid);
	Рез =	Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		СтруктураОтвета = Новый Структура("КодТерритории,Период");
		ЗаполнитьЗначенияСвойств(СтруктураОтвета,Рез);
		Возврат СтруктураОтвета;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьКартуТревог(СтруктураОтвета) Экспорт 
	Если ТипЗнч(СтруктураОтвета)<> Тип("Структура") 
		ИЛИ Не СтруктураОтвета.Свойство("alerts")
		ИЛИ ТипЗнч(СтруктураОтвета.alerts)<>Тип("Массив")
			Тогда    
			ЗаписьЖурналаРегистрации("КартаТревог",УровеньЖурналаРегистрации.Ошибка,,,"Возвращен неизвестный формат ответа");
		Возврат;
	КонецЕсли;
		
	Для Каждого СтрокаОтвета Из СтруктураОтвета.alerts Цикл
		//2026-07-27 sa видимо в какой-то момент в API карты тревог немного поменялся формат (начали дополнительно разделять районы и области), что стало приводить к 
		//наложении тревог друг на друга в регистре. Поправим.
		СтруктураТекЗаписи = ПолучитьНезакрытуюЗапись(СтрокаОтвета);

		Рег_ = РегистрыСведений.КартаТревог.СоздатьНаборЗаписей();
		Рег_.Отбор.КодТерритории.Установить(ПолучитьЧисло(СтрокаОтвета.location_uid));

		Если СтруктураТекЗаписи = Неопределено Тогда
			Рег_.Отбор.Период.Установить(ПреобразоватьВДату(СтрокаОтвета.started_at));
		Иначе
			Рег_.Отбор.Период.Установить(СтруктураТекЗаписи.Период);
		КонецЕсли;
		Рег_.Прочитать();
		
		Если Рег_.Количество() > 0 Тогда
			СтрокаКартыТревог = Рег_[0];
		Иначе
			СтрокаКартыТревог = Рег_.Добавить(); 
		КонецЕсли;
		
		СтрокаКартыТревог.КодТерритории = СтрокаОтвета.location_uid;
		СтрокаКартыТревог.НазваниеТерритории = СтрокаОтвета.location_title;
		СтрокаКартыТревог.Период = ПреобразоватьВДату(СтрокаОтвета.started_at);
		Если Не ЗначениеЗаполнено(СтрокаОтвета.finished_at) Тогда
			СтрокаКартыТревог.ДатаОкончания = ТекущаяДата();
		Иначе
			СтрокаКартыТревог.ДатаОкончания = ПреобразоватьВДату(СтрокаОтвета.finished_at); 
		КонецЕсли;
		СтрокаКартыТревог.ТипТерритории = СтрокаОтвета.location_type;
		СтрокаКартыТревог.ТипТревоги = СтрокаОтвета.alert_type;
		СтрокаКартыТревог.Примечание = СтрокаОтвета.notes;
		Рег_.Записать(Истина);
	КонецЦикла;
	
	
КонецПроцедуры   

Процедура ОбновитьКартуТревог() Экспорт 
	СтруктураОтвета = ПолучитьАктивныеТревоги();
	ЗаписатьКартуТревог(СтруктураОтвета);
КонецПроцедуры

Функция ПолучитьЧисло(СтрЧисло)
	Если ТипЗнч(СтрЧисло) = Тип("Число") Тогда
		Возврат СтрЧисло;
	Иначе
		СтрЧисло = СтрЗаменить(СтрЧисло," ","");
		Попытка 
			Число_ = Число(СтрЧисло);
		Исключение
			Сообщить("Не вдалося перетворити на число: "+СтрЧисло);
			Число_ = 0;	
		КонецПопытки;

		Возврат Число_;
		
	КонецЕсли;
КонецФункции

Функция ПреобразоватьВДату(СтрДата)
	//Ожидаем дату в формате 2023-10-29T18:22:37.357Z
	СтрДата = СтрЗаменить(СтрДата,"-","");
	СтрДата = СтрЗаменить(СтрДата,"T","");
	СтрДата = СтрЗаменить(СтрДата,":","");
	СтрДата = Лев(СтрДата,14);
	Попытка
		Дата_ = Дата(СтрДата);
	Исключение
		Сообщить("Не вдалося перетворити на дату: "+СтрДата);
		Дата_ = Дата("00010101");
	КонецПопытки;
	
	Возврат Дата_;

КонецФункции   

