#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)


КонецПроцедуры
	
#КонецОбласти

&НаСервере
Процедура ПоказатьВремяСозданияСсылкиНаСервере()

	Если ЗначениеЗаполнено(Запись.Объект) Тогда

		ТекстДобавить = ОбщегоНазначенияКлиентСервер.УникальныйИдентификаторВремя(Запись.Объект.УникальныйИдентификатор());

	Иначе

		ТекстДобавить = "Ссылка не указана.";

	КонецЕсли;

	ТекстоваяИнформация = ТекстоваяИнформация + ?(ПустаяСтрока(ТекстоваяИнформация), "", Символы.ПС) + ТекстДобавить;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВремяСозданияСсылки(Команда)

	ПоказатьВремяСозданияСсылкиНаСервере();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказатьКонтентХранилищаНаСервере(Период, Магазин, Индекс, ТекстоваяИнформация)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаРегистра.Хранилище КАК Хранилище
	|ИЗ
	|	РегистрСведений.ОбъектыДляОбработки КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Период = &Период
	|	И ТаблицаРегистра.Магазин = &Магазин
	|	И ТаблицаРегистра.Индекс = &Индекс"
	);
	Запрос.УстановитьПараметр("Период" , Период);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("Индекс" , Индекс);
	
	Показано = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда

		ДанныеХранилища = Выборка.Хранилище.Получить();

		Если ТипЗнч(ДанныеХранилища) = Тип("Строка") И НЕ ПустаяСтрока(ДанныеХранилища) Тогда

			ТекстоваяИнформация = ТекстоваяИнформация + ?(ПустаяСтрока(ТекстоваяИнформация), "", Символы.ПС) + СокрЛП(ДанныеХранилища);
			Показано = Истина;

		КонецЕсли;

	КонецЕсли;
	
	Возврат Показано;

КонецФункции

&НаКлиенте
Процедура ПоказатьКонтентХранилища(Команда)

	Если НЕ ПоказатьКонтентХранилищаНаСервере(Запись.Период, Запись.Магазин, Запись.Индекс, ТекстоваяИнформация) Тогда

		ПоказатьОповещениеПользователя(
			"Данные хранилища недоступны",
			ПолучитьНавигационнуюСсылку(Запись.Объект),
			"Нет возможности отобразить данные хранилища в текстовом формате",
			БиблиотекаКартинок.Информация32
		);

	КонецЕсли;

КонецПроцедуры
