
&НаКлиенте
Процедура ПринятьИЗакрыть(Команда)

	Закрыть(Новый Структура(
		"КолонкаКоличество, КолонкаКод, ПерваяСтрокаДанных"
		, КолонкаКоличество, КолонкаКод, ПерваяСтрокаДанных));

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если КолонкаКод = 0 ИЛИ КолонкаКоличество = 0 ИЛИ ПерваяСтрокаДанных = 0 Тогда

		Документы.ВедомостьИнвентаризационная.ПараметрыЗагрузкиИзТаблицыExcel(КолонкаКод, КолонкаКоличество, ПерваяСтрокаДанных);

	КонецЕсли;

КонецПроцедуры
