
Функция ПолучитьСотрудникаПоВнутренниемуНомеру(ВнутреннийНомер) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботаСотрудниковКоллЦентра.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.РаботаСотрудниковКоллЦентра КАК РаботаСотрудниковКоллЦентра
	|ГДЕ
	|	РаботаСотрудниковКоллЦентра.ВнутреннийНомер = &ВнутреннийНомер
	|	И РаботаСотрудниковКоллЦентра.Период = &Период";
	Запрос.УстановитьПараметр("ВнутреннийНомер", СокрЛП(ВнутреннийНомер)); //Строка 
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДата())); //Строка 
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда 
		Возврат Результат.Сотрудник;	
	Иначе 
		Возврат Справочники.СотрудникиКоллЦентра.ПустаяСсылка();	
	КонецЕсли;	
	
КонецФункции	