
&НаСервере
Процедура Печать1на1НаСервере()
КонецПроцедуры

&НаКлиенте
Процедура Печать1на1(Команда)

		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьОбратнойСтороныЦенников",
				"1на1",
				Объект.ЦеныНаДату,
				Неопределено,
				Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура Печать2на2(Команда)
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьОбратнойСтороныЦенников",
				"2на2",
				Объект.ЦеныНаДату,
				Неопределено,
				Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Печать3на5(Команда)
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьОбратнойСтороныЦенников",
				"3на5",
				Объект.ЦеныНаДату,
				Неопределено,
				Неопределено);
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Печать7на5(Команда)
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьОбратнойСтороныЦенников",
				"7на5",
				Объект.ЦеныНаДату,
				Неопределено,
				Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ЦеныНаДату = ТекущаяДата();
КонецПроцедуры
