///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;

	Если РазрешитьРедактированиеХозяйственнаяОперация Тогда
		Результат.Добавить("ХозяйственнаяОперация");
	КонецЕсли;
	Если РазрешитьРедактированиеСтатьяХозяйственнойОперацииПоУмолчанию Тогда
		Результат.Добавить("СтатьяХозяйственнойОперацииПоУмолчанию");
	КонецЕсли;
	
	Закрыть(Результат);

КонецПроцедуры