#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция СтатусОтменыДокумента(ПредыдущийСтатус) Экспорт
	
	Если ПредыдущийСтатус = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Новый Тогда
	
		Результат = Отменён;
	
	Иначе
		
		Если ПредыдущийСтатус = ВРаботе
				Или ПредыдущийСтатус = Согласован
				Или ПредыдущийСтатус = Изменён
				Или ПредыдущийСтатус = Сборка
				Или ПредыдущийСтатус = ПодтвердитьОтменуОтправитель
				Или ПредыдущийСтатус = КОтправке Тогда
			
			Результат = ПодтвердитьОтменуОтправитель;
			
		Иначе
			
			Результат = ПодтвердитьОтменуПолучатель;

		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#КонецЕсли	