
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает данные интернет-заказа в регистр.
//
// Параметры:
//  ДанныеЗаказа - Строка - Данные заказа в формате JSON
//  НомерЗаписи - Число - Порядковый номер попытки записи
//  ТекстОшибки - Строка - Текст ошибки
//  Отказ - Булево - Признак возникновения ошибки при записи
Процедура ЗаписатьЗаказ(ДанныеЗаказа, НомерЗаписи, ТекстОшибки, Отказ) Экспорт
	
	Попытка
			
		ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA256);
		ХешированиеДанных.Добавить(ТекстОшибки);
		СтрокаХеша = СокрЛП(Base64Строка(ХешированиеДанных.ХешСумма));

		МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.ВремяПолучения = ТекущаяУниверсальнаяДатаВМиллисекундах() + НомерЗаписи * 60000;
		МенеджерЗаписи.ПолученныеДанные = Новый ХранилищеЗначения(ДанныеЗаказа);
		МенеджерЗаписи.ПоследняяОшибка = Новый ХранилищеЗначения(ТекстОшибки);
		МенеджерЗаписи.УникальныйИдентификатор = Новый УникальныйИдентификатор();
		МенеджерЗаписи.КоличествоПолучений = НомерЗаписи;
		МенеджерЗаписи.ХешОшибки = СтрокаХеша;
		МенеджерЗаписи.Записать(); 
		
	Исключение
		 
		 Отказ = Истина;
		 
	КонецПопытки;

КонецПроцедуры

// Удаляет запись регистра по уникальному идентификатору.
//
// Параметры:
//   УникальныйИдентификатор - УникальныйИдентификатор - идентификатор удаляемой записи
Процедура УдалитьЗаписьРегистра(УникальныйИдентификатор) Экспорт
	
	Наборзаписей = СоздатьНаборЗаписей();
	Наборзаписей.Отбор.УникальныйИдентификатор.Установить(УникальныйИдентификатор);
	Наборзаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
