
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестПодключения(Команда)
	ТестированиеПодключения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ТестированиеПодключения()
	
	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("АдресСервера", 	Объект.АдресСервера);
	НастройкиПодключения.Вставить("Порт", 			Объект.Порт);
	НастройкиПодключения.Вставить("Таймаут", 		Объект.Таймаут);
	НастройкиПодключения.Вставить("Токен", 			Объект.Токен);
		
	ТекстСообщения = "";
	
	ВыполнитьТестовоеПодключениеКСайту(НастройкиПодключения, ТекстСообщения);
	
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьТестовоеПодключениеКСайту(НастройкиПодключения, ТекстСообщения)
	
	ОтветОк = ОповещенияПользователей.ОправитьЗапросНаСерверТелеграм("getMe", НастройкиПодключения, Новый Структура,, ТекстСообщения);

	Возврат ОтветОк;
	
КонецФункции

#КонецОбласти













	