//	LNK 24.04.2019 10:35:37
Процедура ЗаписатьСвойство(Имя, Знач Значение, ЗаписьJSON, Точность = Неопределено)	Экспорт

	Перем ЗначениеПравое;

	Если Точность = Неопределено Тогда

		ЗначениеЛевое = Значение;

	ИначеЕсли НЕ ТипЗнч(Значение) = Тип("Число") Тогда

		ЗначениеЛевое = Значение;

	Иначе

		ЗначениеЛевое  = Цел(Значение);
		ЗначениеПравое = Окр(Макс(Значение, -Значение) - Макс(ЗначениеЛевое, -ЗначениеЛевое), Точность);	//	возьмём по модулю.

		Если ЗначениеПравое = 0 Тогда
			
			ЗначениеПравое = ОбщегоНазначенияКлиентСервер.REPEAT("0", Точность);

		Иначе

			ЗначениеПравое = Формат(ЗначениеПравое * Pow(10, Точность), "ЧДЦ=; ЧВН=; ЧГ=; ЧЦ=" + Точность);

		КонецЕсли;

	КонецЕсли;

	ЗаписьJSON.ЗаписатьИмяСвойства(Имя);
	ЗаписьJSON.ЗаписатьЗначение(ЗначениеЛевое);

	Если НЕ (ЗначениеПравое = Неопределено ИЛИ ПустаяСтрока(ЗначениеПравое)) Тогда

		ЗаписьJSON.ЗаписатьБезОбработки("." + ЗначениеПравое);

	КонецЕсли;

КонецПроцедуры

Функция БулевоКакЧисло(Значение)	Экспорт

	Возврат ?(Значение = Истина, 1, 0);

КонецФункции

Функция ЧислоКакБулево(Значение)	Экспорт

	Возврат ?(Значение <= 0, Ложь, Истина);

КонецФункции
#Область СериализацияJSON

// Преобразует значение в строку JSON при помощи метода глобального контекста ЗаписатьJSON.
// Допускаются не все типы значений, подробности см. в синтакс-помощнике.
// Даты преобразуются в формат ISO (YYYY-MM-DDThh:mm:ssZ).
// 
// Параметры:
//  Значение - Произвольный
//
// Возвращаемое значение:
//  Строка
//
Функция ЗначениеВJSON(Знач Значение) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Преобразует строку в формате JSON в значение при помощи метода глобального контекста ПрочитатьJSON.
// См. ограничения в синтакс-помощнике.
// Объекты JSON по умолчанию преобразует в значения типа Соответствие. 
// Имена свойств со значением типа Дата необходимо явно указывать, чтобы было выполнено преобразование.
// Ожидаемый формат дат - ISO (YYYY-MM-DDThh:mm:ssZ).
// 
// Параметры:
//   Строка - Строка - значение в формате JSON.
//   ИменаСвойствСоЗначениямиДата - Строка - имя свойства, содержащее значение типа Дата. Допустимо указывать несколько
//                                           свойств через запятую.
//                                - Массив из Строка 
//   ПрочитатьВСоответствие       - Булево - если Ложь, то объекты JSON будут преобразованы в значение типа Структура.
//   
// Возвращаемое значение:
//  Произвольный
//
Функция JSONВЗначение(Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина) Экспорт
	
	Если ТипЗнч(ИменаСвойствСоЗначениямиДата) = Тип("Строка") Тогда
		ИменаСвойствСоЗначениямиДата = СтрРазделить(ИменаСвойствСоЗначениямиДата, ", " + Символы.ПС, Ложь);
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	
КонецФункции

#КонецОбласти

