#Область ОпределениеКассККМ			//	LNK 03.01.2024 07:50:50

//	LNK 03.01.2024 07:51:29
Функция ПолучитьТаблицуКассПоРабочемуМесту(РабочееМесто, Магазин)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСправочник.Ссылка КАК КассаККМ,
	|	ТаблицаСправочник.Владелец КАК Организация,
	|	ЗНАЧЕНИЕ(Документ.КассоваяСмена.ПустаяСсылка) КАК КассоваяСмена
	|ИЗ
	|	Справочник.КассыККМ КАК ТаблицаСправочник
	|ГДЕ
	|	ТаблицаСправочник.РабочееМесто = &РабочееМесто
	|	И ТаблицаСправочник.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ФискальныйРегистратор)
	|	И НЕ ТаблицаСправочник.ПометкаУдаления
	|	И (ТаблицаСправочник.Магазин = &Магазин
	|			ИЛИ &Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка))"
	);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	Запрос.УстановитьПараметр("Магазин"     , Магазин);
	
	ТаблицаКассККМ = Запрос.Выполнить().Выгрузить();

	Для каждого СтрокаТаблицы Из ТаблицаКассККМ Цикл

		СтрокаТаблицы.КассоваяСмена = РозничныеПродажиСервер.ПолучитьОткрытуюКассовуюСмену(
			  СтрокаТаблицы.КассаККМ
			,
			, НачалоДня(ТекущаяДата())
			, '00010101'
		);

	КонецЦикла;

	Возврат ТаблицаКассККМ;

КонецФункции

#КонецОбласти

#Область ПоддержкаРаботыСКупонами	//	LNK 06.09.2021 08:03:09

Функция ПолучитьШаблонЧека(Шаблон)	Экспорт

	СтрокиШаблона = Новый Массив;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.QRкод КАК QRкод,
	|	ТабличнаяЧасть.Строка КАК СтрокаТекста
	|ИЗ
	|	Справочник.ШаблоныЧеков.СтрокиПодвала КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Шаблон"
	);
	Запрос.УстановитьПараметр("Шаблон", Шаблон);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() цикл

			СтрокиШаблона.Добавить(Новый Структура(
				"QRкод, СтрокаТекста"
				, Выборка.QRкод, СокрЛП(Выборка.СтрокаТекста))
			);

		КонецЦикла;

	КонецЕсли;

	Возврат СтрокиШаблона;

КонецФункции

#КонецОбласти

