#Область ПоддержкаРаботыСКупонами	//	LNK 06.09.2021 08:03:09

Функция ПолучитьШаблонЧека(Шаблон)	Экспорт

	СтрокиШаблона = Новый Массив;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.QRкод КАК QRкод,
	|	ТабличнаяЧасть.Строка КАК СтрокаТекста
	|ИЗ
	|	Справочник.ШаблоныЧеков.СтрокиПодвала КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Шаблон"
	);
	Запрос.УстановитьПараметр("Шаблон", Шаблон);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() цикл

			СтрокиШаблона.Добавить(Новый Структура(
				"QRкод, СтрокаТекста"
				, Выборка.QRкод, СокрЛП(Выборка.СтрокаТекста))
			);

		КонецЦикла;

	КонецЕсли;

	Возврат СтрокиШаблона;

КонецФункции


#КонецОбласти

