
Функция ПолучитьСотрудникаПользователя(Пользователь) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиКоллЦентра.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.СотрудникиКоллЦентра КАК СотрудникиКоллЦентра
	|ГДЕ
	|	СотрудникиКоллЦентра.Владелец = &Пользователь
	|	И СотрудникиКоллЦентра.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиКоллЦентра.Ссылка";
	Запрос.УстановитьПараметр("Пользователь", Пользователь); //Пользователь
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда 
		Возврат Результат.Сотрудник;
	Иначе 
		Возврат Справочники.СотрудникиКоллЦентра.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьВидУведомленияСотрудника(Пользователь) Экспорт  

	Сотрудник = ПолучитьСотрудникаПользователя(Пользователь);
	
	Если Сотрудник = Справочники.СотрудникиКоллЦентра.ПустаяСсылка() Тогда 
		Возврат Перечисления.ВидыУведомленийВходящегоЗвонка.НеУведомлять;
	КонецЕсли;	                                                         
	
	Возврат Сотрудник.ВидУведомленияОЗвонке;
	
КонецФункции
