
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура("ТестовыйРежимРМК", Истина);

	ИмяФормы = ?(ПустаяСтрока(ОбщегоНазначенияРТ.ИмяВнешнегоРМК())
			, "Обработка.РМК"
			, "ВнешняяОбработка." + ОбщегоНазначенияРТ.ИмяВнешнегоРМК()
		) + ".Форма.Форма";

	ОткрытьФорму(ИмяФормы
		, ПараметрыФормы
		, ПараметрыВыполненияКоманды.Источник
		, ПараметрыВыполненияКоманды.Уникальность
		, ПараметрыВыполненияКоманды.Окно
		, ПараметрыВыполненияКоманды.НавигационнаяСсылка
	);

КонецПроцедуры
