#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаСобытийИнтернетМагазина(Назначение) Экспорт
	
	Если Назначение = "РаспределитьЗаказы" Тогда 
		
		Документы.ЗаказПокупателя.РаспределениеЗаказов(); 
		
	ИначеЕсли Назначение = "АвтоСтатус" Тогда
		
		ЗаказыПокупателейСервер.АвтоматическоеИзменениеСтатусов();
		
	ИначеЕсли Назначение = "ПродажаПоЧеку" Тогда
		
		ЗаказыПокупателейСервер.АвтоматическаяПродажаПоЧеку();
		
	ИначеЕсли Назначение = "Перемещения" Тогда
		
		ЗаказыПокупателейСервер.СозданиеПеремещений();
		
	КонецЕсли;

КонецПроцедуры   

#КонецОбласти

