#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаСобытийИнтернетМагазина(Назначение, ДополнительныйПараметр = "") Экспорт
	
	Если Назначение = "РаспределитьЗаказы" Тогда 
		
		Документы.ЗаказПокупателя.РаспределениеЗаказов(); 
		
	ИначеЕсли Назначение = "АвтоСтатус" Тогда
		
		ЗаказыПокупателейСервер.АвтоматическоеИзменениеСтатусов();
		
	ИначеЕсли Назначение = "Перемещения" Тогда
		
		ЗаказыПокупателейСервер.СозданиеПеремещений();
		
	ИначеЕсли Назначение = "Отмена72Часа" Тогда
		
		ЗаказыПокупателейСервер.ОтменаРезерваЗаказаПоВремени();
		
	ИначеЕсли Назначение = "СообщениеОСрокеРезерва" Тогда
		
		ЗаказыПокупателейСервер.СообщениеОСрокеРезерва();
		
	ИначеЕсли Назначение = "АвтоПечатьЧеков" Тогда
		
		ЗаказыПокупателейСервер.АвтоПечатьЧеков(ДополнительныйПараметр);
		
	КонецЕсли;

КонецПроцедуры   

#КонецОбласти

