&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьПараметрыИсточникаДанных();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры

&НаСервере	//	LNK 14.05.2021 11:10:52
Процедура УстановитьПараметрыИсточникаДанных()

	Если ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Элементы.АкционнаяЦена.Видимость = Ложь;
		Список.Параметры.УстановитьЗначениеПараметра("Магазин", Неопределено);

	Иначе

		Элементы.АкционнаяЦена.Видимость = Истина;
		Список.Параметры.УстановитьЗначениеПараметра("Магазин", ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);

	КонецЕсли;

КонецПроцедуры
