
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НомерТелефона") И Не ПустаяСтрока(Параметры.НомерТелефона) Тогда
		Телефон = Параметры.НомерТелефона;
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") Тогда
		Клиент = Параметры.Контрагент;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаказКлиента") Тогда
		ЗаказКлиента = Параметры.ЗаказКлиента;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда) 
	
	ОтправитьСообщениеНаСервере();
	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеНаСервере()
	
	ДатаСообщения = ТекущаяДатаСеанса();
	
	СтруктураСообщенияКлиенту = РегистрыСведений.СообщениеКлиенту.СтруктураЗаписиРегистра(); 
	
	СтруктураСообщенияКлиенту.Дата 						= ДатаСообщения;
	СтруктураСообщенияКлиенту.ИДСообщения 				= "Новое";
	СтруктураСообщенияКлиенту.ТекстСообщения 			= ТекстСообщенияКлиенту;
	СтруктураСообщенияКлиенту.ТипСообщения 				= Перечисления.ТипыСообщенийКлиенту.Viber;
	СтруктураСообщенияКлиенту.СостояниеСообщения 		= Перечисления.СостояниеСообщенийКлиенту.Новое;
	СтруктураСообщенияКлиенту.Телефон 					= Телефон;
	СтруктураСообщенияКлиенту.ДатаСледующейОтправки 	= ДатаСообщения; 
	
	РегистрыСведений.СообщениеКлиенту.ЗаписьСообщенияВРегистр(СтруктураСообщенияКлиенту);  
	
	РегистрыСведений.КомментарийИнтернетЗаказа.ЗаписьКомментария(ЗаказКлиента, ПараметрыСеанса.ТекущийПользователь, ТекстСообщенияКлиенту);  

КонецПроцедуры