#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)	//	LNK 14.01.2021 12:09:23

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя("РазрешитьИзменениеПрефиксаКартыДисконта", Ложь) = Истина Тогда

		ВызватьИсключение "Отказано! Изменение запрещено.";

	КонецЕсли;

	Значение = СокрЛП(Значение);

КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
