 
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Функция осуществляет подключение устройства.
//
// Параметры:
//  ОбъектДрайвера   - <*>
//           - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	Результат = Истина;
	ВыходныеПараметры = Новый Массив();
	ПараметрыПодключения.Вставить("ИДУстройства", Неопределено);

	// Проверка настроенных параметров
	АдресУстройства			= Неопределено;
	ПортУстройства			= Неопределено;
	МногострочныйДисплей 	= Истина;
	Таймаут			= Неопределено;
	КолвоПовторов	= Неопределено;
	Параметры.Свойство("АдресУстройства",			АдресУстройства);
	Параметры.Свойство("ПортУстройства",			ПортУстройства);
	Параметры.Свойство("МногострочныйДисплей",		МногострочныйДисплей);
	//Параметры.Свойство("Таймаут",		Таймаут);
	//Параметры.Свойство("КолвоПовторов", КолвоПовторов);
	
	Если ПортУстройства = Неопределено
		ИЛИ АдресУстройства = Неопределено
		//ИЛИ КолвоПовторов = Неопределено 
		Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Не настроены параметры устройства.
		|Для корректной работы устройства необходимо задать параметры его работы.
		|Сделать это можно при помощи формы ""Настройка параметров"" модели
		|подключаемого оборудования в форме ""Подключение и настройка оборудования"".'"));

		Результат = Ложь;
	КонецЕсли;

	МассивЗначений = Новый Массив;
	МассивЗначений.Добавить(Параметры.АдресУстройства);
	МассивЗначений.Добавить(Параметры.ПортУстройства);
	МассивЗначений.Добавить(Параметры.МногострочныйДисплей);
	//МассивЗначений.Добавить(Параметры.Таймаут);
	//МассивЗначений.Добавить(Параметры.КолвоПовторов);
	
	Если Результат Тогда
		//Ответ = ОбъектДрайвера.Подключить(МассивЗначений, ПараметрыПодключения.ИДУстройства);
		//Если НЕ Ответ Тогда
		//	ВыходныеПараметры.Добавить(999);
		//	ВыходныеПараметры.Добавить(ОбъектДрайвера.ТекстОшибки);
		//	Результат = Ложь;
		//КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция осуществляет отключение устройства.
//
// Параметры:
//  ОбъектДрайвера - <*>
//         - ОбъектДрайвера драйвера торгового оборудования.
//
// Возвращаемое значение:
//  <Булево> - Результат работы функции.
//
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	Результат = Истина;

	ВыходныеПараметры = Новый Массив();

	Возврат Результат;

КонецФункции

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено,
                         ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт

	Результат = Истина;

	ВыходныеПараметры = Новый Массив();

	// Вывод строк на дисплей
	Если Команда = "ВывестиСтрокуНаДисплейПокупателя" ИЛИ Команда = "DisplayText" Тогда
		Результат = ВывестиСтрокуНаДисплейПокупателя(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);

	ИначеЕсли Команда = "ВывестиТекстНаДисплейПокупателя" ИЛИ Команда = "PrintText" Тогда
		Результат = ВывестиТекстНаДисплейПокупателя(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
	// Очистка дисплея
	ИначеЕсли Команда = "ОчиститьДисплейПокупателя" ИЛИ Команда = "ClearText" Тогда
		Результат = ОчиститьДисплейПокупателя(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Тестирование устройства
	ИначеЕсли Команда = "ТестУстройства" ИЛИ Команда = "CheckHealth" Тогда
		Результат = ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Получить параметры вывода
	ИначеЕсли Команда = "ПолучитьПараметрыВывода" Тогда
		Результат = ПолучитьПараметрыВывода(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	// Получение версии драйвера
	ИначеЕсли Команда = "ПолучитьВерсиюДрайвера" Тогда
		Результат = ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	ИначеЕсли Команда = "ПолучитьОписаниеДрайвера" Тогда
		Результат = ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	// Указанная команда не поддерживается данным драйвером
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Команда ""%Команда%"" не поддерживается данным драйвером.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		Результат = Ложь;

	КонецЕсли;

	Возврат Результат;

КонецФункции

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция осуществляет вывод списка строк на дисплей покупателя.
//
Функция ВывестиСтрокуНаДисплейПокупателя(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)

	Результат = Истина;

	Если ВходныеПараметры.Количество()=0 Тогда
		Результат = Ложь;
		ОбъектДрайвера.ОписаниеОшибки = "Немає інформації для виведення на дисплей покупця";
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеОшибки);
		Возврат Результат;
	КонецЕсли;
	
	МассивСтрок = ВходныеПараметры[0];

	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("COMMAND","DISPLAY");
	СтруктураПараметров.Вставить("GOODS", МассивСтрок);

    СтрокаКоманды = СтруктуруВТекстДЖСОН(СтруктураПараметров);
	
	Ответ = ОтправитьДанныеНаМониторПокупателя(ОбъектДрайвера, Параметры, СтрокаКоманды);
	Если Не Ответ Тогда
		Результат = Ложь;
		ОбъектДрайвера.ОписаниеОшибки = "";
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеОшибки);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции 

// Функция осуществляет вывод текста на дисплей покупателя.
//
Функция ВывестиТекстНаДисплейПокупателя(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры)

	Результат = Истина;    

	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("COMMAND","PRINTTEXT");
	СтруктураПараметров.Вставить("TEXT",СокрЛП(ВходныеПараметры[0]));
	Если ВходныеПараметры.Количество()>1 Тогда
		СтруктураПараметров.Вставить("COLOR",ВходныеПараметры[1]);
	Иначе
		СтруктураПараметров.Вставить("COLOR","#0000FF");
	КонецЕсли;
	
	
    СтрокаКоманды = СтруктуруВТекстДЖСОН(СтруктураПараметров);
	СтрокаКоманды = СтрЗаменить(СтрокаКоманды,"\\n","\n");
	
	Ответ = ОтправитьДанныеНаМониторПокупателя(ОбъектДрайвера, Параметры, СтрокаКоманды);
	Если Не Ответ Тогда
		Результат = Ложь;
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеОшибки);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ОтправитьДанныеНаМониторПокупателя(ОбъектДрайвера, Параметры,СтрокаКоманды) 
	Результат = Ложь;
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(Параметры.АдресУстройства,Параметры.ПортУстройства);
		HTTPЗапрос = Новый HTTPЗапрос("/"); 
		                                                                                                     
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаКоманды, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
		
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос); 
		
		Если Ответ.КодСостояния = 200 Тогда
			Результат_ = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8); 
			СтруктураОтвета = ТекстДЖСОНвСтруктуру(Результат_);
			Если СтруктураОтвета.Свойство("status") И СтруктураОтвета.status = "ok" Тогда
				ОбъектДрайвера.ОписаниеОшибки = ""; //все ок, обнуляем ошибку.
				Результат = Истина;
			Иначе
				ОбъектДрайвера.ОписаниеОшибки = "Дисплей покупателя не принял данные."+Символы.ПС+""+Результат_;
			КонецЕсли;
		Иначе
			ОбъектДрайвера.ОписаниеОшибки = "Нет связи с дисплеем покупателя"+Символы.ПС+"КодСостояния: "+Ответ.КодСостояния;
		КонецЕсли;
	Исключение
		ОбъектДрайвера.ОписаниеОшибки = "Ошибка: "+ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
КонецФункции


// Функция осуществляет очистку дисплея покупателя.
//
Функция ОчиститьДисплейПокупателя(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;
	ВходныеПараметры = Новый Массив;
	//ВходныеПараметры.Добавить("ЛАСКАВО ПРОСИМО!"); //начальная фраза на дисплее.
	ВходныеПараметры.Добавить(Новый Массив);
	Ответ = ВывестиСтрокуНаДисплейПокупателя(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);

	Если Не Ответ Тогда
		Результат = Ложь;
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеОшибки);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Функция возвращает параметры вывода на дисплей покупателя)
Функция ПолучитьПараметрыВывода(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;
	ВыходныеПараметры.Очистить();  
	ВыходныеПараметры.Добавить(200); 	//ширина дисплея в символах
	ВыходныеПараметры.Добавить(200);	//количество строк на дисплее
	ВыходныеПараметры.Добавить(Истина); //многострочный дисплей (по этому параметру определяем что этот дисплей автомасштабируется)
		
	Возврат Результат;

КонецФункции

// Функция осуществляет тестирование устройства.
//
Функция ТестУстройства(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	Результат = ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	Если НЕ Результат Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Ошибка при подключении устройства'"));
	Иначе
		ВходныеПараметры = Новый Массив;
		ВходныеПараметры.Добавить("Тест пристрою\nуспішно");
		Результат = ВывестиТекстНаДисплейПокупателя(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры);
		МенеджерОборудованияКлиент.Пауза(5);
		Если Результат Тогда                
			ОчиститьДисплейПокупателя(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
			
			ВыходныеПараметры.Добавить(0);
			ВыходныеПараметры.Добавить(НСтр("ru='Тест успешно выполнен'"));
		КонецЕсли;
	КонецЕсли;

	ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);

	Возврат Результат;

КонецФункции

// Функция возвращает версию установленного драйвера
//
Функция ПолучитьВерсиюДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;

	ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	ВыходныеПараметры.Добавить(НСтр("ru='Не определена'"));

	Попытка
		ВыходныеПараметры[1] = ОбъектДрайвера.Версия;
	Исключение
	КонецПопытки;

	Возврат Результат;

КонецФункции    

// Функция возвращает описание установленного драйвера
//
Функция ПолучитьОписаниеДрайвера(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры)

	Результат = Истина;
	ВыходныеПараметры.Очистить();
	Если ОбъектДрайвера <> Неопределено Тогда
		ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
		ВыходныеПараметры.Добавить(ОбъектДрайвера.Версия);
		ВыходныеПараметры.Добавить(НСтр("ru='Драйвер дисплея покупателя RedHead'"));
		ВыходныеПараметры.Добавить(ОбъектДрайвера.ОписаниеДрайвера);
	Иначе
		ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
		ВыходныеПараметры.Добавить("");
		ВыходныеПараметры.Добавить(НСтр("ru='Драйвер дисплея покупателя RedHead'"));
		ВыходныеПараметры.Добавить();
	КонецЕсли;
	
	ВыходныеПараметры.Добавить(НСтр("ru='Дисплей покупателя'"));
	ВыходныеПараметры.Добавить("1");
	ВыходныеПараметры.Добавить(Ложь);
	ВыходныеПараметры.Добавить(Истина);
	ВыходныеПараметры.Добавить("Redhead Family");
	ВыходныеПараметры.Добавить(Неопределено);
	ВыходныеПараметры.Добавить("");
	
	
	Возврат Результат;

КонецФункции   

Функция ИнициализироватьУстройство() Экспорт
	ОбъектДрайвера = Новый Структура;

	ОбъектДрайвера.Вставить("МногострочныйДисплей",Истина);
	ОбъектДрайвера.Вставить("ДрайверУстройства",ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАнтошкаДисплейПокупателя"));
	ОбъектДрайвера.Вставить("Версия","1.00");
	ОбъектДрайвера.Вставить("ОписаниеДрайвера","Customer display driver (c) Redhead Family 2025");
	ОбъектДрайвера.Вставить("ОписаниеОшибки","");
	
	Возврат ОбъектДрайвера;
	
КонецФункции

//2023-01-05 sa преобразование текста JSON в структуру 
Функция ТекстДЖСОНвСтруктуру(ТекстДЖСОН) Экспорт
	СтруктураОтвета = Новый Структура;
	Если ТекстДЖСОН = "" Тогда
		СтруктураОтвета.Вставить("Success",Ложь);
		СтруктураОтвета.Вставить("Description","Текст не в формате JSON (пустой)!");
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	ФайлJSON = Новый ЧтениеJSON;
	ФайлJSON.УстановитьСтроку(ТекстДЖСОН);
	
	Попытка
		СтруктураОтвета = ПрочитатьJSON(ФайлJSON);
		ФайлJSON.Закрыть();
	Исключение
		СтруктураОтвета.Вставить("Success",Ложь);
		СтруктураОтвета.Вставить("Description","Текст не в формате JSON!"+Символы.ПС+ТекстДЖСОН);
	КонецПопытки;
	
	Возврат СтруктураОтвета;
КонецФункции

Функция СтруктуруВТекстДЖСОН(СтруктураПараметров) Экспорт
	
	ЗаписьДЖСОН = Новый ЗаписьJSON;
	ЗаписьДЖСОН.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьДЖСОН,СтруктураПараметров);
	ТекстДЖСОН = ЗаписьДЖСОН.Закрыть();
	
	Возврат ТекстДЖСОН;
КонецФункции
