
&НаКлиенте
Процедура Выбрать(Команда)
	//ОповеститьОВыборе(Элементы.ТаблицаДанных.ТекущаяСтрока);
	
	Если Элементы.ТаблицаДанных.ТекущаяСтрока = Неопределено Тогда
		Закрыть(Неопределено);
		Возврат;
	КонецЕсли;
		
	
	Если ЭтаФорма.ВернутьРеф Тогда
		Закрыть(ЭтаФорма.ТаблицаДанных.НайтиПоИдентификатору(Элементы.ТаблицаДанных.ТекущаяСтрока).Идентификатор);
	Иначе
		Закрыть(Элементы.ТаблицаДанных.ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьТЗизСписка(Список)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Идентификатор");
	ТЗ.Колонки.Добавить("Наименование");
	
	Для Каждого ТекСтрока из Список Цикл
		  НоваяСтрока = ТЗ.Добавить();
		  НоваяСтрока.Идентификатор = ТекСтрока.Значение;
		  НоваяСтрока.Наименование = ТекСтрока.Представление;
		  
	КонецЦикла;
	
	Возврат ТЗ;
	
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		ЭтаФорма.Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	
	Если Параметры.Свойство("ВернутьРеф") Тогда
		ЭтаФорма.ВернутьРеф = Параметры.ВернутьРеф;
	КонецЕсли;
	
	ВидимостьКнопкиСоздания = ЛОЖЬ;
	Если Параметры.Свойство("ВидимостьКнопкиСоздания") Тогда
		ВидимостьКнопкиСоздания = Параметры.ВидимостьКнопкиСоздания;
	КонецЕсли;
	Элементы.ФормаСоздать.Видимость = ВидимостьКнопкиСоздания;
	
	
	ВидимостьКнопкиСозданияОрганизации = ЛОЖЬ;
	Если Параметры.Свойство("ВидимостьКнопкиСозданияОрганизации") Тогда
		ВидимостьКнопкиСозданияОрганизации = Параметры.ВидимостьКнопкиСозданияОрганизации;
	КонецЕсли;
	Элементы.ФормаСоздатьОрганизацию.Видимость = ВидимостьКнопкиСозданияОрганизации;
	
	
	
	ВидимостьКнопкиЧастноеЛицо = ЛОЖЬ;
	Если Параметры.Свойство("ВидимостьКнопкиЧастноеЛицо") Тогда
		ВидимостьКнопкиЧастноеЛицо = Параметры.ВидимостьКнопкиЧастноеЛицо;
	КонецЕсли;
	Элементы.ФормаЧастноеЛицо.Видимость = ВидимостьКнопкиЧастноеЛицо;
	
	
	ВидимостьКнопкиЧастноеЛицоВводПоСтроке = ЛОЖЬ;
	Если Параметры.Свойство("ВидимостьКнопкиЧастноеЛицоВводПоСтроке") Тогда
		ВидимостьКнопкиЧастноеЛицоВводПоСтроке = Параметры.ВидимостьКнопкиЧастноеЛицоВводПоСтроке;
	КонецЕсли;
	Элементы.ФормаЧастноеЛицоВводПоСтроке.Видимость = ВидимостьКнопкиЧастноеЛицоВводПоСтроке;
	
	
	Данные = Параметры.Данные; 	
	
	Если Параметры.Свойство("Отбор") Тогда
		ТЗ = Данные.Выгрузить(Параметры.Отбор);
	Иначе
		
		Если ТипЗнч(Данные) = Тип("СписокЗначений") Тогда
			ТЗ = СформироватьТЗизСписка(Данные);
		Иначе
			ТЗ = Данные.Выгрузить();			
		КонецЕсли;
 
	КонецЕсли;
	
	Если Параметры.Свойство("Данные2") Тогда
		Если Параметры.Свойство("Отбор") Тогда
			ТЗ2 = Параметры.Данные2.Выгрузить(Параметры.Отбор);
		Иначе
			ТЗ2 = Параметры.Данные2.Выгрузить(); 
		КонецЕсли;	
		
		Для Каждого ТекСтрокаТЗ2 из ТЗ2 Цикл
			НоваяСтрокаТЗ = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ,ТекСтрокаТЗ2);
		КонецЦикла;
		
	КонецЕсли;
	
	
	Если Параметры.Свойство("СписокКолонок") Тогда
		СписокКолонок = Параметры.СписокКолонок;
	Иначе
		СписокКолонок = Неопределено;
	КонецЕсли;
	
	
	МассивТипаВыбора = Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаВыбора = Новый ОписаниеТипов(МассивТипаВыбора);
	МассивРеквизитов = Новый Массив;
	
	ИмяТЗ = "ТаблицаДанных"; 
	ЗаголовокТЗ = "ТаблицаДанных";
//	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяТЗ, ОписаниеТипаВыбора, "", ЗаголовокТЗ));
	
	
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		ТипыЗначений = Новый Массив;
		Для каждого тТип из Колонка.ТипЗначения.Типы() Цикл
			Если тТип <> Тип("Null") Тогда
				ТипыЗначений.Добавить(тТип);
			КонецЕсли;
		КонецЦикла;
		
		ЗаголовокКолонки = "";
		
		Если СписокКолонок <> Неопределено Тогда
			
			ЭлементСписка = СписокКолонок.НайтиПоЗначению(Колонка.Имя);
			
			Если ЭлементСписка = Неопределено Тогда
				Продолжить;
			Иначе
				ЗаголовокКолонки = ЭлементСписка.Представление;
			Конецесли;
			
			
		КонецЕсли;
		
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов(ТипыЗначений), ИмяТЗ,?(ЗаголовокКолонки = "",Колонка.Имя,ЗаголовокКолонки )));
	КонецЦикла;
	
	
	ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);      
	эТаблица = Элементы[ЗаголовокТЗ];
	
	//эТаблица = Элементы.Добавить(ЗаголовокТЗ, Тип("ТаблицаФормы"));
	//
	//эТаблица.ПутьКДанным = ИмяТЗ;
	эТаблица.Отображение = ОтображениеТаблицы.Список;
	//эТаблица.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	эТаблица.ИзменятьСоставСтрок = Ложь;    
	
	
	//эТаблица.УстановитьДействие("Выбор","ТЗВыбор");	
	
	
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		
		ВидимостьКолонки = Истина;
		
		Если СписокКолонок <> Неопределено Тогда
			
			ЭлементСписка = СписокКолонок.НайтиПоЗначению(Колонка.Имя);
			
			Если ЭлементСписка = Неопределено Тогда
				Продолжить;
			Иначе
				ВидимостьКолонки = ЭлементСписка.Пометка;
			Конецесли;
			
			
		КонецЕсли;
		
		
		НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), эТаблица);
		НовыйЭлемент.ПутьКДанным = ИмяТЗ + "." + Колонка.Имя;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.КнопкаОчистки = Ложь;
		НовыйЭлемент.КнопкаВыбора = Ложь;
		НовыйЭлемент.РедактированиеТекста = Ложь;
		НовыйЭлемент.КнопкаОткрытия = Истина;
		НовыйЭлемент.Видимость = ВидимостьКолонки; 
		
	КонецЦикла;
	
	ЭтаФорма.ЗначениеВРеквизитФормы(ТЗ, ИмяТЗ);
	
	
	Элементы[ИмяТЗ].ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗВыбор(ТЗ, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//	ОповеститьОВыборе(ВыбраннаяСтрока);
	
	Если ВыбраннаяСтрока <> Неопределено Тогда
		
		Если ЭтаФорма.ВернутьРеф Тогда
			Закрыть(ЭтаФорма.ТаблицаДанных.НайтиПоИдентификатору(ВыбраннаяСтрока).Идентификатор);
		Иначе
			Закрыть(ВыбраннаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	Закрыть("00000000-0000-0000-0000-000000000000");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрганизацию(Команда)
	Закрыть("00000000-0000-0000-0000-000000000001");
КонецПроцедуры

&НаКлиенте
Процедура ЧастноеЛицо(Команда)
	Закрыть("00000000-0000-0000-0000-000000000002");
КонецПроцедуры

&НаКлиенте
Процедура ЧастноеЛицоВводПоСтроке(Команда)
	Закрыть("00000000-0000-0000-0000-000000000003");
КонецПроцедуры


