&НаСервере
Процедура ПровестиОтложенныеНаСервере()

	СписокСсылок = Новый Массив;

	Для каждого КлючЗаписи Из Элементы.Список.ВыделенныеСтроки Цикл

		СписокСсылок.Добавить(КлючЗаписи.Документ);

	КонецЦикла;

	Если НЕ СписокСсылок.Количество() = 0 Тогда

		ТехническаяПоддержка.ВыполнитьОтложенныеДвижения(СписокСсылок);

	КонецЕсли;

	Элементы.Список.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ПровестиОтложенные(Команда)

	ПровестиОтложенныеНаСервере();

КонецПроцедуры
