
//2025-09-22 sa делаем новый обмен с ЗУП на хттп сервисах
#Область Поддержка_Обмена_ЗУП_НТТР_Сервис
 &НаСервере 
Функция ОпределитьПолФизЛица(ПолСтрокой)
	
	Если Врег(ПолСтрокой) = "МУЖСКОЙ" Тогда
		ПолФизЛица = Перечисления.ПолФизическогоЛица.Мужской;
	ИначеЕсли Врег(ПолСтрокой) = "ЖЕНСКИЙ" Тогда
		ПолФизЛица = Перечисления.ПолФизическогоЛица.Женский;
	Иначе
		ПолФизЛица = Перечисления.ПолФизическогоЛица.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ПолФизЛица;
КонецФункции

&НаСервере 
//Ищем сотрудника по ИНН. О том что ИНН обязательно заполнен - заботимся на стороне ЗУП.
Функция ПолучитьСотрудника(ПараметрыСотрудника)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ФизическиеЛица.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.ИНН = &ТекстПоиска"; 
	Запрос.УстановитьПараметр("ТекстПоиска",СокрЛП(ПараметрыСотрудника.ИНН));
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда          
		ПараметрыСотрудника.Вставить("Сотрудник",Рез.Ссылка);
		Возврат Рез.Ссылка;
	Иначе
		ПараметрыСотрудника.Вставить("Сотрудник",Неопределено);
		Возврат Неопределено; 
	КонецЕсли;

КонецФункции


&НаСервере 
Процедура СделатьЗаписьВОтложенныеСообщения(ПараметрыОшибки)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОчередьОтказанныхСообщений.УзелПолучатель КАК УзелПолучатель,
	               |	ОчередьОтказанныхСообщений.Идентификатор КАК Идентификатор,
	               |	ОчередьОтказанныхСообщений.ДанныеСообщения КАК ДанныеСообщения,
	               |	ОчередьОтказанныхСообщений.ОснованиеОтказа КАК ОснованиеОтказа,
	               |	ОчередьОтказанныхСообщений.ДатаИзменения КАК ДатаИзменения
	               |ИЗ
	               |	РегистрСведений.ОчередьОтказанныхСообщений КАК ОчередьОтказанныхСообщений
	               |ГДЕ
	               |	ОчередьОтказанныхСообщений.Идентификатор = &Идентификатор
	               |	И ОчередьОтказанныхСообщений.УзелПолучатель.Код = ""HRM"""; 
	Запрос.УстановитьПараметр("Идентификатор",ПараметрыОшибки.Идентификатор);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		//такая запись об ошибке уже есть и в принципе делать ничего не надо.
		Возврат;
	КонецЕсли;
    Рег = РегистрыСведений.ОчередьОтказанныхСообщений.СоздатьМенеджерЗаписи();
	Рег.Активность = Истина;
	Рег.УзелПолучатель = ПланыОбмена.ОбменРозницаЗарплатаУправлениеПерсоналом.НайтиПоКоду("HRM");
	Рег.ТипОтправителя = ПараметрыОшибки.ТипОтправителя;
	Рег.Идентификатор = ПараметрыОшибки.Идентификатор;
	Рег.ДанныеСообщения = Новый ХранилищеЗначения(ПараметрыОшибки.ДанныеСообщения,Новый СжатиеДанных(9));
	Рег.ФизЛицо = ПараметрыОшибки.ДанныеСообщения.Сотрудник;
	Рег.ДатаИзменения = ТекущаяДата();
	Рег.ОснованиеОтказа = ПараметрыОшибки.ОписаниеОшибки;
	Рег.Записать(Истина);
	
КонецПроцедуры

&НаСервере 
//Ищем сотрудника по ИНН. О том что ИНН обязательно заполнен - заботимся на стороне ЗУП.
Функция ПроверитьСопоставленияОрганизацийИПодразделений(ПараметрыСотрудника) 
	Успешно = Истина;
	МассивОшибок = Новый Массив;
	Если ЗначениеЗаполнено(ПараметрыСотрудника.ТекущееПодразделение) Тогда
		ТекущийМагазин = ПолучитьМагазинПоПодразделению(ПараметрыСотрудника.ТекущееПодразделениеУИД);
		Если Не ЗначениеЗаполнено(ТекущийМагазин) Тогда 
			ПараметрыОшибки = Новый Структура;
			
			ОснованиеОтказа = "Нет сопоставления магазина по подразделению ЗУП ["+ПараметрыСотрудника.ТекущееПодразделение+"] УИД="+ПараметрыСотрудника.ТекущееПодразделениеУИД;
			ПараметрыОшибки.Вставить("ОписаниеОшибки",ОснованиеОтказа);
			ПараметрыОшибки.Вставить("Идентификатор",ПараметрыСотрудника.ТекущееПодразделениеУИД);
			ПараметрыОшибки.Вставить("ТипОтправителя","Справочник.ПодразделенияОрганизаций");
			ПараметрыОшибки.Вставить("ДанныеСообщения",ПараметрыСотрудника);
			СделатьЗаписьВОтложенныеСообщения(ПараметрыОшибки);
			Успешно = Ложь;
			Если МассивОшибок.Найти(ОснованиеОтказа) = Неопределено Тогда
				МассивОшибок.Добавить(ОснованиеОтказа);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ЗаписьРаботникиОрганизаций Из ПараметрыСотрудника.РаботникиОрганизаций Цикл
		Организация_ = ПолучитьОрганизацию(ЗаписьРаботникиОрганизаций);
		Если Не ЗначениеЗаполнено(Организация_) Тогда
			ПараметрыОшибки = Новый Структура;
			
			ОснованиеОтказа = "Нет сопоставления по организации ЗУП ["+ЗаписьРаботникиОрганизаций.Организация+"] УИД="+ЗаписьРаботникиОрганизаций.ОрганизацияУИД;
			ПараметрыОшибки.Вставить("ОписаниеОшибки",ОснованиеОтказа);
			ПараметрыОшибки.Вставить("Идентификатор",ЗаписьРаботникиОрганизаций.ОрганизацияУИД);
			ПараметрыОшибки.Вставить("ТипОтправителя","Справочник.Организации");
			ПараметрыОшибки.Вставить("ДанныеСообщения",ПараметрыСотрудника);
			СделатьЗаписьВОтложенныеСообщения(ПараметрыОшибки);
			Успешно = Ложь;
			Если МассивОшибок.Найти(ОснованиеОтказа) = Неопределено Тогда
				МассивОшибок.Добавить(ОснованиеОтказа);
			КонецЕсли;
		КонецЕсли;
		Магазин_ = ПолучитьМагазинПоПодразделению(ЗаписьРаботникиОрганизаций.ПодразделениеОрганизацииУИД);
		Если Не ЗначениеЗаполнено(Магазин_) Тогда
			ПараметрыОшибки = Новый Структура;
			
			ОснованиеОтказа = "Нет сопоставления магазина по подразделению ЗУП ["+ЗаписьРаботникиОрганизаций.ПодразделениеОрганизации+"] УИД="+ЗаписьРаботникиОрганизаций.ПодразделениеОрганизацииУИД;
			ПараметрыОшибки.Вставить("ОписаниеОшибки",ОснованиеОтказа);
			ПараметрыОшибки.Вставить("Идентификатор",ЗаписьРаботникиОрганизаций.ПодразделениеОрганизацииУИД);
			ПараметрыОшибки.Вставить("ТипОтправителя","Справочник.Организации");
			ПараметрыОшибки.Вставить("ДанныеСообщения",ПараметрыСотрудника);
			СделатьЗаписьВОтложенныеСообщения(ПараметрыОшибки);
			Успешно = Ложь;
			Если МассивОшибок.Найти(ОснованиеОтказа) = Неопределено Тогда
				МассивОшибок.Добавить(ОснованиеОтказа);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Запись_ Из ПараметрыСотрудника.СостояниеРаботниковОрганизаций Цикл
		Организация_ = ПолучитьОрганизацию(Запись_);
		Если Не ЗначениеЗаполнено(Организация_) Тогда
			ПараметрыОшибки = Новый Структура;
			
			ОснованиеОтказа = "Нет сопоставления по организации ЗУП ["+Запись_.Организация+"] УИД="+Запись_.ОрганизацияУИД;
			ПараметрыОшибки.Вставить("ОписаниеОшибки",ОснованиеОтказа);
			ПараметрыОшибки.Вставить("Идентификатор",Запись_.ОрганизацияУИД);
			ПараметрыОшибки.Вставить("ТипОтправителя","Справочник.Организации");
			ПараметрыОшибки.Вставить("ДанныеСообщения",ПараметрыСотрудника);
			СделатьЗаписьВОтложенныеСообщения(ПараметрыОшибки);
			Успешно = Ложь;
			Если МассивОшибок.Найти(ОснованиеОтказа) = Неопределено Тогда
				МассивОшибок.Добавить(ОснованиеОтказа);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не Успешно Тогда 
		ПараметрыСотрудника.Вставить("ОписаниеОшибки",МассивОшибок);
	КонецЕсли;
	
	Возврат Успешно;
КонецФункции	

&НаСервере
Функция ЗагрузитьСотрудникаЗУП(ПараметрыСотрудника) Экспорт
	ОтветПоСотруднику = Новый Структура("УИД,Успешно,ОписаниеОшибки",ПараметрыСотрудника.УИД,Ложь,""); 
	СотрудникСсылка = ПолучитьСотрудника(ПараметрыСотрудника);

	//проверим возможность сопоставления организаций и подразделений, которые нам понадобятся в процессе.
	//если где-то сопоставление не отработает, то грузить сотрудника нельзя.
	Успешно = ПроверитьСопоставленияОрганизацийИПодразделений(ПараметрыСотрудника);

	Если Не Успешно Тогда
		ОтветПоСотруднику.Вставить("ОписаниеОшибки",ПараметрыСотрудника.ОписаниеОшибки);
		Возврат ОтветПоСотруднику;	
	КонецЕсли;
	Если СотрудникСсылка <> Неопределено Тогда
		СотрудникОбъект = СотрудникСсылка.ПолучитьОбъект();
		//делаем проверку нужно ли вообще трогать справочник или изменения в статусах.
		НужнаЗаписьФизЛица = ПроверитьНеобходимостьЗаписиФизЛица(СотрудникСсылка,ПараметрыСотрудника);
	Иначе
		СотрудникОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
		СотрудникОбъект.Сотрудник = Истина;
		СотрудникОбъект.ИНН = ПараметрыСотрудника.ИНН;
		СотрудникОбъект.Магазин = ПолучитьМагазинПоПодразделению(ПараметрыСотрудника.ТекущееПодразделениеУИД);
		НужнаЗаписьФизЛица = Истина;
	КонецЕсли;
	
	//Сообщить("НужнаЗаписьФизЛица="+НужнаЗаписьФизЛица);
	Попытка
		//	1. Если были изменения по реквизитам справочника, обновляем физ.лицо. 
		Если НужнаЗаписьФизЛица Тогда 
			СотрудникОбъект.Наименование 		= ПараметрыСотрудника.ФИО;
			СотрудникОбъект.ДатаРождения 		= ПреобразоватьВДату(ПараметрыСотрудника.ДатаРождения);
			СотрудникОбъект.Пол 				= ОпределитьПолФизЛица(ПараметрыСотрудника.Пол); 
			СотрудникОбъект.Магазин 			= ПолучитьМагазинПоПодразделению(ПараметрыСотрудника.ТекущееПодразделениеУИД);
			СотрудникОбъект.Сотрудник 			= ПараметрыСотрудника.Актуальность;
			СотрудникОбъект.Уволен 				= НЕ ПараметрыСотрудника.Актуальность; 
			СотрудникОбъект.НомерПаспорта 		= ПараметрыСотрудника.ДокументНомер;
			СотрудникОбъект.КемВыданПаспорт 	= ПараметрыСотрудника.ДокументКемВыдан;
			СотрудникОбъект.ДатаВыдачиПаспорта	= ПреобразоватьВДату(ПараметрыСотрудника.ДокументДатаВыдачи);

			Если ПараметрыСотрудника.КонтактнаяИнформация.Количество() > 0 Тогда
				СотрудникОбъект.КонтактнаяИнформация.Очистить();
				ДобавленныеКонтакты = Новый Массив;
				Для Каждого Контакт Из ПараметрыСотрудника.КонтактнаяИнформация Цикл 
					Если Контакт.Тип = "Телефон" Тогда
						НомерТелефона = ОтправкаSMS.ПодготовитьНомерТелефона(Контакт.Представление);
						Если ДобавленныеКонтакты.Найти(НомерТелефона) = Неопределено Тогда
							СтрокаКонтакта = СотрудникОбъект.КонтактнаяИнформация.Добавить();
							СтрокаКонтакта.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
							СтрокаКонтакта.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица;
							СтрокаКонтакта.Представление = ОтправкаSMS.ПодготовитьНомерТелефона(Контакт.Представление);
							СтрокаКонтакта.НомерТелефона = ОтправкаSMS.ПодготовитьНомерТелефона(Контакт.Представление);
							СтрокаКонтакта.ЗначенияПолей = УстановитьЗначенияПолейТелефон(НомерТелефона);
							ДобавленныеКонтакты.Добавить(НомерТелефона);
						КонецЕсли;
					ИначеЕсли Контакт.Тип = "ЭлектроннаяПочта" Тогда
						Если ДобавленныеКонтакты.Найти(Контакт.Представление) = Неопределено Тогда
							СтрокаКонтакта = СотрудникОбъект.КонтактнаяИнформация.Добавить();
							СтрокаКонтакта.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
							СтрокаКонтакта.Вид = Справочники.ВидыКонтактнойИнформации.EmailФизическогоЛица;
							СтрокаКонтакта.Представление = Контакт.Представление;              
							ДобавленныеКонтакты.Добавить(Контакт.Представление);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			СотрудникОбъект.ОбменДанными.Загрузка = Истина;
			СотрудникОбъект.Записать();
			СотрудникСсылка = СотрудникОбъект.Ссылка;
		КонецЕсли;                                   
		ПараметрыСотрудника.Вставить("Сотрудник",СотрудникСсылка);
		

	//	2. Фамилия Имя Отчество
		ЗаполнитьРегистрФИОФизЛиц(СотрудникСсылка, ПараметрыСотрудника);

		//Регистр РаботникиОрганизаций.
		ЗаполнитьРегистрРаботникиОрганизаций(СотрудникСсылка,ПараметрыСотрудника);
		
		
		//Регистр СостоянияРаботниковОрганизаций    
		ЗаполнитьРегистрСостояниеРаботниковОрганизаций(СотрудникСсылка,ПараметрыСотрудника); 

		//При необходимости создаем и проверяем заполнение Контрагента.
		//2025-11-08 sa контрагента из ЗУП меняем только если сотрудник еще работает.
		Если ПараметрыСотрудника.Актуальность Тогда
			ЗаполнитьСправочникКонтрагентаПоСотруднику(ПараметрыСотрудника);
		КонецЕсли;
		
		ОтветПоСотруднику.Вставить("Успешно",Истина);
		ОтветПоСотруднику.Вставить("УИД",ПараметрыСотрудника.УИД);
		
		//убрать
		//ФизЛицо = ПараметрыСотрудника.Сотрудник;
		//Контрагент = ПараметрыСотрудника.СотрудникКонтрагент;
		
	Исключение

		ОтветПоСотруднику = Новый Структура("УИД,Успешно,ОписаниеОшибки",ПараметрыСотрудника.УИД,Ложь,ОписаниеОшибки()); 
		
		Сообщить("ОШИБКА: "+ОтветПоСотруднику.ОписаниеОшибки);
	КонецПопытки;

	Возврат ОтветПоСотруднику;
КонецФункции     

&НаСервере
Процедура ЗаполнитьСправочникКонтрагентаПоСотруднику(ПараметрыСотрудника)
	КонтрагентаНужно = ПроверитьНеобходимостьЗаписиКонтрагента(ПараметрыСотрудника);
	Если КонтрагентаНужно.Создавать Тогда
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
		КонтрагентОбъект.ФизЛицо = ПараметрыСотрудника.Сотрудник;
		КонтрагентОбъект.ДатаСоздания = ТекущаяДата();
		КонтрагентОбъект.Покупатель = Истина;
		КонтрагентОбъект.Родитель = Справочники.Контрагенты.Покупатели;
		КонтрагентОбъект.УстановитьНовыйКод();
		КонтрагентОбъект.IDN = КонтрагентОбъект.Код;
	ИначеЕсли Не КонтрагентаНужно.Обновлять Тогда
		ПараметрыСотрудника.Вставить("СотрудникКонтрагент",КонтрагентаНужно.Ссылка);
		Возврат;
	Иначе
		КонтрагентОбъект = КонтрагентаНужно.Ссылка.ПолучитьОбъект();
		//Блокировка = Новый БлокировкаДанных;

		//ЭлементБлокировки = Блокировка.Добавить("Справочник.Контрагенты");
		//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		//ЭлементБлокировки.УстановитьЗначение("Ссылка", КонтрагентаНужно.Ссылка);
		//Блокировка.Заблокировать();
	КонецЕсли; 
	
	
	КонтрагентОбъект.Наименование = ПараметрыСотрудника.ФИО;
	КонтрагентОбъект.НаименованиеПолное = ПараметрыСотрудника.ФИО;
	КонтрагентОбъект.ДатаРождения = ПреобразоватьВДату(ПараметрыСотрудника.ДатаРождения);
	КонтрагентОбъект.Комментарий = "обновлен из ЗУП "+ТекущаяДата();
	КонтрагентОбъект.Пол = ОпределитьПолФизЛица(ПараметрыСотрудника.Пол);
	КонтрагентОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
	КонтрагентОбъект.ДокументУдостоверяющийЛичность = ПараметрыСотрудника.ДокументПредставление;
	//Контактная информация
	Если ПараметрыСотрудника.КонтактнаяИнформация.Количество() > 0 Тогда
		ДобавленныеКонтакты = Новый Массив;
		КонтрагентОбъект.КонтактнаяИнформация.Очистить();
		Для Каждого Контакт_ Из ПараметрыСотрудника.КонтактнаяИнформация Цикл
			
			Если Контакт_.Тип = "Телефон" Тогда  
				НомерТелефона = ОтправкаSMS.ПодготовитьНомерТелефона(Контакт_.Представление);
				Если ДобавленныеКонтакты.Найти(НомерТелефона) = Неопределено Тогда
					СтрокаКонтакт = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
					СтрокаКонтакт.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
					СтрокаКонтакт.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
					СтрокаКонтакт.Представление = Контакт_.Представление;
					СтрокаКонтакт.НомерТелефона = ОтправкаSMS.ПодготовитьНомерТелефона(Контакт_.Представление);
					СтрокаКонтакт.ЗначенияПолей = УстановитьЗначенияПолейТелефон(НомерТелефона);
					ДобавленныеКонтакты.Добавить(НомерТелефона);
				КонецЕсли;
			ИначеЕсли Контакт_.Тип = "ЭлектроннаяПочта" Тогда
				Если ДобавленныеКонтакты.Найти(Контакт_.Представление) = Неопределено Тогда
					СтрокаКонтакт = КонтрагентОбъект.КонтактнаяИнформация.Добавить();
					СтрокаКонтакт.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
					СтрокаКонтакт.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
					СтрокаКонтакт.Представление = Контакт_.Представление;
					ДобавленныеКонтакты.Добавить(Контакт_.Представление);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	//Дети
	Если ПараметрыСотрудника.Дети.Количество()>0 Тогда
		Для Каждого Ребенок_ Из ПараметрыСотрудника.Дети Цикл
			СтрокаРебенок = КонтрагентОбъект.Дети.Найти(ПреобразоватьВДату(Ребенок_.ДатаРождения),"ДатаРождения");
			Если СтрокаРебенок = Неопределено ИЛИ Не ЗначениеЗаполнено(СтрокаРебенок.Имя) Тогда
				СтрокаРебенок = КонтрагентОбъект.Дети.Добавить();
				СтрокаРебенок.ДатаРождения = ПреобразоватьВДату(Ребенок_.ДатаРождения);
				СтрокаРебенок.Пол = ОпределитьПолФизЛица(Ребенок_.ПолРебенка);
			    СтрокаРебенок.Имя = Ребенок_.ИмяРебенка;
			    СтрокаРебенок.Комментарий = "выгружен из ЗУП";
				//СтрокаРебенок.Пол = "";
				СтрокаРебенок.УникальныйИдентификатор = Новый УникальныйИдентификатор;
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;

	КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
	КонтрагентОбъект.Записать();

	ПараметрыСотрудника.Вставить("СотрудникКонтрагент",КонтрагентаНужно.Ссылка);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьЗаписиКонтрагента(ПараметрыСотрудника) 
	КонтрагентаНужно = Новый Структура("Обновлять,Создавать,Ссылка",Ложь,Ложь,Неопределено);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ПометкаУдаления = ЛОЖЬ
	               |	И Контрагенты.ФизЛицо = &ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.Наименование = &Наименование
	               |	И Контрагенты.ДатаРождения = &ДатаРождения
	               |	И Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ДокументУдостоверяющийЛичность
	               |	И Контрагенты.НаименованиеПолное ПОДОБНО &НаименованиеПолное
	               |	И Контрагенты.Пол = &Пол
	               |	И Контрагенты.ФизЛицо = &ФизЛицо
	               |	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтрагентыДети.Имя КАК Имя,
	               |	КонтрагентыДети.ДатаРождения КАК ДатаРождения,
	               |	КонтрагентыДети.Пол КАК Пол
	               |ИЗ
	               |	Справочник.Контрагенты.Дети КАК КонтрагентыДети
	               |ГДЕ
	               |	КонтрагентыДети.Ссылка.ФизЛицо = &ФизЛицо
	               |	И КонтрагентыДети.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтрагентыКонтактнаяИнформация.Представление КАК Представление
	               |ИЗ
	               |	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |ГДЕ
	               |	КонтрагентыКонтактнаяИнформация.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И КонтрагентыКонтактнаяИнформация.Ссылка.ФизЛицо = &ФизЛицо"; 
	
	Запрос.УстановитьПараметр("ФизЛицо",ПараметрыСотрудника.Сотрудник);
	Запрос.УстановитьПараметр("Наименование",СокрЛП(ПараметрыСотрудника.ФИО));
	Запрос.УстановитьПараметр("НаименованиеПолное",СокрЛП(ПараметрыСотрудника.ФИО));
	Запрос.УстановитьПараметр("ДокументУдостоверяющийЛичность",СокрЛП(ПараметрыСотрудника.ДокументПредставление));
	Запрос.УстановитьПараметр("Пол",ОпределитьПолФизЛица(ПараметрыСотрудника.Пол));
	Запрос.УстановитьПараметр("ДатаРождения",ПреобразоватьВДату(ПараметрыСотрудника.ДатаРождения));
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
    Рез_ = ПакетЗапросов[0].Выбрать();
	Если Не Рез_.Следующий() Тогда 
		//2025-11-12 sa Если не нашли по связи с физ.лицом, попробуем найти по номеру телефона (для случая
		//когда клиент становится сотрудником)
		Для Каждого СтрокаКонтакт Из ПараметрыСотрудника.КонтактнаяИнформация Цикл
			Если СтрокаКонтакт.Тип = "Телефон" Тогда 
				НомерТелефона = ОтправкаSMS.ПодготовитьНомерТелефона(СтрокаКонтакт.Представление);
				КонтрагентСсылка = Справочники.Контрагенты.НайтиПоТелефону(НомерТелефона, Перечисления.ЮрФизЛицо.ФизЛицо, Истина, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
				Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда
					КонтрагентаНужно.Обновлять = Истина;     //т.к. не было связи с физ.лицом.
					КонтрагентаНужно.Ссылка = КонтрагентСсылка;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	    Если Не ЗначениеЗаполнено(КонтрагентаНужно.Ссылка) Тогда
			КонтрагентаНужно.Создавать = Истина;
		КонецЕсли;
		
		Возврат КонтрагентаНужно;
	Иначе //сюда попадаем, если есть контрагент связанный с этим сотрудником.
		КонтрагентаНужно.Ссылка = Рез_.Ссылка;
	КонецЕсли;

	Рез_ = ПакетЗапросов[1].Выбрать();
	Если Рез_.Следующий() Тогда  //если контрагент со всеми реквизитами найден, то обновлять его не нужно, но нужно проверить табличные части контакты и детей
		//проверяем контактную информацию
		Контакты = ПакетЗапросов[3].Выгрузить().ВыгрузитьКолонку("Представление");
		Для Каждого СтрокаКонтакт Из ПараметрыСотрудника.КонтактнаяИнформация Цикл
			Если СтрокаКонтакт.Тип = "Телефон" Тогда
				Если Контакты.Найти(ОтправкаSMS.ПодготовитьНомерТелефона(СтрокаКонтакт.Представление)) = Неопределено Тогда
					КонтрагентаНужно.Обновлять = Истина;
					Прервать;
				КонецЕсли;
			Иначе
				Если Контакты.Найти(СтрокаКонтакт.Представление) = Неопределено Тогда
					КонтрагентаНужно.Обновлять = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//Проверяем детей
		Если КонтрагентаНужно.Обновлять = Ложь Тогда
			Дети = ПакетЗапросов[2].Выгрузить();
			Для Каждого СтрокаРебенка Из ПараметрыСотрудника.Дети Цикл
				//детей буду определять по ДР и хоть чем-то заполненному имени.
				Ребенок = Дети.Найти(ПреобразоватьВДату(СтрокаРебенка.ДатаРождения),"ДатаРождения");
				Если Ребенок = Неопределено ИЛИ Не ЗначениеЗаполнено(Ребенок.Имя) Тогда
					КонтрагентаНужно.Обновлять = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	Иначе
		//Если контрагент тут не найден, значит один из реквизитов изменился и его нужно обновлять
		КонтрагентаНужно.Обновлять = Истина;
	КонецЕсли;
	
	
	Возврат КонтрагентаНужно;
КонецФункции

&НаСервере
Функция ПроверитьНеобходимостьЗаписиФизЛица(СотрудникСсылка,ПараметрыСотрудника)
	ЕстьНеобходимостьОбновлять = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ФизическиеЛица.Ссылка = &Ссылка
	               |	И ФизическиеЛица.Наименование = &Наименование
	               |	И ФизическиеЛица.ДатаВыдачиПаспорта = &ДатаВыдачиПаспорта
	               |	И ФизическиеЛица.ДатаРождения = &ДатаРождения
	               |	И ФизическиеЛица.КемВыданПаспорт ПОДОБНО &КемВыданПаспорт
	               |	И ФизическиеЛица.Магазин = &Магазин
	               |	И ФизическиеЛица.НомерПаспорта = &НомерПаспорта
	               |	И ФизическиеЛица.Пол = &Пол
	               |	И ФизическиеЛица.Сотрудник = &Сотрудник
	               |	И ФизическиеЛица.Уволен = &Уволен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление
	               |ИЗ
	               |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	               |ГДЕ
	               |	ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",СотрудникСсылка);
	Запрос.УстановитьПараметр("Наименование",ПараметрыСотрудника.ФИО);
	Запрос.УстановитьПараметр("ДатаВыдачиПаспорта",ПреобразоватьВДату(ПараметрыСотрудника.ДокументДатаВыдачи));
	Запрос.УстановитьПараметр("ДатаРождения",ПреобразоватьВДату(ПараметрыСотрудника.ДатаРождения));
	Запрос.УстановитьПараметр("КемВыданПаспорт",ПараметрыСотрудника.ДокументКемВыдан);
	Запрос.УстановитьПараметр("Магазин",ПолучитьМагазинПоПодразделению(ПараметрыСотрудника.ТекущееПодразделениеУИД));
	Запрос.УстановитьПараметр("НомерПаспорта",ПараметрыСотрудника.ДокументНомер);
	Запрос.УстановитьПараметр("Пол",ОпределитьПолФизЛица(ПараметрыСотрудника.Пол));
	Запрос.УстановитьПараметр("Сотрудник",ПараметрыСотрудника.Актуальность);
	Запрос.УстановитьПараметр("Уволен",НЕ ПараметрыСотрудника.Актуальность);
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	Рез = ПакетЗапросов[0].Выбрать();
	Если Рез.Следующий() Тогда  //запись со всеми реквизитами найдена, значит ничего обновлять не нужно 
		//второй этап проверяем контактную информацию.
		КонтактнаяИнформация = ПакетЗапросов[1].Выгрузить().ВыгрузитьКолонку("Представление");
		Для Каждого СтрокаКонтакт Из ПараметрыСотрудника.КонтактнаяИнформация Цикл
			Если СтрокаКонтакт.Тип = "Телефон" Тогда
				Если КонтактнаяИнформация.Найти(ОтправкаSMS.ПодготовитьНомерТелефона(СтрокаКонтакт.Представление)) = Неопределено Тогда
					ЕстьНеобходимостьОбновлять = Истина; 
					Прервать;
				КонецЕсли;
			Иначе
				Если КонтактнаяИнформация.Найти(СтрокаКонтакт.Представление) = Неопределено Тогда
					ЕстьНеобходимостьОбновлять = Истина; 
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЕстьНеобходимостьОбновлять = Истина;
	КонецЕсли;
	
	Возврат ЕстьНеобходимостьОбновлять;
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьРегистрФИОФизЛиц(СотрудникСсылка,ПараметрыСотрудника)
		//Проверим есть ли такая запись
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо
		               |ИЗ
		               |	РегистрСведений.ФИОФизЛиц.СрезПоследних(, ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
		               |ГДЕ
		               |	ФИОФизЛицСрезПоследних.Фамилия = &Фамилия
		               |	И ФИОФизЛицСрезПоследних.Имя = &Имя
		               |	И ФИОФизЛицСрезПоследних.Отчество = &Отчество";
		Запрос.УстановитьПараметр("ФизЛицо",СотрудникСсылка);
		Запрос.УстановитьПараметр("Фамилия",СокрЛП(ПараметрыСотрудника.Фамилия));
		Запрос.УстановитьПараметр("Имя",СокрЛП(ПараметрыСотрудника.Имя));
		Запрос.УстановитьПараметр("Отчество",СокрЛП(ПараметрыСотрудника.Отчество));
		Рез_ = Запрос.Выполнить().Выбрать();
		Если Рез_.Следующий() Тогда //Запись уже существует, выходим.
			Возврат;
		КонецЕсли;  
		
		Рег_ = РегистрыСведений.ФИОФизЛиц.СоздатьНаборЗаписей();
		Рег_.Отбор.ФизЛицо.Установить(СотрудникСсылка);
		Рег_.Прочитать();
		Рег_.Очистить();
		Строка_ = Рег_.Добавить();
		Строка_.Период = ТекущаяДата();
		Строка_.Активность = Истина;
		Строка_.ФизЛицо = СотрудникСсылка;
		Строка_.Имя 	= СокрЛП(ПараметрыСотрудника.Имя);
		Строка_.Фамилия = СокрЛП(ПараметрыСотрудника.Фамилия);
		Строка_.Отчество = СокрЛП(ПараметрыСотрудника.Отчество);

		Рег_.Записать(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрРаботникиОрганизаций(СотрудникСсылка,ПараметрыСотрудника)
		РегОрг = РегистрыСведений.РаботникиОрганизаций.СоздатьНаборЗаписей();
		РегОрг.Отбор.Сотрудник.Установить(СотрудникСсылка);
		РегОрг.Прочитать();
		//считаем, если количество записей в ЗУП = количеству записей в Рознице, то регистр не менялся. 
		Если РегОрг.Количество() = ПараметрыСотрудника.РаботникиОрганизаций.Количество() Тогда
			//2026-01-31 sa пока отключу,
			//Так бы все и было, пока я не внес последнюю правку, 
			//когда увольнение и прием на другую организацию сортируются в правильном порядке
			//(основная проблема с прошлым обменом). Там количество записей не меняется, 
			//а меняется только порядок следования (сначала увольнение, потом прием).
			//Но поскольку количество записей остается тем-же, то запись по сотрудникам не обновляется.
			
			//	Возврат;	
		КонецЕсли;
		РегОрг.Очистить();   
		//2025-10-09 кадровые перемещения делают одинаковые записи (должность разная).
		МассивЗаписей = Новый Массив;
		Для Каждого СтрокаДок Из ПараметрыСотрудника.РаботникиОрганизаций Цикл 
			КлючеваяСтрока_ = ""+Строка(СтрокаДок.ОрганизацияУИД)+Строка(СтрокаДок.Регистратор);
			ЕстьСтрока = МассивЗаписей.Найти(КлючеваяСтрока_);
			
			Строка_ = РегОрг.Добавить();
			Строка_.Активность = Истина;
			Строка_.Период = ПреобразоватьВДату(СтрокаДок.Период);
			Строка_.Сотрудник = СотрудникСсылка;
			Строка_.Организация = ПолучитьОрганизацию(СтрокаДок);
			Строка_.Подразделение = ПолучитьМагазинПоПодразделению(СтрокаДок.ПодразделениеОрганизацииУИД);
			Если ЕстьСтрока = Неопределено Тогда
				Строка_.Идентификатор = СтрокаДок.Регистратор;
			Иначе
				н = 0;
				Пока Истина Цикл
					н = н + 1;
					КлючеваяСтрока_ = ""+Строка(СтрокаДок.ОрганизацияУИД)+Строка(СтрокаДок.Регистратор)+"#"+н;
					ЕстьСтрока = МассивЗаписей.Найти(КлючеваяСтрока_);
					Если ЕстьСтрока = Неопределено Тогда
						Строка_.Идентификатор = СтрокаДок.Регистратор+"#"+н;  
						Прервать;	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Строка_.ВидЗанятости = ПолучитьВидЗанятости(СтрокаДок.ВидЗанятости);
			Строка_.Должность = ПолучитьДолжность(СтрокаДок); 
			Строка_.ЗанимаемыхСтавок = СтрокаДок.ЗанимаемыхСтавок; 
			Строка_.Магазин = ПолучитьМагазинПоПодразделению(СтрокаДок.ПодразделениеОрганизацииУИД);
			Строка_.СостояниеСотрудника =  ПолучитьСостояниеСотрудника(СтрокаДок.ПричинаИзмененияСостояния); 
			Строка_.ДокументДвижения = СтрокаДок.ДокументДвижения;
			Строка_.ПериодНачала = ПреобразоватьВДату(СтрокаДок.Период);
			
			МассивЗаписей.Добавить(КлючеваяСтрока_);
			
		КонецЦикла;
		РегОрг.Записать(Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрСостояниеРаботниковОрганизаций(СотрудникСсылка,ПараметрыСотрудника)
		РегСостояние = РегистрыСведений.СостояниеРаботниковОрганизаций.СоздатьНаборЗаписей();
		РегСостояние.Отбор.Сотрудник.Установить(СотрудникСсылка);
		РегСостояние.Прочитать();
		//считаем если количество записей в ЗУП = количеству записей в Рознице, то по регистру ничего не менялось.
		Если РегСостояние.Количество() = ПараметрыСотрудника.СостояниеРаботниковОрганизаций.Количество() Тогда
			Возврат;
		КонецЕсли;
		РегСостояние.Очистить();
		//2025-10-09 кадровые перемещения делают одинаковые записи (должность разная).
		МассивЗаписей = Новый Массив;
		Для Каждого СтрокаДок Из ПараметрыСотрудника.СостояниеРаботниковОрганизаций Цикл
			КлючеваяСтрока_ = ""+Строка(СтрокаДок.ОрганизацияУИД)+Прав(СтрокаДок.Регистратор,36);
			ЕстьСтрока = МассивЗаписей.Найти(КлючеваяСтрока_); 
			
			Строка_ = РегСостояние.Добавить();
			Строка_.Активность = Истина;
			Строка_.Период = ПреобразоватьВДату(СтрокаДок.Период);
			Строка_.Сотрудник = СотрудникСсылка;
			Строка_.Организация = ПолучитьОрганизацию(СтрокаДок);
			Строка_.Подразделение = ПолучитьПодразделениеНаДату(СотрудникСсылка,Строка_.Период,Строка_.Организация);
			Если ЕстьСтрока = Неопределено Тогда
				Строка_.ДокументДвижения = Прав(СтрокаДок.Регистратор,36);
			Иначе
				н = 0;
				Пока Истина Цикл
					н = н + 1;
					КлючеваяСтрока_ = ""+Строка(СтрокаДок.ОрганизацияУИД)+Прав(СтрокаДок.Регистратор,36)+"#"+н;
					ЕстьСтрока = МассивЗаписей.Найти(КлючеваяСтрока_);
					Если ЕстьСтрока = Неопределено Тогда
						Строка_.ДокументДвижения = Прав(СтрокаДок.Регистратор+"#"+н,36);  
						Прервать;	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Строка_.Состояние = ПолучитьСостояниеЗанятости(СтрокаДок.Состояние);
			Строка_.ПериодЗавершения = ПреобразоватьВДату(СтрокаДок.ПериодЗавершения);
			Строка_.СостояниеЗавершения = ПолучитьСостояниеЗанятости(СтрокаДок.СостояниеЗавершения);
			//Строка_.Примечание = 
			Строка_.ДокументДвиженияПредставление = СтрокаДок.ДокументДвижения;

			МассивЗаписей.Добавить(КлючеваяСтрока_);
		КонецЦикла;
		РегСостояние.Записать(Истина);
КонецПроцедуры

&НаСервере
Функция ПолучитьПодразделениеНаДату(Сотрудник,Период,Организация) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|			РаботникиОрганизацийСрезПоследних.Период КАК Период,
	|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|		РаботникиОрганизацийСрезПоследних.Организация КАК Организация,
	|		РаботникиОрганизацийСрезПоследних.Подразделение КАК Подразделение,
	|		РаботникиОрганизацийСрезПоследних.Магазин КАК Магазин,
	|		РаботникиОрганизацийСрезПоследних.Должность КАК Должность,
	|		РаботникиОрганизацийСрезПоследних.Идентификатор КАК Идентификатор,
	|		РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&КонецПериода,
	|				Сотрудник = &Сотрудник
	|				И
	|				Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
	|	ГДЕ
	|		РаботникиОрганизацийСрезПоследних.Период <= &КонецПериода
	|		И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок > 0
    |
	|	УПОРЯДОЧИТЬ ПО
	|		Период УБЫВ
	|";
	Запрос.УстановитьПараметр("КонецПериода",	Период);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Сотрудник",		Сотрудник);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Подразделение = Рез.Магазин;
	Иначе
		Подразделение = Сотрудник.Магазин;
	КонецЕсли;                
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Подразделение = Сотрудник.Магазин;	
	КонецЕсли; 
	
	Возврат Подразделение;
КонецФункции
&НаСервере
Функция УстановитьЗначенияПолейТелефон(НомерТелефона)
	ЗначенияПолей = "<КонтактнаяИнформация xmlns=""http://www.v8.1c.ru/ssl/contactinfo""" 
					+" xmlns:xs=""http://www.w3.org/2001/XMLSchema"""
					+" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""" 
					+" Представление="""+НомерТелефона+"""><Комментарий>used:"+НомерТелефона+"</Комментарий>"
					+" <Состав xsi:type=""НомерТелефона"" КодСтраны="""+Лев(НомерТелефона,3)+""" КодГорода="""+Сред(НомерТелефона,4,2)+""" Номер="""+Сред(НомерТелефона,6)+""" Добавочный=""""/></КонтактнаяИнформация>";

    Возврат ЗначенияПолей;
КонецФункции

&НаСервере
Функция ПолучитьМагазинПоПодразделению(УИДПодразделения)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |ГДЕ
	               |	СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы.Код = ""HRM""
	               |	И СоответствияОбъектовИнформационныхБаз.ТипПриемника = ""Справочник.ПодразделенияОрганизаций""
	               |	И СоответствияОбъектовИнформационныхБаз.ТипИсточника = ""Справочник.Магазины""
	               |	И СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника = &ПодразделениеУИД";
	Запрос.УстановитьПараметр("ПодразделениеУИД", УИДПодразделения);
	Рез_ = Запрос.Выполнить().Выбрать();
	Если Рез_.Следующий() Тогда
		Возврат Рез_.Ссылка;
	Иначе     
		//вешаем признак что обмен по этому товарищу неуспешен.
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПолучитьОрганизацию(СтрокаДок)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	               |ГДЕ
	               |	СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы.Код = ""HRM""
	               |	И СоответствияОбъектовИнформационныхБаз.ТипПриемника = ""Справочник.Организации""
	               |	И СоответствияОбъектовИнформационныхБаз.ТипИсточника = ""Справочник.Организации""
	               |	И СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника = &ОрганизацияУИД";
	Запрос.УстановитьПараметр("ОрганизацияУИД", СтрокаДок.ОрганизацияУИД);
	Рез_ = Запрос.Выполнить().Выбрать();
	Если Рез_.Следующий() Тогда
		Возврат Рез_.Ссылка;
	Иначе     
		//вешаем признак что обмен по этому товарищу неуспешен.
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
//Должность ищем по УИД должности в ЗУП
Функция ПолучитьДолжность(СтрокаДок)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДолжностиОрганизаций.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДолжностиОрганизаций КАК ДолжностиОрганизаций
	               |ГДЕ
	               |	ДолжностиОрганизаций.КодЗУП = &КодЗУП";
	Запрос.УстановитьПараметр("КодЗУП", СтрокаДок.ДолжностьУИД);
	Рез_ = Запрос.Выполнить().Выбрать();
	Если Рез_.Следующий() Тогда
		Возврат Рез_.Ссылка;
	Иначе     
		//тут я бы заводил должность автоматически на основании данных ЗУП, но это нужно согласовать. 
		СпрДолжность = Справочники.ДолжностиОрганизаций.СоздатьЭлемент();
		СпрДолжность.Наименование = СтрокаДок.Должность;
		СпрДолжность.КодКП = СтрокаДок.КодДолжностиПоКП;
		СпрДолжность.КодЗУП = СтрокаДок.ДолжностьУИД;
		СпрДолжность.Записать();
		Возврат СпрДолжность.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПолучитьСостояниеЗанятости(СостояниеЗанятостиСтр)
	Попытка
		СостояниеЗанятости = Перечисления.СостоянияРаботникаОрганизации[СостояниеЗанятостиСтр];	
	Исключение 
		СостояниеЗанятости = Перечисления.СостоянияРаботникаОрганизации.ПустаяСсылка();
	КонецПопытки;
	
	Возврат СостояниеЗанятости;
КонецФункции

&НаСервере
Функция ПолучитьСостояниеСотрудника(СостояниеСотрудникаСтр)
	Попытка
		СостояниеСотрудника = Перечисления.ПричиныИзмененияСостояния[СостояниеСотрудникаСтр];	
	Исключение 
		СостояниеСотрудника = Перечисления.ПричиныИзмененияСостояния.ПустаяСсылка();
	КонецПопытки;
	
	Возврат СостояниеСотрудника;
КонецФункции

&НаСервере
Функция ПолучитьВидЗанятости(ВидЗанятостиСтр)
	Попытка
		ВидЗанятости = Перечисления.ВидыЗанятости[ВидЗанятостиСтр];	
	Исключение 
		ВидЗанятости = Перечисления.ВидыЗанятости.ПустаяСсылка();
	КонецПопытки;
	
	Возврат ВидЗанятости;
КонецФункции

&НаСервере
Функция ПреобразоватьВДату(ДатаСтр)
	ДатаСтр_ = СтрЗаменить(ДатаСтр,"T","");
	ДатаСтр_ = СтрЗаменить(ДатаСтр_,":","");
	ДатаСтр_ = СтрЗаменить(ДатаСтр_,"-","");
	
	Попытка
		Дата_ = Дата(ДатаСтр_);
	Исключение
		Сообщить("Не удалось преобразовать строку "+ДатаСтр+" в дату"); 
		Дата_ = Дата(1,1,1);
	КонецПопытки;
	
	Возврат Дата_;
КонецФункции

&НаСервере
Процедура ОтправитьОповещениеОбНеуспешномОбмене(ПараметрыСотрудника,Ответ)
	УчетныеДанныеОтправителя = РаботаСПочтовымиСообщениями.ПолучитьСистемнуюУчетнуюЗапись();
	
	Если УчетныеДанныеОтправителя.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", "oleksandr.danyliuk@antoshka.ua");
	ПараметрыПисьма.Вставить("Тема", "Ошибка при обмене с ЗУП: "+ПараметрыСотрудника.ФИО+" ("+ПараметрыСотрудника.ТекущееПодразделение+")");
	ТелоПисьма = "Шановний панове!"+Символы.ПС+"Це автоматичний лист. Прохання не відповідати на нього."+Символы.ПС
		+"Произошла ошибка при загрузке сотрудника "+ПараметрыСотрудника.ФИО+" из ЗУП по причине:"
		+Символы.ПС+Символы.ПС;
		Если ТипЗнч(Ответ.ОписаниеОшибки) = Тип("Массив") Тогда
			Для Каждого ОписаниеОшибки Из Ответ.ОписаниеОшибки Цикл
				ТелоПисьма = ТелоПисьма + ОписаниеОшибки+Символы.ПС; 
			КонецЦикла;
		Иначе
			ТелоПисьма = ТелоПисьма + Ответ.ОписаниеОшибки+Символы.ПС; 
		КонецЕсли;
	ПараметрыПисьма.Вставить("Тело", ТелоПисьма);

	ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(УчетныеДанныеОтправителя, ПараметрыПисьма);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьМассивСотрудников(ТекстЗапроса)  Экспорт
    СтруктураОтвета = Новый Структура;
	МассивОтветовПоСотруднику = Новый Массив;
	ОписаниеОшибки = "";
	ЗагруженныеСотрудники = Новый Массив;
	
	Попытка      

		МассивСотрудников = ОбменWebRetailСервер.ТекстДЖСОНвСтруктуру(ТекстЗапроса); 
		Для Каждого ПараметрыСотрудника Из МассивСотрудников Цикл
			Если ЗагруженныеСотрудники.Найти(СокрЛП(ПараметрыСотрудника.ИНН)) = Неопределено Тогда
				//ОтветПоСотруднику = Новый Структура("УИД,Загружен",ПараметрыСотрудника.УИД,Ложь); 
				ОтветПоСотруднику = ЗагрузитьСотрудникаЗУП(ПараметрыСотрудника);
				Если ОтветПоСотруднику.Успешно = Ложь Тогда
					ОтправитьОповещениеОбНеуспешномОбмене(ПараметрыСотрудника,ОтветПоСотруднику);	
				КонецЕсли;
				МассивОтветовПоСотруднику.Добавить(ОтветПоСотруднику); 
				ЗагруженныеСотрудники.Добавить(СокрЛП(ПараметрыСотрудника.ИНН));
			КонецЕсли;
		КонецЦикла;
		Успешно = Истина;
	Исключение
		Успешно = Ложь;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	СтруктураОтвета.Вставить("Успешно",Успешно);
	СтруктураОтвета.Вставить("ОписаниеОшибки",ОписаниеОшибки);
	СтруктураОтвета.Вставить("Сотрудники",МассивОтветовПоСотруднику);
	
	Возврат СтруктураОтвета;
КонецФункции



#КонецОбласти                                            

//===================================================================================


#Область ПоддержкаОбменовЗарплатаИУправлениеПерсоналом

#Область ПрограммныйИнтерфейс

//	LNK 19.07.2018 13:55:34
Процедура ВыполнитьЗагрузкуДанныхДляУзла(УзелПолучатель, ДанныеСообщения, ДанныеОтвета, РежимДогрузки = Ложь)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	СсылочныйКеш = Новый Соответствие;

//	Первым делом отрабатываем ссылки..
//	\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\/

	Для каждого СтрокаТаблицы Из ДанныеСообщения.ТаблицаСсылок Цикл

		ПараметрыПоиска = Новый Структура(
			"Узел, СтрокаТаблицы, КакОбъект, Создать"
			, УзелПолучатель.Ссылка
			, СтрокаТаблицы
			, Ложь
			, Ложь
		);

		Если Лев(СтрокаТаблицы.Имя, 10) = "Справочник" Тогда

			Если СтрокаТаблицы.Имя = "Справочник.ФизическиеЛица" Тогда
				ПараметрыПоиска = Новый Структура(
					"Узел, СтрокаТаблицы, КакОбъект, Создать"
					, УзелПолучатель.Ссылка
					, СтрокаТаблицы
					, Ложь
					, Истина
				);
				ПараметрыПоиска.КакОбъект = Истина;
				ЭкземплярОбъекта = ЗаполнитьДанныеФизЛица(ПолучитьСсылочныйОбъект(ПараметрыПоиска, Справочники.ФизическиеЛица, "Справочник.ФизическиеЛица", "ИНН", СсылочныйКеш), СтрокаТаблицы.Данные);

			ИначеЕсли СтрокаТаблицы.Имя = "Справочник.Организации" Тогда

				ЭкземплярОбъекта = ПолучитьСсылочныйОбъект(ПараметрыПоиска, Справочники.Организации, "Справочник.Организации", "КодПоЕДРПОУ", СсылочныйКеш);

			ИначеЕсли СтрокаТаблицы.Имя = "Справочник.ДолжностиОрганизаций" Тогда

				ПараметрыПоиска.Создать = Истина;
				ЭкземплярОбъекта = ПолучитьСсылочныйОбъект(ПараметрыПоиска, Справочники.ДолжностиОрганизаций, "Справочник.ДолжностиОрганизаций", "КодКП", СсылочныйКеш);

			ИначеЕсли СтрокаТаблицы.Имя = "Справочник.ПодразделенияОрганизаций" Тогда	//	"сводим" через склад на магазин!

				ЭкземплярОбъекта = ПолучитьСсылочныйОбъект(ПараметрыПоиска, Справочники.Склады, "Справочник.Склады", "IDN", СсылочныйКеш);
				
				ПараметрыПоиска.Создать = Истина;
				ПараметрыПоиска.КакОбъект = Истина;
				ЭкземплярОбъекта1 = ЗаполнитьДанныеПодразделение(ПолучитьСсылочныйОбъект(ПараметрыПоиска, Справочники.ОбособленныеПодразделенияОрганизаций, "Справочник.ОбособленныеПодразделенияОрганизаций", "Код", СсылочныйКеш), СтрокаТаблицы.Данные, ПараметрыПоиска.СтрокаТаблицы.Идентификатор, СсылочныйКеш);
				
				Если Не ЭкземплярОбъекта = Неопределено Тогда 
					ЭкземплярОбъекта = ЭкземплярОбъекта1;
				КонецЕсли;
				
			Иначе

				ЭкземплярОбъекта = Неопределено;

			КонецЕсли;

		Иначе

			Отладочная = 22;

		КонецЕсли;

		Если ЭкземплярОбъекта = Неопределено Тогда

			ДанныеОтказа = РегистрыСведений.ОчередьОтказанныхСообщений.СтруктураОтказа();
			ДанныеОтказа.ТипОтправителя  = СтрокаТаблицы.Имя;
			ДанныеОтказа.Идентификатор   = СтрокаТаблицы.Идентификатор;
			ДанныеОтказа.ДанныеСообщения = ОбщегоНазначенияКлиентСервер.СтрокаТаблицыКакСтруктура(ДанныеСообщения.ТаблицаСсылок.Колонки, СтрокаТаблицы, Истина);
			ДанныеОтказа.ОснованиеОтказа = "не связано «" + СтрокаТаблицы.Данные.Наименование + "» (" + СтрокаТаблицы.Имя + ")";

			РегистрыСведений.ОчередьОтказанныхСообщений.УстановитьВОчереди(УзелПолучатель.Ссылка, ДанныеСообщения.НомерСообщения, ДанныеОтказа);

		КонецЕсли;

	КонецЦикла;

//	Теперь работаем со структурой набора записей..
//	\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\/

	НаборЗаписей = РегистрыСведений.РаботникиОрганизаций.СоздатьНаборЗаписей();

	Для каждого СтруктураНабора Из ДанныеСообщения.ДанныеРегистра Цикл
		
		Если СтруктураНабора.ТипРегистра = "РегистрСведенийНаборЗаписей.СостояниеРаботниковОрганизаций" Тогда 
			Для каждого СтрокаТаблицы Из СтруктураНабора.НаборЗаписей Цикл
				НаборЗаписей = РегистрыСведений.СостояниеРаботниковОрганизаций.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Организация.Установить(СсылочныйКеш.Получить("Справочник.Организации#" + СтрокаТаблицы.Организация));
				НаборЗаписей.Отбор.Сотрудник.Установить(СсылочныйКеш.Получить("Справочник.ФизическиеЛица#" + СтрокаТаблицы.ФизЛицо));
				НаборЗаписей.Отбор.ДокументДвижения.Установить(СтруктураНабора.Отбор.ДокументДвиженияИД);
				НаборЗаписей.Очистить();
				
				ЗаписьНабора = НаборЗаписей.Добавить();
				
				ЗаписьНабора.Период = СтрокаТаблицы.Период;
				ЗаписьНабора.Организация   = НаборЗаписей.Отбор.Организация.Значение;
				ЗаписьНабора.Сотрудник     = НаборЗаписей.Отбор.Сотрудник.Значение;
				ЗаписьНабора.ДокументДвижения     = НаборЗаписей.Отбор.ДокументДвижения.Значение;
				
				ЗаписьНабора.Состояние        = ОбщегоНазначенияКлиентСервер.ЗначениеПеречисления(Перечисления.СостоянияРаботникаОрганизации, СтрокаТаблицы.Состояние);
				ЗаписьНабора.ПериодЗавершения    = СтрокаТаблицы.ПериодЗавершения;
				ЗаписьНабора.СостояниеЗавершения        = ОбщегоНазначенияКлиентСервер.ЗначениеПеречисления(Перечисления.СостоянияРаботникаОрганизации, СтрокаТаблицы.СостояниеЗавершения);
				
				ЗаписьНабора.ДокументДвиженияПредставление = СтрокаТаблицы.ДокументДвиженияПредставление;
                // Бакан ТС 20250701 Добавил блокировку  
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостояниеРаботниковОрганизаций");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				НачатьТранзакцию();
				Попытка
				    Блокировка.Заблокировать(); // <-- Эта строка заблокирует ВСЮ таблицу регистра
					НаборЗаписей.Записать(Истина);  
				    ЗафиксироватьТранзакцию();
				Исключение
				    ОтменитьТранзакцию();
				    ВызватьИсключение;
				КонецПопытки;   
				//НаборЗаписей.Записать(Истина);
			КонецЦикла;
			
		ИначеЕсли СтруктураНабора.ТипРегистра = "РегистрСведенийНаборЗаписей.РаботникиОрганизацийДляОбмена" Тогда
			
			НаборЗаписей = РегистрыСведений.РаботникиОрганизаций.СоздатьНаборЗаписей();

		//	Отрабатываем значения отбора..
			//НаборЗаписей.Отбор.ПериодНачала.Установить(СтруктураНабора.Отбор.Период);
			НаборЗаписей.Отбор.Организация.Установить(СсылочныйКеш.Получить("Справочник.Организации#" + СтруктураНабора.Отбор.Организация));
			НаборЗаписей.Отбор.Сотрудник.Установить(СсылочныйКеш.Получить("Справочник.ФизическиеЛица#" + СтруктураНабора.Отбор.ФизЛицо));
			НаборЗаписей.Отбор.Идентификатор.Установить(СтруктураНабора.Отбор.ДокументДвижения);
			НаборЗаписей.Очистить();

			Для каждого СтрокаТаблицы Из СтруктураНабора.НаборЗаписей Цикл

				Если НЕ СтрокаТаблицы.Удалить Тогда	//	в случае "Удалить" запишем пустой набор записей

					ЗаписьНабора = НаборЗаписей.Добавить();
					
					СостояниеСотрудника = ОбщегоНазначенияКлиентСервер.ЗначениеПеречисления(Перечисления.ПричиныИзмененияСостояния, СтрокаТаблицы.ПричинаИзмененияСостояния);
					Если СостояниеСотрудника = Перечисления.ПричиныИзмененияСостояния.Увольнение Тогда 

						ЗаписьНабора.ПериодНачала = Дата(Год(СтруктураНабора.Отбор.Период), 
														Месяц(СтруктураНабора.Отбор.Период),
														День(СтруктураНабора.Отбор.Период));
					Иначе 								
						ЗаписьНабора.ПериодНачала = Дата(Год(СтруктураНабора.Отбор.Период), 
														Месяц(СтруктураНабора.Отбор.Период),
														День(СтруктураНабора.Отбор.Период),
														Час(СтрокаТаблицы.ВремяДокумента),
														Минута(СтрокаТаблицы.ВремяДокумента),
														Секунда(СтрокаТаблицы.ВремяДокумента));
														
					КонецЕсли;
					ЗаписьНабора.Организация   = НаборЗаписей.Отбор.Организация.Значение;
					ЗаписьНабора.Сотрудник     = НаборЗаписей.Отбор.Сотрудник.Значение;
					ЗаписьНабора.Идентификатор = НаборЗаписей.Отбор.Идентификатор.Значение;

					ЗаписьНабора.ВидЗанятости        = ОбщегоНазначенияКлиентСервер.ЗначениеПеречисления(Перечисления.ВидыЗанятости, СтрокаТаблицы.ВидЗанятости);
					ЗаписьНабора.ЗанимаемыхСтавок    = СтрокаТаблицы.ЗанимаемыхСтавок;
					ЗаписьНабора.Магазин             = СсылочныйКеш.Получить("Справочник.Магазины#" + СтрокаТаблицы.ПодразделениеОрганизации);
				//	ЗаписьНабора.ПериодНачала       =
					ЗаписьНабора.Должность           = СсылочныйКеш.Получить("Справочник.ДолжностиОрганизаций#" + СтрокаТаблицы.Должность);
					ЗаписьНабора.СостояниеСотрудника = ОбщегоНазначенияКлиентСервер.ЗначениеПеречисления(Перечисления.ПричиныИзмененияСостояния, СтрокаТаблицы.ПричинаИзмененияСостояния);
					ЗаписьНабора.ПринятНаНовоеРабочееМесто = СтрокаТаблицы.ПринятНаНовоеРабочееМесто;

					ЗаписьНабора.ДокументДвижения = СтрокаТаблицы.ДокументДвиженияПредставление;
					
					//ЗаполнитьОбособленноеПодразделение(СсылочныйКеш.Получить("Справочник.ОбособленныеПодразделенияОрганизаций#" + СтрокаТаблицы.ПодразделениеОрганизации),
					//									СсылочныйКеш.Получить("Справочник.Магазины#" + СтрокаТаблицы.ПодразделениеОрганизации),
					//									НаборЗаписей.Отбор.Организация.Значение);
					
				КонецЕсли;

			КонецЦикла;

			ОснованиеОтказа = "";

			Если ПроверитьВозможностьПринятияНабораЗаписей(НаборЗаписей, ОснованиеОтказа) Тогда
                // Бакан ТС 20250701 Добавил блокировку  
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РаботникиОрганизаций");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				НачатьТранзакцию();
				Попытка
				    Блокировка.Заблокировать(); // <-- Эта строка заблокирует ВСЮ таблицу регистра
					НаборЗаписей.Записать(Истина);  
				    ЗафиксироватьТранзакцию();
				Исключение
				    ОтменитьТранзакцию();
				    ВызватьИсключение;
				КонецПопытки;   
				//НаборЗаписей.Записать(Истина);  
				СделатьЗаписьДляОбновленияСпрПользователиИФизЛица(НаборЗаписей.Отбор.Сотрудник.Значение);
				РегистрыСведений.ОчередьОтказанныхСообщений.УдалитьИзОчереди(УзелПолучатель.Ссылка, "РегистрСведенийНаборЗаписей.РаботникиОрганизаций", СтруктураНабора.Отбор.ДокументДвижения); 
			Иначе
				ДанныеОтказа = РегистрыСведений.ОчередьОтказанныхСообщений.СтруктураОтказа();
				ДанныеОтказа.ТипОтправителя  = "РегистрСведенийНаборЗаписей.РаботникиОрганизаций";
				ДанныеОтказа.Идентификатор   = СтруктураНабора.Отбор.ДокументДвижения;
				ДанныеОтказа.ДанныеСообщения = СтруктураНабора;
				ДанныеОтказа.ОснованиеОтказа = ОснованиеОтказа;

				РегистрыСведений.ОчередьОтказанныхСообщений.УстановитьВОчереди(УзелПолучатель.Ссылка, ДанныеСообщения.НомерСообщения, ДанныеОтказа);

			КонецЕсли;
		КонецЕсли;
		

	КонецЦикла;

//	\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\//\\/

	Если НЕ РежимДогрузки Тогда

		УзелПолучатель.НомерПринятого = ДанныеСообщения.НомерСообщения;
		УзелПолучатель.Записать();

		ДанныеОтвета.НомерПринятого = УзелПолучатель.НомерПринятого;

	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьОбособленноеПодразделение(СсылкаНаОбособленноеПодразделение, Магазин, Владелец)
	
	ОбъектОбособленноеПодразделение = СсылкаНаОбособленноеПодразделение.ПолучитьОбъект();
	ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("Владелец", Владелец, ОбъектОбособленноеПодразделение);
	ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("НаименованиеПолное", ОбъектОбособленноеПодразделение.Наименование, ОбъектОбособленноеПодразделение);
				
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураУзловМагазины.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураУзлов.Магазины КАК СтруктураУзловМагазины
		|ГДЕ
		|	(СтруктураУзловМагазины.Магазин = &Магазин
		|			ИЛИ СтруктураУзловМагазины.Ссылка.Магазин = &Магазин)";
	
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("ЭлементСтруктуры", Выборка.Ссылка, ОбъектОбособленноеПодразделение);
	Иначе 
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("ЭлементСтруктуры", Справочники.СтруктураУзлов.ЦентральныйОфис, ОбъектОбособленноеПодразделение);
	КонецЕсли;
	
	Если ОбъектОбособленноеПодразделение.Модифицированность() Тогда
		ОбъектОбособленноеПодразделение.ОбменДанными.Загрузка = Истина;
		ОбъектОбособленноеПодразделение.Записать();
	КонецЕсли;
			
	
	
КонецПроцедуры


//	LNK 19.07.2018 13:20:25
Функция ПолучитьОбъектУзла(КлючиУзла)	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	УзелСсылка = ПланыОбмена.ОбменРозницаЗарплатаУправлениеПерсоналом.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючиУзла.Идентификатор));
	УзелОбъект = УзелСсылка.ПолучитьОбъект();

	Если УзелОбъект = Неопределено Тогда

	//	.. попытаемся найти по коду! Актуально для тестовых ИБ.

		УзелСсылка = ПланыОбмена.ОбменРозницаЗарплатаУправлениеПерсоналом.НайтиПоКоду(КлючиУзла.Код);
		УзелОбъект = УзелСсылка.ПолучитьОбъект();

		Если УзелОбъект = Неопределено Тогда

			УзелОбъект = ПланыОбмена.ОбменРозницаЗарплатаУправлениеПерсоналом.СоздатьУзел();
			УзелОбъект.УстановитьСсылкуНового(УзелСсылка);

			УзелОбъект.Код = КлючиУзла.Код;
			УзелОбъект.Наименование = КлючиУзла.Наименование;

			УзелОбъект.Записать();

		КонецЕсли;

	КонецЕсли;

	Возврат УзелОбъект;

КонецФункции // ПолучитьОбъектУзла()

//	LNK 30.07.2018 11:09:28
Процедура ДогрузитьОтказанныеРанееСообщения()	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаОчереди.УзелПолучатель КАК УзелПолучатель,
	|	ТаблицаОчереди.НомерСообщения КАК НомерСообщения,
	|	ВЫБОР
	|		КОГДА ТаблицаОчереди.ТипОтправителя = ""РегистрСведенийНаборЗаписей.РаботникиОрганизаций""
	|			ТОГДА ""2.НаборЗаписей""
	|		ИНАЧЕ ""1.Ссылки""
	|	КОНЕЦ КАК КлючТаблицы,
	|	ТаблицаОчереди.ТипОтправителя КАК ТипОтправителя,
	|	ТаблицаОчереди.Идентификатор КАК Идентификатор,
	|	ТаблицаОчереди.Индекс КАК Индекс,
	|	ТаблицаОчереди.ДанныеСообщения КАК ДанныеСообщения,
	|	ТаблицаОчереди.ДатаИзменения КАК ДатаИзменения
	|ПОМЕСТИТЬ Источник
	|ИЗ
	|	РегистрСведений.ОчередьОтказанныхСообщений КАК ТаблицаОчереди
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УзелПолучатель,
	|	НомерСообщения,
	|	КлючТаблицы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСообщений.УзелПолучатель КАК УзелПолучатель,
	|	ТаблицаСообщений.КлючТаблицы КАК КлючТаблицы,
	|	ТаблицаСообщений.НомерСообщения КАК НомерСообщения
	|ИЗ
	|	Источник КАК ТаблицаСообщений
	|
	|УПОРЯДОЧИТЬ ПО
	|	УзелПолучатель,
	|	КлючТаблицы
	|ИТОГИ ПО
	|	УзелПолучатель,
	|	КлючТаблицы"
	);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	УзлыВыборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока УзлыВыборка.Следующий() Цикл

		КлючиВыборка = УзлыВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока КлючиВыборка.Следующий() Цикл

			НомерВыборка = КлючиВыборка.Выбрать();

			Пока НомерВыборка.Следующий() Цикл

				ТаблицаСсылок = Новый ТаблицаЗначений;
				ТаблицаСсылок.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
				ТаблицаСсылок.Колонки.Добавить("Имя"          , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(256)));
				ТаблицаСсылок.Колонки.Добавить("Данные"       , Новый ОписаниеТипов("Структура"));

				ДанныеСообщения = Новый Структура(
					"НомерСообщения, ТаблицаСсылок, ДанныеРегистра"
					, НомерВыборка.НомерСообщения
					, ТаблицаСсылок
					, Новый Массив
				);

				Запрос.Текст =
				"ВЫБРАТЬ
				|	Источник.ТипОтправителя КАК Имя,
				|	Источник.Идентификатор КАК Идентификатор,
				|	Источник.Индекс КАК Индекс,
				|	Источник.ДанныеСообщения КАК ДанныеСообщения,
				|	Источник.ДатаИзменения КАК ДатаИзменения
				|ИЗ
				|	Источник КАК Источник
				|ГДЕ
				|	Источник.УзелПолучатель = &УзелПолучатель
				|	И Источник.КлючТаблицы = &КлючТаблицы
				|	И Источник.НомерСообщения = &НомерСообщения
				|
				|УПОРЯДОЧИТЬ ПО
				|	Имя,
				|	ДатаИзменения"
				;
				Запрос.УстановитьПараметр("УзелПолучатель", НомерВыборка.УзелПолучатель);
				Запрос.УстановитьПараметр("КлючТаблицы"   , НомерВыборка.КлючТаблицы);
				Запрос.УстановитьПараметр("НомерСообщения", НомерВыборка.НомерСообщения);

				ДеталиВыборка = Запрос.Выполнить().Выбрать();

				Пока ДеталиВыборка.Следующий() Цикл

					Если Лев(НомерВыборка.КлючТаблицы, 2) = "1." Тогда

						СтрокаТаблицы = ДанныеСообщения.ТаблицаСсылок.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДеталиВыборка.ДанныеСообщения.Получить());

					Иначе

						ДанныеСообщения.ДанныеРегистра.Добавить(ДеталиВыборка.ДанныеСообщения.Получить());

					КонецЕсли;

				КонецЦикла;

				ВыполнитьЗагрузкуДанныхДляУзла(НомерВыборка.УзелПолучатель, ДанныеСообщения,, Истина);

			КонецЦикла;

		КонецЦикла;

	КонецЦикла;

	Запрос.Текст =
	"УНИЧТОЖИТЬ Источник"
	;
	Запрос.Выполнить();

КонецПроцедуры

#Область ЗаполнениеДанныхФизическогоЛица
//	LNK 23.07.2018 14:11:42
Функция ЗаполнитьДанныеФизЛица(ЭкземплярОбъекта, ДанныеФизЛица)

	Если НЕ ЭкземплярОбъекта = Неопределено Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("ПометкаУдаления", ДанныеФизЛица.ПометкаУдаления, ЭкземплярОбъекта);
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("Наименование", ДанныеФизЛица.Наименование, ЭкземплярОбъекта);
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("ДатаРождения", ДанныеФизЛица.ДатаРождения, ЭкземплярОбъекта);
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("ИНН", ДанныеФизЛица.ИНН, ЭкземплярОбъекта);
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("Пол", ОбщегоНазначенияКлиентСервер.ЗначениеПеречисления(Перечисления.ПолФизическогоЛица, ДанныеФизЛица.Пол), ЭкземплярОбъекта);

		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("ДатаВыдачиПаспорта", ДанныеФизЛица.Паспорт.ДатаВыдачиПаспорта, ЭкземплярОбъекта);
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("КемВыданПаспорт", ДанныеФизЛица.Паспорт.КемВыданПаспорт, ЭкземплярОбъекта);
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("НомерПаспорта", СокрЛП(ДанныеФизЛица.Паспорт.НомерПаспорта), ЭкземплярОбъекта);
		НачатьТранзакцию();
		//Если ЭкземплярОбъекта.Модифицированность() Тогда 
		Попытка
			Если ЗначениеЗаполнено(ЭкземплярОбъекта.Ссылка) тогда 
	            // Бакан ТС 20250701 Добавил блокировку  
					Блокировка = Новый БлокировкаДанных;

					ЭлементБлокировки = Блокировка.Добавить("Справочник.ФизическиеЛица");
					ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
					ЭлементБлокировки.УстановитьЗначение("Ссылка", ЭкземплярОбъекта.Ссылка);
					
				    Блокировка.Заблокировать();

					ЭкземплярОбъекта.ОбменДанными.Загрузка = Истина;
					ЭкземплярОбъекта.Записать();
					
				Иначе
			//	1. Непосредственно ФизЛицо
					ЭкземплярОбъекта.ОбменДанными.Загрузка = Истина;
					ЭкземплярОбъекта.Записать();  
				КонецЕсли; 
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ФИОФизЛиц");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("ФизЛицо", ЭкземплярОбъекта.Ссылка);
				
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДокументыФизическихЛиц");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("ФизЛицо", ЭкземплярОбъекта.Ссылка); 
			    Блокировка.Заблокировать();
			//	1. Непосредственно ФизЛицо
				//ЭкземплярОбъекта.ОбменДанными.Загрузка = Истина;
				//ЭкземплярОбъекта.Записать();

			//	2. Фамилия Имя Отчество
				ФизЛицоФамилияИмяОтчество(ЭкземплярОбъекта.Ссылка, ДанныеФизЛица);

			//	3. Документ ФизЛица (Паспорт)
				ФизЛицоПаспорт(ЭкземплярОбъекта.Ссылка, ДанныеФизЛица);


			//	4. Телефоны ФизЛица 
				ФизЛицоТелефоны(ЭкземплярОбъекта, ДанныеФизЛица);
				ЗафиксироватьТранзакцию();
			
			Исключение


				ТекстОшибки = ОписаниеОшибки();
				ВызватьИсключение ТекстОшибки;

			КонецПопытки;

		//КонецЕсли;

		ЭкземплярОбъекта = ЭкземплярОбъекта.Ссылка;
	Иначе	
		
	КонецЕсли;

	Возврат ЭкземплярОбъекта;

КонецФункции // ЗаполнитьДанныеФизЛица()

Функция ЗаполнитьДанныеПодразделение(ЭкземплярОбъекта, ДанныеПодразделения, Магазин, СсылочныйКеш)

	Если НЕ ЭкземплярОбъекта = Неопределено Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("Владелец", СсылочныйКеш.Получить("Справочник.Организации#" + ДанныеПодразделения.Владелец), ЭкземплярОбъекта);
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("Родитель", СсылочныйКеш.Получить("Справочник.ОбособленныеПодразделенияОрганизаций#" + ДанныеПодразделения.Родитель), ЭкземплярОбъекта);
		ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("НаименованиеПолное", ДанныеПодразделения.Наименование, ЭкземплярОбъекта);

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтруктураУзловМагазины.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СтруктураУзлов.Магазины КАК СтруктураУзловМагазины
			|ГДЕ
			|	(СтруктураУзловМагазины.Магазин = &Магазин
			|			ИЛИ СтруктураУзловМагазины.Ссылка.Магазин = &Магазин)";
		
		Запрос.УстановитьПараметр("Магазин", СсылочныйКеш.Получить("Справочник.Магазины#" + Магазин));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("ЭлементСтруктуры", Выборка.Ссылка, ЭкземплярОбъекта);
		Иначе 
			ОбщегоНазначенияКлиентСервер.УстановитьЗначениеЕслиОтличается("ЭлементСтруктуры", Справочники.СтруктураУзлов.ЦентральныйОфис, ЭкземплярОбъекта);
		КонецЕсли;
		Если ЭкземплярОбъекта.Модифицированность() Тогда

			НачатьТранзакцию();

			Попытка

			//	1. Непосредственно ФизЛицо
				ЭкземплярОбъекта.ОбменДанными.Загрузка = Истина;
				ЭкземплярОбъекта.Записать();

				ЗафиксироватьТранзакцию();
			
			Исключение

				ОтменитьТранзакцию();

				ТекстОшибки = ОписаниеОшибки();
				ВызватьИсключение ТекстОшибки;

			КонецПопытки;

		КонецЕсли;

		ЭкземплярОбъекта = ЭкземплярОбъекта.Ссылка;
	Иначе	
		
	КонецЕсли;

	Возврат ЭкземплярОбъекта;

КонецФункции // ЗаполнитьДанныеФизЛица()

//	LNK 29.08.2018 14:16:54
Процедура ФизЛицоФамилияИмяОтчество(ФизЛицоСсылка, ДанныеФизЛица)	Экспорт

	Если ДанныеФизЛица.Свойство("ФИО") И НЕ ДанныеФизЛица.ФИО.Колонки.Количество() = 0 Тогда

		НаборЗаписей = РегистрыСведений.ФИОФизЛиц.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Отбор.ФизЛицо.Установить(ФизЛицоСсылка);

		НаборЗаписей.Записать();	//	очищаем всё!

		Для каждого СтрокаТаблицы Из ДанныеФизЛица.ФИО Цикл

			НаборЗаписей.Очистить();
			НаборЗаписей.Отбор.Период.Установить(СтрокаТаблицы.Период);

			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтрокаТаблицы);
			ЗаписьНабора.ФизЛицо = ФизЛицоСсылка;

			НаборЗаписей.Записать();	//	записываем уже по периодам.

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

//	LNK 29.08.2018 14:19:34
Процедура ФизЛицоПаспорт(ФизЛицоСсылка, ДанныеФизЛица)	Экспорт

	Если ДанныеФизЛица.Паспорт.Свойство("НомерПаспорта") И НЕ ПустаяСтрока(ДанныеФизЛица.Паспорт.НомерПаспорта) Тогда

		НаборЗаписей = РегистрыСведений.ДокументыФизическихЛиц.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Отбор.Период.Установить(?(ДанныеФизЛица.Паспорт.Свойство("Период"), ДанныеФизЛица.Паспорт.Период, ДанныеФизЛица.Паспорт.ДатаВыдачиПаспорта));
		НаборЗаписей.Отбор.ФизЛицо.Установить(ФизЛицоСсылка);
		НаборЗаписей.Отбор.ВидДокумента.Установить(Справочники.ВидыДокументовФизическихЛиц.Паспорт);

		ЗаписьНабора = НаборЗаписей.Добавить();

		ЗаписьНабора.Период       = НаборЗаписей.Отбор.Период.Значение;
		ЗаписьНабора.ФизЛицо      = НаборЗаписей.Отбор.ФизЛицо.Значение;
		ЗаписьНабора.ВидДокумента = НаборЗаписей.Отбор.ВидДокумента.Значение;

		Если ДанныеФизЛица.Паспорт.Свойство("Серия") Тогда

			ЗаписьНабора.Серия = ДанныеФизЛица.Паспорт.Серия;
			ЗаписьНабора.Номер = ДанныеФизЛица.Паспорт.Номер;

		Иначе

			НомерПаспорта = СокрЛП(ДанныеФизЛица.Паспорт.НомерПаспорта);

			ПозицияРазделителя = СтрНайти(НомерПаспорта, " ");
			ЗаписьНабора.Серия = Лев(НомерПаспорта, ПозицияРазделителя - 1);
			ЗаписьНабора.Номер = Сред(НомерПаспорта, ПозицияРазделителя + 1);

		КонецЕсли;

		ЗаписьНабора.ДатаВыдачи = ДанныеФизЛица.Паспорт.ДатаВыдачиПаспорта;
		ЗаписьНабора.КемВыдан   = ДанныеФизЛица.Паспорт.КемВыданПаспорт;

		ЗаписьНабора.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
		ЗаписьНабора.ДатаИзменения = ТекущаяДата();

		НаборЗаписей.ЗаполнитьПредставление();

		НаборЗаписей.Записать();

	КонецЕсли;

КонецПроцедуры

Процедура ФизЛицоТелефоны(ФизЛицоОбъект, ДанныеФизЛица)	Экспорт

	Если ДанныеФизЛица.Телефоны.Свойство("Представление") И НЕ ПустаяСтрока(ДанныеФизЛица.Телефоны.Представление) Тогда
		
		ВидКИТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонФизическогоЛица;
		ТипКИТелефон = Перечисления.ТипыКонтактнойИнформации.Телефон;
		
		ЗначениеXML = КонтактнаяИнформацияВызовСервера.ПарсингКонтактнойИнформацииXML(ДанныеФизЛица.Телефоны.Представление, ВидКИТелефон);
		
		СтрокаТелефона = ФизЛицоОбъект.КонтактнаяИнформация.Добавить();
		Для Каждого СтрокаКонтактнойИнформации Из ФизЛицоОбъект.КонтактнаяИнформация Цикл 
			
			Если СтрокаКонтактнойИнформации.Вид = ВидКИТелефон  Тогда 
				
				СтрокаТелефона = СтрокаКонтактнойИнформации;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ФизЛицоОбъект, ЗначениеXML, ВидКИТелефон, ТипКИТелефон, СтрокаТелефона);
		
		
	//	Приведение номера к стандарту поиска.
		НомерТелефона = ОтправкаSMS.ПодготовитьНомерТелефона(ДанныеФизЛица.Телефоны.Представление);
		Контрагент    = Неопределено;	//	сбрасываем значение, возможно, ранее установленное

		ПараметрыИдентификации = Новый Структура(
			"НазначениеДанных, РазрешеноСозданиеНового"
			, Перечисления.НазначениеКонтрагентовОтложенных.ПроверкаВРознице
			, Истина
		);

		ДанныеКонтрагента = Новый Структура;
		ДанныеФИО = Неопределено;
		Если ДанныеФизЛица.Свойство("ФИО") И НЕ ДанныеФизЛица.ФИО.Колонки.Количество() = 0 Тогда
			Для каждого СтрокаТаблицы Из ДанныеФизЛица.ФИО Цикл
				ДанныеФИО = ОбменMicrosoftDynamicsСервер.ИнициализацияДанныхФИО(ДанныеФИО, СтрокаТаблицы.Фамилия, СтрокаТаблицы.Имя, СтрокаТаблицы.Отчество);
			КонецЦикла;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ПроверитьСвойство("Пол"		 , Перечисления.ПолФизическогоЛица.ПустаяСсылка(), ДанныеКонтрагента);
		ОбщегоНазначенияКлиентСервер.ПроверитьСвойство("ДатаРождения", '00010101', ДанныеКонтрагента);
		
		ДанныеКонтрагента.Пол = ОбщегоНазначенияКлиентСервер.ЗначениеПеречисления(Перечисления.ПолФизическогоЛица, ДанныеФизЛица.Пол);
		ДанныеКонтрагента.ДатаРождения = ДанныеФизЛица.ДатаРождения;

		
		СоставДанных = ОбменMicrosoftDynamicsСлужебный.ИдентифицироватьКлиентаПоДаннымCRM(
			  Неопределено
			, ДанныеКонтрагента
			, ""
			, НомерТелефона
			, Неопределено
			, ПараметрыИдентификации
			, ДанныеФИО
		);

		//Если СоставДанных.Контрагент = Неопределено ИЛИ СоставДанных.Ошибка = Истина Тогда

		//	ТекстСообщения = "Покупатель по номеру телефона «" + НомерТелефона + "» НЕ ОБНАРУЖЕН!"
		//	+ ?(ПустаяСтрока(СоставДанных.ОписаниеОшибки), "", Символы.ПС + СоставДанных.ОписаниеОшибки);
       		Если  СоставДанных.Ошибка = Истина Тогда

			ТекстСообщения = "Покупатель по номеру телефона «" + НомерТелефона + "» НЕ ОБНАРУЖЕН!"
			+ ?(ПустаяСтрока(СоставДанных.ОписаниеОшибки), "", Символы.ПС + СоставДанных.ОписаниеОшибки);

        	ИначеЕсли СоставДанных.Контрагент = Неопределено Тогда
            	СпрКонтрагент = ПолучитьКонтрагента(ФизЛицоОбъект.Ссылка);
				Если СпрКонтрагент = Неопределено тогда
					ТекстСообщения = "Покупатель по номеру телефона «" + НомерТелефона + "» НЕ ОБНАРУЖЕН!"
					+ ?(ПустаяСтрока(СоставДанных.ОписаниеОшибки), "", Символы.ПС + СоставДанных.ОписаниеОшибки); 
				Иначе
					
					УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(СпрКонтрагент.ПолучитьОбъект(), ЗначениеXML, ВидКИТелефон, ТипКИТелефон, СтрокаТелефона);
				КонецЕсли;


		Иначе
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(СоставДанных.Контрагент.ПолучитьОбъект(), ЗначениеXML, ВидКИТелефон, ТипКИТелефон, СтрокаТелефона);
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СоставДанных.Контрагент, "ФизЛицо", Справочники.ФизическиеЛица.ПустаяСсылка(), Ложь).Пустая() Тогда 
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ИменаЛюдей.Ссылка КАК Ссылка
					|ПОМЕСТИТЬ ИмяФизЛица
					|ИЗ
					|	РегистрСведений.ФИОФизЛиц.СрезПоследних(, ) КАК ФизическоеЛицо
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИменаЛюдей КАК ИменаЛюдей
					|		ПО (ИменаЛюдей.Наименование = ФизическоеЛицо.Имя
					|				ИЛИ ФизическоеЛицо.Имя = ИменаЛюдей.НаименованиеУкраинское)
					|ГДЕ
					|	ФизическоеЛицо.ФизЛицо = &ФизЛицо
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ИменаЛюдей.Ссылка КАК Ссылка
					|ПОМЕСТИТЬ ИмяКонтрагента
					|ИЗ
					|	РегистрСведений.ФИОФизЛиц.СрезПоследних(, ) КАК Контрагент
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИменаЛюдей КАК ИменаЛюдей
					|		ПО (ИменаЛюдей.Наименование = Контрагент.Имя
					|				ИЛИ Контрагент.Имя = ИменаЛюдей.НаименованиеУкраинское)
					|ГДЕ
					|	Контрагент.ФизЛицо = &Контрагент
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ИмяФизЛица.Ссылка КАК Ссылка
					|ИЗ
					|	ИмяФизЛица КАК ИмяФизЛица
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИмяКонтрагента КАК ИмяКонтрагента
					|		ПО (ИмяКонтрагента.Ссылка = ИмяФизЛица.Ссылка)";
				
				Запрос.УстановитьПараметр("Контрагент", СоставДанных.Контрагент);
				Запрос.УстановитьПараметр("ФизЛицо", ФизЛицоОбъект.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если Не РезультатЗапроса.Пустой() Тогда 
               		 // Бакан ТС 20250701 Добавил блокировку  
					Блокировка = Новый БлокировкаДанных;

					ЭлементБлокировки = Блокировка.Добавить("Справочник.Контрагенты");
					ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
					ЭлементБлокировки.УстановитьЗначение("Ссылка", СоставДанных.Контрагент);

					НачатьТранзакцию();
					Попытка
					    Блокировка.Заблокировать();

					    КонтрагентОбъект = СоставДанных.Контрагент.ПолучитьОбъект();
					    КонтрагентОбъект.ФизЛицо = ФизЛицоОбъект.Ссылка;
					    КонтрагентОбъект.ОбменДанными.Загрузка = Истина; 
						УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(КонтрагентОбъект, ЗначениеXML, ВидКИТелефон, ТипКИТелефон, СтрокаТелефона);
					    КонтрагентОбъект.Записать();

					    ЗафиксироватьТранзакцию();
					Исключение
					    ОтменитьТранзакцию();
					    ВызватьИсключение;
					КонецПопытки;
					//КонтрагентОбъект = СоставДанных.Контрагент.ПолучитьОбъект();
					//КонтрагентОбъект.ФизЛицо = ФизЛицоОбъект.Ссылка;
					//КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
					//КонтрагентОбъект.Записать();
					
				Иначе
					Тема = "Ошибка связи клиента и ФизЛица";
					
					Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Физическое лицо - %1
						|ИНН: %2 
						|Телефон: %3
						|Контрагент по этому телефону: %4",
						ФизЛицоОбъект, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизЛицоОбъект.Ссылка,"ИНН"), ДанныеФизЛица.Телефоны.Представление, СоставДанных.Контрагент);
							
					ПараметрыПисьма = Новый Структура;
					ПараметрыПисьма.Вставить("Тема", Тема);
					ПараметрыПисьма.Вставить("Тело", Текст);
					КомуОтправлятьМассив = Новый Массив;
					КомуОтправлятьМассив.Добавить(Новый Структура("Адрес, Представление","serhii.myshynskyi@antoshka.ua",""));
					КомуОтправлятьМассив.Добавить(Новый Структура("Адрес, Представление","yurii.sichkarenko@antoshka.ua",""));
					
					ПараметрыПисьма.Вставить("Кому", КомуОтправлятьМассив);
							
					РаботаСПочтовымиСообщениями.ОтправитьСообщение(РаботаСПочтовымиСообщениями.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
				КонецЕсли;
				
				ТекстСообщения = ""; 
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

//	LNK 20.07.2018 14:49:17
Функция ПроверитьВозможностьПринятияНабораЗаписей(НаборЗаписей, ОснованиеОтказа)

	Отказ = Ложь;

	КлючиКонтроля = Новый Массив;
	КлючиКонтроля.Добавить(Новый Структура("Имя, Описание", "Организация", "Справочник.Организации"));
	КлючиКонтроля.Добавить(Новый Структура("Имя, Описание", "Сотрудник", "Справочник.ФизическиеЛица"));

	Для каждого КлючКонтроля Из КлючиКонтроля Цикл

		Если НЕ ЗначениеЗаполнено(НаборЗаписей.Отбор[КлючКонтроля.Имя].Значение) Тогда

			Отказ = Истина;
			ОснованиеОтказа = ОснованиеОтказа + ?(ПустаяСтрока(ОснованиеОтказа), "", Символы.ПС)
			+ "Измерение «" + КлючКонтроля.Имя + "» (" + КлючКонтроля.Описание + ")"

		КонецЕсли;

	КонецЦикла;

	КлючиКонтроля = Новый Массив;
	КлючиКонтроля.Добавить(Новый Структура("Имя, Описание", "ВидЗанятости", "Перечисление.ВидыЗанятости"));
	КлючиКонтроля.Добавить(Новый Структура("Имя, Описание", "Магазин", "связано по Справочник.Склады"));
	КлючиКонтроля.Добавить(Новый Структура("Имя, Описание", "Должность", "Справочник.ДолжностиОрганизаций"));
	КлючиКонтроля.Добавить(Новый Структура("Имя, Описание", "СостояниеСотрудника", "Перечисление.ПричиныИзмененияСостояния"));

	НомерСтроки = 1;
	БылУказанРегистратор = Ложь;

	Для каждого ЗаписьНабора Из НаборЗаписей Цикл

		ОснованиеСтроки = "";

		Для каждого КлючКонтроля Из КлючиКонтроля Цикл

			Если НЕ ЗначениеЗаполнено(ЗаписьНабора[КлючКонтроля.Имя]) Тогда

				ОснованиеСтроки = ОснованиеСтроки + ?(ПустаяСтрока(ОснованиеСтроки), "", " # ")
				+ "ресурс «" + КлючКонтроля.Имя + "» (" + КлючКонтроля.Описание + ")"

			КонецЕсли;

		КонецЦикла;

		Если НЕ ПустаяСтрока(ОснованиеСтроки) Тогда

			Отказ = Истина;
			ОснованиеОтказа = ОснованиеОтказа + ?(ПустаяСтрока(ОснованиеОтказа), "", Символы.ПС)
				+ "стр." + Формат(НомерСтроки, "ЧДЦ=; ЧГ=") + ". " + ОснованиеСтроки;

		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

		Если Отказ И НЕ БылУказанРегистратор Тогда

		//	Представление регистратора только в таблице "набора записей".
			ОснованиеОтказа = "Регистратор: " + ЗаписьНабора.ДокументДвижения + Символы.ПС + ОснованиеОтказа;
			БылУказанРегистратор = Истина;

		КонецЕсли;

	КонецЦикла;

	Возврат НЕ Отказ;

КонецФункции

//	LNK 19.07.2018 14:55:23
Функция ПолучитьСсылочныйОбъект(ПараметрыПоиска, МенеджерОбъекта, ПолноеИмя, ВторичныйКлюч = "", СсылочныйКеш)

	//СсылкаНаОбъект = СсылочныйКеш.Получить(ПараметрыПоиска.СтрокаТаблицы.Имя + "#" + ПараметрыПоиска.СтрокаТаблицы.Идентификатор);
	СсылкаНаОбъект = СсылочныйКеш.Получить(ПолноеИмя + "#" + ПараметрыПоиска.СтрокаТаблицы.Идентификатор);

	Если СсылкаНаОбъект = Неопределено Тогда

		СсылкаНаОбъект = МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыПоиска.СтрокаТаблицы.Идентификатор));

		НайденПоСоответствию = Ложь;

		Если ОбщегоНазначенияКлиентСервер.СсылкаПустая(СсылкаНаОбъект) Тогда

			Если НЕ ПустаяСтрока(ВторичныйКлюч) И НЕ ПустаяСтрока(ПараметрыПоиска.СтрокаТаблицы.Данные[ВторичныйКлюч]) Тогда

				ТекстЗапроса =
				"ВЫБРАТЬ
				|	ТаблицаСправочник.Ссылка КАК Ссылка,
				|	ТаблицаСправочник.ПометкаУдаления КАК ПометкаУдаления
				|ИЗ
				|	Справочник.ФизическиеЛица КАК ТаблицаСправочник
				|ГДЕ
				|	ТаблицаСправочник.ИНН = &ВторичныйКлюч
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПометкаУдаления УБЫВ"
				;
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.ФизическиеЛица КАК", ПолноеИмя + " КАК");
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТаблицаСправочник.ИНН =", "ТаблицаСправочник." + ВторичныйКлюч + " =");

				Запрос = Новый Запрос(ТекстЗапроса);
				Запрос.УстановитьПараметр("ВторичныйКлюч", ПараметрыПоиска.СтрокаТаблицы.Данные[ВторичныйКлюч]);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда

					СсылкаНаОбъект = Выборка.Ссылка;

				КонецЕсли;

			КонецЕсли;

			Если ОбщегоНазначенияКлиентСервер.СсылкаПустая(СсылкаНаОбъект) Тогда	//	.. нет такого объекта!

				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	ТаблицаСоответствий.УникальныйИдентификаторИсточника КАК Ссылка
				|ИЗ
				|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК ТаблицаСоответствий
				|ГДЕ
				|	ТаблицаСоответствий.УзелИнформационнойБазы = &Узел
				|	И ТаблицаСоответствий.УникальныйИдентификаторПриемника = &Идентификатор
				|	И ТаблицаСоответствий.ТипПриемника = &ТипПриемника
				|	И ТаблицаСоответствий.ТипИсточника = &ТипИсточника"
				);
				Запрос.УстановитьПараметр("Узел", ПараметрыПоиска.Узел);
				Запрос.УстановитьПараметр("ТипПриемника" , ПараметрыПоиска.СтрокаТаблицы.Имя);	//	"Внешнее" имя!
				Запрос.УстановитьПараметр("ТипИсточника" , ПолноеИмя);			//	"Внутреннее" имя!
				Запрос.УстановитьПараметр("Идентификатор", ПараметрыПоиска.СтрокаТаблицы.Идентификатор);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				НужноЗаполнитьСоответствие = Истина;
				Пока Выборка.Следующий() Цикл 
					Если НЕ ОбщегоНазначенияКлиентСервер.СсылкаПустая(Выборка.Ссылка) Тогда
						СсылкаНаОбъект = Выборка.Ссылка;
						НайденПоСоответствию = Истина; 
						НужноЗаполнитьСоответствие = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ОбщегоНазначенияКлиентСервер.СсылкаПустая(СсылкаНаОбъект) Тогда

					Если ПараметрыПоиска.Создать Тогда

						НовыйОбъект = МенеджерОбъекта.СоздатьЭлемент();

						НовыйОбъект.УстановитьСсылкуНового(МенеджерОбъекта.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыПоиска.СтрокаТаблицы.Идентификатор)));
						НовыйОбъект.Наименование = ПараметрыПоиска.СтрокаТаблицы.Данные.Наименование;

						Если НЕ НовыйОбъект.Метаданные().ДлинаКода = 0 Тогда

							НовыйОбъект.УстановитьНовыйКод();

						КонецЕсли;

						Если НЕ ПустаяСтрока(ВторичныйКлюч) И НЕ ПустаяСтрока(ПараметрыПоиска.СтрокаТаблицы.Данные[ВторичныйКлюч]) Тогда

							НовыйОбъект[ВторичныйКлюч] = ПараметрыПоиска.СтрокаТаблицы.Данные[ВторичныйКлюч];

						КонецЕсли;

						НовыйОбъект.ОбменДанными.Загрузка = Истина;
						
						Если ОбщегоНазначения.ЕстьРеквизитОбъекта(НовыйОбъект, "НаименованиеПолное") Тогда 
							НовыйОбъект.НаименованиеПолное = НовыйОбъект.Наименование;
						КонецЕсли;
						
						НовыйОбъект.Записать();
						СсылкаНаОбъект = НовыйОбъект.Ссылка;

					ИначеЕсли НужноЗаполнитьСоответствие Тогда

						НаборЗаписей = РегистрыСведений.СоответствияОбъектовИнформационныхБаз.СоздатьНаборЗаписей();
						НаборЗаписей.ОбменДанными.Загрузка = Истина;

						НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить(ПараметрыПоиска.Узел);
						НаборЗаписей.Отбор.УникальныйИдентификаторПриемника.Установить(ПараметрыПоиска.СтрокаТаблицы.Идентификатор);
						НаборЗаписей.Отбор.ТипПриемника.Установить(ПараметрыПоиска.СтрокаТаблицы.Имя);	//	"Внешнее" имя!
						НаборЗаписей.Отбор.ТипИсточника.Установить(ПолноеИмя);			//	"Внутреннее" имя!

						ЗаписьНабора = НаборЗаписей.Добавить();
						ЗаписьНабора.УзелИнформационнойБазы = НаборЗаписей.Отбор.УзелИнформационнойБазы.Значение;
						ЗаписьНабора.УникальныйИдентификаторПриемника = НаборЗаписей.Отбор.УникальныйИдентификаторПриемника.Значение;
						ЗаписьНабора.ТипПриемника = НаборЗаписей.Отбор.ТипПриемника.Значение;
						ЗаписьНабора.ТипИсточника = НаборЗаписей.Отбор.ТипИсточника.Значение;

						ЗаписьНабора.Представление = ПараметрыПоиска.СтрокаТаблицы.Данные.Наименование;

						НаборЗаписей.Записать();

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

		Если НЕ ОбщегоНазначенияКлиентСервер.СсылкаПустая(СсылкаНаОбъект) Тогда

			СсылочныйКеш.Вставить(ПолноеИмя + "#" + ПараметрыПоиска.СтрокаТаблицы.Идентификатор, СсылкаНаОбъект);

			Если НЕ НайденПоСоответствию Тогда

				УдалитьОбъектИзРегистраСоответствий(ПараметрыПоиска.Узел, ПараметрыПоиска.СтрокаТаблицы, ПолноеИмя, СсылкаНаОбъект);

			КонецЕсли;

			РегистрыСведений.ОчередьОтказанныхСообщений.УдалитьИзОчереди(ПараметрыПоиска.Узел, ПараметрыПоиска.СтрокаТаблицы.Имя, ПараметрыПоиска.СтрокаТаблицы.Идентификатор);

			Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.Склады") Тогда

			//	"переводим" склад в магазин..
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	ТаблицаСправочник.Магазин КАК Магазин
				|ИЗ
				|	Справочник.Склады КАК ТаблицаСправочник
				|ГДЕ
				|	ТаблицаСправочник.Ссылка = &СсылкаНаОбъект"
				);
				Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);

				Выборка = Запрос.Выполнить().Выбрать();
				Выборка.Следующий();

				СсылкаНаОбъект = Выборка.Магазин;
			//	.. и в кеше тоже слепим подмену понятий!
				СсылочныйКеш.Вставить("Справочник.Магазины#" + ПараметрыПоиска.СтрокаТаблицы.Идентификатор, СсылкаНаОбъект);

			КонецЕсли;

		Иначе

			СсылкаНаОбъект = Неопределено;

		КонецЕсли;

	КонецЕсли;

	Возврат ?(ПараметрыПоиска.КакОбъект И НЕ СсылкаНаОбъект = Неопределено, СсылкаНаОбъект.ПолучитьОбъект(), СсылкаНаОбъект);

КонецФункции // ПолучитьСсылочныйОбъект()

//	LNK 20.07.2018 08:19:33
Процедура УдалитьОбъектИзРегистраСоответствий(Узел, СтрокаТаблицы, ПолноеИмя, СсылкаНаОбъект)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСоответствий.УникальныйИдентификаторИсточника КАК УникальныйИдентификаторИсточника,
	|	ТаблицаСоответствий.УникальныйИдентификаторПриемника КАК УникальныйИдентификаторПриемника,
	|	ТаблицаСоответствий.ТипПриемника КАК ТипПриемника
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК ТаблицаСоответствий
	|ГДЕ
	|	ТаблицаСоответствий.УзелИнформационнойБазы = &Узел
	|	И (ТаблицаСоответствий.УникальныйИдентификаторИсточника = &СсылкаНаОбъект
	|			ИЛИ ТаблицаСоответствий.УникальныйИдентификаторПриемника = &Идентификатор
	|				И (ТаблицаСоответствий.ТипПриемника = &ТипПриемника
	|					И ТаблицаСоответствий.ТипИсточника = &ТипИсточника))"
	);
	Запрос.УстановитьПараметр("Узел", Узел);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ТипПриемника"  , СтрокаТаблицы.Имя);	//	"Внешнее" имя!
	Запрос.УстановитьПараметр("Идентификатор" , СтрокаТаблицы.Идентификатор);
	Запрос.УстановитьПараметр("ТипИсточника" , ПолноеИмя);			//	"Внутреннее" имя!
	
	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда

		Выборка = Результат.Выбрать();

		НаборЗаписей = РегистрыСведений.СоответствияОбъектовИнформационныхБаз.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;

		Пока Выборка.Следующий() Цикл

			НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить(Узел);
			НаборЗаписей.Отбор.УникальныйИдентификаторИсточника.Установить(Выборка.УникальныйИдентификаторИсточника);
			НаборЗаписей.Отбор.УникальныйИдентификаторПриемника.Установить(Выборка.УникальныйИдентификаторПриемника);
			НаборЗаписей.Отбор.ТипПриемника.Установить(Выборка.ТипПриемника);	//	"Внешнее" имя!
			НаборЗаписей.Отбор.ТипПриемника.Установить(ПолноеИмя);			//	"Внутреннее" имя!

			НаборЗаписей.Записать();

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Процедура  СделатьЗаписьДляОбновленияСпрПользователиИФизЛица(ФизЛицо)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьОтказанныхСообщений.ФизЛицо КАК ФизЛицо
		|ИЗ
		|	РегистрСведений.ОчередьОтказанныхСообщений КАК ОчередьОтказанныхСообщений
		|ГДЕ
		|	ОчередьОтказанныхСообщений.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() тогда
		НаборЗаписей = РегистрыСведений.ОчередьОтказанныхСообщений.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;

		НаборЗаписей.Отбор.УзелПолучатель.Установить(ПланыОбмена.ОбменРозницаЗарплатаУправлениеПерсоналом.ПустаяСсылка());
		НаборЗаписей.Отбор.НомерСообщения.Установить(1);
		НаборЗаписей.Отбор.ТипОтправителя.Установить("Розница");
		НаборЗаписей.Отбор.Идентификатор.Установить(Строка(ФизЛицо.УникальныйИдентификатор()));
		НаборЗаписей.Отбор.Индекс.Установить(1);

		ЗаписьНабора = НаборЗаписей.Добавить();

		ЗаписьНабора.УзелПолучатель = ПланыОбмена.ОбменРозницаЗарплатаУправлениеПерсоналом.ПустаяСсылка();
		ЗаписьНабора.НомерСообщения = 1;
		ЗаписьНабора.ТипОтправителя = "Розница";
		ЗаписьНабора.Идентификатор  = Строка(ФизЛицо.УникальныйИдентификатор());
		ЗаписьНабора.Индекс = 1;
		ЗаписьНабора.ДанныеСообщения = Новый ХранилищеЗначения("Обвноить справочники Физ лица и Пользователи!", Новый СжатиеДанных(9));

		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры
//	LNK 19.07.2018 14:55:23
Функция ПолучитьКонтрагента(ФизЛицо)
	Контрагент = Неопределено;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Контрагент = Выборка.Контрагент;
	КонецЦикла;
	
	Возврат Контрагент;
	
КонецФункции // ПолучитьСсылочныйОбъект()


#КонецОбласти
