
Процедура ЗаписьКомментария(СтруктураКомментария) Экспорт
	
	НаборЗаписей = РегистрыСведений.КомментарийПоСтрокам.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Автор.Установить(СтруктураКомментария.Автор);
	НаборЗаписей.Отбор.Документ.Установить(СтруктураКомментария.Документ);
	НаборЗаписей.Отбор.Дата.Установить(СтруктураКомментария.Дата);
	НаборЗаписей.Отбор.КлючСвязи.Установить(СтруктураКомментария.КлючСвязи);

	НоваяЗапись = НаборЗаписей.Добавить();

	НоваяЗапись.Дата = СтруктураКомментария.Дата;
	НоваяЗапись.Документ = СтруктураКомментария.Документ;
	НоваяЗапись.Автор = СтруктураКомментария.Автор;
	НоваяЗапись.КлючСвязи = СтруктураКомментария.КлючСвязи;
	НоваяЗапись.Комментарий = СтруктураКомментария.Комментарий;
	НоваяЗапись.Просмотрен = СтруктураКомментария.Просмотрен;
	Если СтруктураКомментария.УзелСоздания = Неопределено Тогда
		НоваяЗапись.УзелСоздания = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ЭлементСтруктуры;
	Иначе
		НоваяЗапись.УзелСоздания = СтруктураКомментария.УзелСоздания;
	КонецЕсли;

	НаборЗаписей.Записать(Истина); 
	
КонецПроцедуры

Функция СтруктураКомментария() Экспорт 
	
	СтруктураКомментария = Новый Структура;
	СтруктураКомментария.Вставить("Дата");
	СтруктураКомментария.Вставить("Документ");
	СтруктураКомментария.Вставить("Автор");
	СтруктураКомментария.Вставить("КлючСвязи");
	СтруктураКомментария.Вставить("Комментарий");
	СтруктураКомментария.Вставить("Просмотрен");
	СтруктураКомментария.Вставить("УзелСоздания", Неопределено);
	
	Возврат СтруктураКомментария;

КонецФункции
