
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		
		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
			
			Если ТипЗнч(ЗаписьНабора.Документ) = Тип("ДокументСсылка.ЗапросДоступностиТоваров") Тогда
		
				ДокуметСостояния = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьНабора.Документ, "ДокументОснование");
				РегистрыСведений.СостояниеЗаказаПокупателя.ЗаписьСостояния(ДокуметСостояния);
		
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
