Процедура ЗаписьСостояниеЗапросаДоступностиТоваров(ЗапросДоступности) Экспорт
	
	НаборЗаписей = РегистрыСведений.СостояниеЗапросаДоступностиТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Отбор.ЗапросДоступностиТоваров.Установить(ЗапросДоступности);   
	
	ТЗЗапросаДоступности = НаборЗаписей.Выгрузить();
	
	ТЗЗапросаДоступности = ИзменениеОбеспечения(ТЗЗапросаДоступности, ЗапросДоступности);
	
	
	НаборЗаписей.Загрузить(ТЗЗапросаДоступности); 
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры   

Функция ИзменениеОбеспечения(ТЗ, ЗапросДоступности) 
	
	Если ЗапросДоступности.МагазинОтправитель = ЗапросДоступности.МагазинПолучатель Тогда 
		
		Обеспечение = Истина;
		
		Если ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Изменён Тогда 
			
			Обеспечение = Ложь; 
			
		КонецЕсли;
		
		Если ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Согласован Тогда 
			
			
			Для Каждого СтрокаТЧ Из ЗапросДоступности.Товары Цикл
				
				ЧастичноОбеспечено = Не (СтрокаТЧ.Количество = СтрокаТЧ.КоличествоТребование);
				
				ОтборСтроки = Новый Структура();
				ОтборСтроки.Вставить("КлючСвязи", СтрокаТЧ.КлючСвязи);
				Строки = ТЗ.НайтиСтроки(ОтборСтроки); 
				
				Если Строки.Количество() > 0 Тогда
					Строки[0].Обеспечение = Обеспечение И Не ЧастичноОбеспечено;
					Строки[0].ЧастичноОбеспечено = ЧастичноОбеспечено;
				Иначе
					
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрока.ЗапросДоступностиТоваров = ЗапросДоступности;  
					НоваяСтрока.КлючСвязи = СтрокаТЧ.КлючСвязи;  
					НоваяСтрока.Обеспечение = Обеспечение И Не ЧастичноОбеспечено;
					НоваяСтрока.ЧастичноОбеспечено = ЧастичноОбеспечено;
					
				КонецЕсли;			
				
				
			КонецЦикла;
			
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат ТЗ;
	
КонецФункции
