
// Функция получения параметров для анализа пересортицы по умолчанию
//
Функция ПолучитьМассивПараметровАнализаПересортицыПоУмолчанию() Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(НСтр("ru = 'Одинаковые позиции номенклатуры'"));
	МассивПараметров.Добавить(НСтр("ru = 'Данные предыдущих пересортиц'"));
	МассивПараметров.Добавить(НСтр("ru = 'Наименование одной из позиции включает наименование другой'"));
	МассивПараметров.Добавить(НСтр("ru = 'Совпадение первого слова в наименованиях'"));
	МассивПараметров.Добавить(НСтр("ru = 'Принадлежность к одной группе номенклатуры'"));
	МассивПараметров.Добавить(НСтр("ru = 'Принадлежность к одной номенклатурной группе'"));
	Если АссортиментВызовСервера.ИспользоватьАссортимент() Тогда
		МассивПараметров.Добавить(НСтр("ru = 'Принадлежность к одной товарной категории'"));
	КонецЕсли;
	
	Возврат МассивПараметров;
	
КонецФункции
