Процедура ПередЗаписью(Отказ, Замещение)	//	LNK 01.03.2021 17:03:28

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		ЗаписьНабора.ДатаИзменения = ТекущаяДата();

	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)	//	LNK 27.07.2021 04:49:37

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ Количество() = 0 Тогда

		ТекстЗаписи = РегистрыСведений.УчетнаяПолитика.ПредставлениеЗаписи(ЭтотОбъект[0], Метаданные());
		ЖурналСобытий.Регистрация("ПОЛИТИКА", УровеньЖурналаРегистрации.Информация
			, Метаданные()
			,
			,
			, ТекстЗаписи
			, ТекстЗаписи
			, Ложь
			, Ложь
		);

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если НЕ ЭтотОбъект.Количество() = 0 Тогда

		ЗаписьНабора = ЭтотОбъект[0];	//	всегда одна запись
		НеПроверяемыеРеквизиты = Новый Массив;

		Если НЕ ЗаписьНабора.ИспользоватьБонуснуюСистему Тогда

		//	НеПроверяемыеРеквизиты.Добавить("имя");

		КонецЕсли;

		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);

	КонецЕсли;

КонецПроцедуры










