#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.РекламныйМатериал КАК РекламныйМатериал,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.РекламнаяПлоскость КАК РекламнаяПлоскость,
	|	СУММА(ПриемкаРекламныхМатериаловРекламныеМатериалы.Количество) КАК Количество,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Магазин КАК Магазин,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.ДокументРаспоряжение КАК ДокументРаспоряжение,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Дата КАК Период,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка КАК ДокументПриемки
	|ИЗ
	|	Документ.ПриемкаРекламныхМатериалов.РекламныеМатериалы КАК ПриемкаРекламныхМатериаловРекламныеМатериалы
	|ГДЕ
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.РекламнаяПлоскость,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.РекламныйМатериал,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Организация,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Магазин,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.ДокументРаспоряжение,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Дата,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.РекламныйМатериал КАК РекламныйМатериал,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.РекламнаяПлоскость КАК РекламнаяПлоскость,
	|	СУММА(ПриемкаРекламныхМатериаловРекламныеМатериалы.Количество) КАК Количество,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Магазин КАК Магазин,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка КАК ДокументПриемки,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Дата КАК Период,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.ДокументРаспоряжение КАК ДокументРаспоряжение
	|ИЗ
	|	Документ.ПриемкаРекламныхМатериалов.РекламныеМатериалы КАК ПриемкаРекламныхМатериаловРекламныеМатериалы
	|ГДЕ
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка = &ДокументСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.РекламнаяПлоскость,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.РекламныйМатериал,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Организация,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Магазин,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.ДокументРаспоряжение,
	|	ПриемкаРекламныхМатериаловРекламныеМатериалы.Ссылка.Дата"
	);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);

	Результаты = Запрос.ВыполнитьПакет();

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРекламныеМатериалыКОтгрузке", Результаты[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаРекламныеМатериалыКПриемке", Результаты[1].Выгрузить());

КонецПроцедуры

#КонецОбласти

#КонецЕсли


