
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ТекущийРаздел", "ОбменДанными");
	
	#Если ВебКлиент Тогда
	ОкноОткрытияПанели = ПараметрыВыполненияКоманды.Окно;
	#Иначе
	ОкноОткрытияПанели = ПараметрыВыполненияКоманды.Источник;
	#КонецЕсли 

	ОткрытьФорму(
		"ОбщаяФорма.ПанельАдминистрированияИБ",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ОкноОткрытияПанели);
	
	// Оповестим для режима закладок
	Оповестить("ПереключениеРазделаАдминистрированияИБ", ПараметрыФормы);
	
КонецПроцедуры
