&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Перем ЗначениеИзСтруктуры;

	Если Параметры.Свойство("ТекущийЭлемент", ЗначениеИзСтруктуры) Тогда

		НачальныйЭлемент = ЗначениеИзСтруктуры;

	КонецЕсли;

	Если Параметры.Свойство("МножественныйВыбор", ЗначениеИзСтруктуры) И ТипЗнч(ЗначениеИзСтруктуры) = Тип("Булево") Тогда

		Элементы.Список.МножественныйВыбор = ЗначениеИзСтруктуры;

	КонецЕсли;

	Если Параметры.Свойство("РежимВыделения", ЗначениеИзСтруктуры) Тогда

		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы[ЗначениеИзСтруктуры];

	КонецЕсли;

	Если Параметры.Свойство("ОтборСсылок", ЗначениеИзСтруктуры) Тогда

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"Ссылка", 
			ЗначениеИзСтруктуры, 
			Истина,
			ВидСравненияКомпоновкиДанных.ВСписке
		);

	КонецЕсли;

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Список, 
		"ПометкаУдаления", 
		Ложь, 
		Истина,
		ВидСравненияКомпоновкиДанных.Равно
	);

КонецПроцедуры








