//	LNK 30.11.2017 08:27:07
Процедура РегистрацияПользователя()	Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;

	Если НЕ ОбменДаннымиПовтИсп.ЭтоГлавныйУзел()
		И НЕ РольДоступна(Метаданные.Роли.АдминистраторСистемы)
		И ЗначениеЗаполнено(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин)
		И ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь)
	Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПрисутствиеПользователя.Магазин КАК Магазин
		|ИЗ
		|	РегистрСведений.ПрисутствиеПользователя.СрезПоследних(, Пользователь = &ТекущийПользователь) КАК ПрисутствиеПользователя
		|ГДЕ
		|	ПрисутствиеПользователя.Магазин = &ТекущийМагазин"
		);
		Запрос.УстановитьПараметр("ТекущийМагазин"     , ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин);
		Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
		
		Если Запрос.Выполнить().Пустой() Тогда

			МенеджерЗаписи = РегистрыСведений.ПрисутствиеПользователя.СоздатьМенеджерЗаписи();

			МенеджерЗаписи.Период = ТекущаяДатаСеанса();

			МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;

			МенеджерЗаписи.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;
			МенеджерЗаписи.ЭлементСтруктуры = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ЭлементСтруктуры;

			МенеджерЗаписи.Записать();

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
