&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УчетнаяПолитика = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику();

	Если УчетнаяПолитика.РазрешитьТолькоТорговыйЗал И НЕ ТехническаяПоддержкаВызовСервера.ВыполняютсяСлужебныеДействия() Тогда

		СписокНазначений = Новый СписокЗначений;
		СписокНазначений.Добавить(Перечисления.НазначенияСкладов.ТорговыйЗал);
		СписокНазначений.Добавить(Перечисления.НазначенияСкладов.УправляющаяСистема);

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"НазначениеСклада", 
			СписокНазначений, 
			Истина,
			ВидСравненияКомпоновкиДанных.ВСписке
		);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)


КонецПроцедуры
