&НаКлиенте
Процедура МножественныйВыбор(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("МножественныйВыборЗавершение", ЭтотОбъект);

	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормыВыбора.Вставить("РежимВыделения"    , "Множественный");

	ОткрытьФорму("Справочник.СегментыНоменклатуры.ФормаВыбора", ПараметрыФормыВыбора, ЭтотОбъект, ЭтотОбъект,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура МножественныйВыборЗавершение(ВыбранныеЗначения, ДополнительныеПараметры)	Экспорт

	Если ТипЗнч(ВыбранныеЗначения) = Тип("Массив") Тогда

		Для каждого СегментНоменклатуры Из ВыбранныеЗначения Цикл

			Если Объект.ДоступныеСегменты.НайтиСтроки(Новый Структура("СегментНоменклатуры", СегментНоменклатуры)).Количество() = 0 Тогда

				Объект.ДоступныеСегменты.Добавить().СегментНоменклатуры = СегментНоменклатуры;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
