
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	//установить ответственного по умолчанию
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

	//установить дату создания
	Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	//установить способ формирования
	Если НЕ ЗначениеЗаполнено(СпособФормирования) Тогда
		СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если ИмяШаблонаСКД = "ФизическиеЛица" Тогда
			ТипПолучателей = Перечисления.ТипыПолучателейСкидок.ФизическиеЛица;
		ИначеЕсли ИмяШаблонаСКД = "Контрагенты" Тогда
			ТипПолучателей = Перечисления.ТипыПолучателейСкидок.Контрагенты;
		Иначе
			ТипПолучателей = Перечисления.ТипыПолучателейСкидок.СмешанныйСписок;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
