
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Организация) тогда 	
		Объект.Организация = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация; 
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Магазин) тогда 	
		Объект.Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин; 
	КонецЕсли;

	УправлениеДоступомРТ.ПриСозданииФормыНаСервере(ЭтотОбъект);	//	LNK 17.10.2019 14:30:01
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	РасчитатьКоличествоДней()
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
	РасчитатьКоличествоДней()
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьКоличествоДней()
	Если ЗначениеЗаполнено(Объект.ДатаС) и  ЗначениеЗаполнено(Объект.ДатаПо) тогда		
		КоличествоДней = (Объект.ДатаПо - Объект.ДатаС)/(24*60*60) + 1;
	Иначе
		КоличествоДней = 0;
	КонецЕсли;
	ПересчитатьНаСервере(КоличествоДней);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РасчитатьКоличествоДней()
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.РекламныеМатериалы.ТекущиеДанные;
	ПересчитатьСумму(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.РекламныеМатериалы.ТекущиеДанные;
	ТабРеквезиты = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТекДанные.РекламнаяПлоскость,"Ширина,Высота");
	Если НЕ ТабРеквезиты.Ширина*ТабРеквезиты.Высота = 0 тогда  
		ТекДанные.ЦенаЗаКВМ = ТекДанные.Цена/(ТабРеквезиты.Ширина*ТабРеквезиты.Высота)*30;
	КонецЕсли;	
	ПересчитатьСумму(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(ТекДанные)
 ТекДанные.Сумма = ТекДанные.Количество*ТекДанные.Цена*КоличествоДней;	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьНаСервере(КоличествоДней)
	Для Каждого Строка из Объект.РекламныеМатериалы цикл
		Строка.Сумма = Строка.Количество * Строка.Цена * КоличествоДней;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыЦенаЗаКВМПриИзменении(Элемент)
	ТекДанные = Элементы.РекламныеМатериалы.ТекущиеДанные;
	ТабРеквезиты = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТекДанные.РекламнаяПлоскость,"Ширина,Высота");
	ТекДанные.Цена = ТекДанные.ЦенаЗаКВМ*ТабРеквезиты.Ширина*ТабРеквезиты.Высота/30;
	ПересчитатьСумму(ТекДанные);
КонецПроцедуры

&НаСервере
Процедура МагазинПриИзмененииНаСервере()
	Для Каждого Строка из Объект.РекламныеМатериалы цикл
		Строка.РекламнаяПлоскость = Справочники.РекламныеПлоскости.ПустаяСсылка();
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	МагазинПриИзмененииНаСервере();
КонецПроцедуры
