#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьЭНПоДокументуОснования(ДокументОснование) Экспорт
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ЕстьТТН", Ложь);
	СтруктураОтвета.Вставить("НомерТТН");
	СтруктураОтвета.Вставить("ПутьКФайлуСтикера");
	СтруктураОтвета.Вставить("ПутьКФайлуТТН");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлектроннаяНакладная.Номер КАК НомерТТН,
		|	ЭлектроннаяНакладная.ПутьКФайлуСтикера,
		|	ЭлектроннаяНакладная.ПутьКФайлуТТН
		|ИЗ
		|	Документ.ЭлектроннаяНакладная КАК ЭлектроннаяНакладная
		|ГДЕ
		|	ЭлектроннаяНакладная.ДокументОснование = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураОтвета.ЕстьТТН = Истина;
		СтруктураОтвета.НомерТТН = Выборка.НомерТТН;
		СтруктураОтвета.ПутьКФайлуСтикера = Выборка.ПутьКФайлуСтикера;
		СтруктураОтвета.ПутьКФайлуТТН = Выборка.ПутьКФайлуТТН;
	КонецЕсли;
	
	Возврат СтруктураОтвета;

КонецФункции



#КонецОбласти

#КонецЕсли