#Область ОбработчикисобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)


КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)


КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Объект.НаименованиеЛатиница = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Объект.Наименование);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеУкраинскоеПриИзменении(Элемент)

	Объект.НаименованиеУкраинскоеЛатиница = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Объект.НаименованиеУкраинское);

КонецПроцедуры
	
#КонецОбласти




