
&НаКлиенте
Процедура ЗагрузитьПравило(Команда)
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьПравилоЗавершение", ЭтотОбъект);
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов("Выберите файлы картинок", Истина, "*.xml");
	
	ОповещениеОХодеВыполнения = Новый ОписаниеОповещения("ЗагрузитьПравилоХодВыполнения", ЭтотОбъект);
	НачатьПомещениеФайловНаСервер(ОповещениеОЗавершении, ОповещениеОХодеВыполнения, , ПараметрыДиалога,
		УникальныйИдентификатор);
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьПравилоЗавершение(ПомещенныеФайлы, Дополнительно) Экспорт
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
		АдресФайла = ПомещенныйФайл.Адрес;
		Объект.ПравилаОбмена = ПрочитатьПравило(АдресФайла);
		Модифицированность = Истина;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьПравило(АдресФайла)
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	СтрокаXML = Неопределено;
	
	Попытка
        ЧтениеДанных = Новый ЧтениеДанных(ДвоичныеДанные);
        ЧтениеДанных.КодировкаТекста = КодировкаТекста.UTF8;
        ЧтениеТекста = Новый ЧтениеТекста(ЧтениеДанных.ИсходныйПоток(), КодировкаТекста.UTF8);
        СтрокаXML = ЧтениеТекста.Прочитать();
        ЧтениеТекста.Закрыть();
        ЧтениеДанных.Закрыть();
    Исключение
        Сообщить("Не удалось получить строку XML из файла.");
	КонецПопытки;
	
	Возврат СтрокаXML;
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПравилоХодВыполнения(ПомещаемыйФайлы, Помещено, ОтказОтПомещенияФайла, ПомещеноВсего, ОтказОтПомещенияФайлов, Дополнительно) Экспорт
	Состояние("Помещение файлов картинок товаров", ПомещеноВсего);
КонецПроцедуры