//	LNK 09.12.2016 09:16:08
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

//	---------------------------------------------------------------------------------------

	Индекс = 0;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		ЗаписьНабора.Период        = Отбор.Период.Значение;
		ЗаписьНабора.КодУзлаОбмена = Отбор.КодУзлаОбмена.Значение;

		Если НЕ Отбор.Индекс.Использование Тогда

				ЗаписьНабора.Индекс	= Индекс;

		Иначе	ЗаписьНабора.Индекс	= Отбор.Индекс.Значение;

		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.Пользователь) Тогда

			ЗаписьНабора.Пользователь = Пользователи.АвторизованныйПользователь();

		КонецЕсли;

		Если ПустаяСтрока(ЗаписьНабора.Компьютер) Тогда

			ЗаписьНабора.Компьютер = ИмяКомпьютера();

		КонецЕсли;

		Если ПустаяСтрока(ЗаписьНабора.ДанныеПредставление) Тогда

			ЗаписьНабора.ДанныеПредставление = СокрЛП(ЗаписьНабора.Данные);

		КонецЕсли;

		Если ЗаписьНабора.ЭлементСтруктуры.Пустая() Тогда

			Если ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Свойство("ЭлементСтруктуры") Тогда

				ЗаписьНабора.ЭлементСтруктуры = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ЭлементСтруктуры;

			КонецЕсли;

		КонецЕсли;

		Индекс = Индекс + 1;

	КонецЦикла;

КонецПроцедуры
