#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы

//	LNK 31.08.2016 14:09:47 - первое обращение к обработчику
	Если ИменаПараметровСеанса = Неопределено Тогда

		ВерсияПроверялась = Ложь;

		Если КонтекстПриложения.ЭтоКлиентскоеСоединение() И НЕ ПользователиСлужебный.ПользовательНеТребуетАвторизации() Тогда

		//	Работаем только в вызове при начале сеанса.
			ОбменДаннымиСервер.БезопасностьУправленияОбменаДанными(ВерсияПроверялась);

			Если РозничныеПродажиСерверПовтИсп.ИспользоватьВнешнююОбработкуРМК(ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин) Тогда

				УправлениеДоступом.УстановитьЗащитуОтОпасныхДействий(Ложь);

				ОписаниеЗащитыОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
				ОписаниеЗащитыОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
				ПараметрыСеанса.ИмяВнешнегоРМК = ДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку(Справочники.ДополнительныеОтчетыИОбработки.РМК, ОписаниеЗащитыОтОпасныхДействий);

			Иначе

				УправлениеДоступом.УстановитьЗащитуОтОпасныхДействий(Истина);

			КонецЕсли;

		КонецЕсли;

		Если КонтекстПриложения.ЭтоФоновоеЗадание() Тогда

			КонтекстПриложения.РегистрацияВыполненияФоновогоЗадания();

		КонецЕсли;

		Если НЕ ВерсияПроверялась И НЕ ПользователиСлужебный.ПользовательНеТребуетАвторизации() Тогда

			Справочники.СтруктураУзлов.ПроверитьВерсиюУзла();

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли


